000010*
000100***************************************************************** 00000100
000200*                   IDENTIFICATION DIVISION                     * 00000200
000300***************************************************************** 00000300
000400 IDENTIFICATION DIVISION.                                         00000400
000500 PROGRAM-ID.   PA00674D.                                          00000500
000600                                                                  00000600
000700 AUTHOR. VINEETH M.                                               00000700
000800                                                                  00000800
000900 DATE-WRITTEN.  JUNE, 2024.                                       00000900
001000                                                                  00001000
001100 DATE-COMPILED.                                                   00001100
001200                                                                  00001200
001300 INSTALLATION.      FORD MOTOR COMPANY.                           00001300
001400*                                                                 00001400
001500 COPY HHCPYRGT.                                                   00001500
001600      EJECT                                                       00001600
001700*                                                                 00001700
001800*REMARKS.                                                         00001800
001900***************************************************************** 00001900
002000*                                                               * 00002000
002100*   PROGRAM NAME:      PA00674D                                 * 00002100
002200*   PROGRAM TYPE:      BMP                                      * 00002200
002300*       PSB NAME:      PA00674D                                 * 00002300
002400*      DBMS USED:      IMS AND DB2                              * 00002400
002500*       LANGUAGE:      COBOL                                    * 00002500
002600*                                                               * 00002600
002700*   SHORT DESCRIPTION: PROCESS INPUT CJ AND DELETE NUAD USAGE   * 00002700
002800*                      FROM D22 TABLE.                          * 00002800
002810*                                                               * 00002800
002900*                                                               * 00002900
002901*    LONG DESCRIPTION: TO REMOVE NUAD USAGES ONCE SUPERSESSION  * 00002700
002902*                      REMOVED FROM SMMPRXEA.THIS PROGRAM       * 00002800
002903*                      PROCESSES 2 TYPES OF INPUTS.             * 00002800
002904*                      INPUT1-E53 TABLE DELETE CJ.              * 00002800
002905*                      INPUT2-E53 TABLE CHANGE CJ.              * 00002800
003900***************************************************************** 00003900
004000*                                                               * 00004000
004100*                                                               * 00004100
004200***************************************************************** 00004200
005800***************************************************************** 00005800
005900*            APPLICATION PROGRAM REVISION LOG                   * 00005900
006000***************************************************************** 00006000
006100*                                                                 00006100
006200*   DATE   º         º CHANGE  º                                º 00006200
006300* MM/DD/YY º INIT    º MOD NO  º          DESCRIPTION           º 00006300
006400*----------+---------+--------+---------------------------------+ 00006400
006500* 06/28/24 º VINEETH ºUS6044274ºINITIAL CODE                    º 00006500
006501*          º         º         º                                * 00007400
006502* 07/15/24 º VINEETH ºUS6313330ºCODE CHANGES TO REMOVE FILE     º 00006500
006503*          º         º         ºCHECK.FILE CHECK CAUSED PROGRAM º 00006100
006504*          º         º         ºTO RUN INTO INFINITE LOOP       º 00006100
006505*          º         º         º(TAG:DEL-FILECHK)               º 00007400
006506*          º         º         º                                * 00007400
006508* 07/18/24 º VINEETH ºUS6313330ºCODE CHANGES TO DISPLAY DELETED º 00006500
006509*          º         º         ºSMMPD22 TABLE USAGE.  IT WILL BEº 00006100
006510*          º         º         ºWRITTEN TO SYSOUT FILE.         º 00006100
006511*          º         º         º(TAG:DEL-DISPLAY)               º 00007400
006512*          º         º         º                                * 00007400
006513* 09/06/24 º VINEETH ºUS6512461ºCHANGES TO REFRESH ALL 4 ARRAYS º 00006500
006514*          º         º         ºEXCEPT INPUT FILE ARRAY ON EACH º 00006100
006515*          º         º         ºREAD.(CHANGE TAG:US6512461)     º 00006100
006517*          º         º         º                                * 00007400
006518* 10/15/24 º VINEETH ºUS6670580ºFIX TO PREVENT PROD ABEND.      º 00006500
006520*          º         º         º1-LOOP FIX.                     º 00006100
006521*          º         º         º2-MADE DEFAULT EPNS FOUND FOR   º 00006100
006522*          º         º         º  SPN AS 1.                     º 00006100
006523*          º         º         º(CHANGE TAG:US6670580)          º 00006100
006524*          º         º         º                                * 00007400
006530***************************************************************** 00006000
566983     EJECT                                                        00007200
566984***************************************************************** 00007300
566985*                                                               * 00007400
566986*    APPLICATION PROGRAMMER INSTRUCTIONS                        * 00007500
566987*                                                               * 00007600
566988*                                                               * 00007700
566989*  IDENTIFICATION DIVISION                                      * 00007800
566990*                                                               * 00007900
566991*    1.  CHANGE THE PROGRAM-ID TO THE NAME OF YOUR PROGRAM.     * 00008000
566992*                                                               * 00008100
566993*    2.  UPDATE THE PROGRAM REMARKS TO REFLECT THE PROGRAM,     * 00008200
566994*        PROGRAM TYPE, PSB-NAME, AND DBMS USED.                 * 00008300
566995*                                                               * 00008400
566996*    3.  UPDATE THE REVISION LOG TO REFLECT THE CHANGES YOU     * 00008500
566997*        ARE NOW MAKING.                                        * 00008600
566998*                                                               * 00008700
566999*                                                               * 00008800
567000*  DATA DIVISION                                                * 00008900
567001*                                                               * 00009000
567002*    1. REFERRING TO COMMENTS IN THE SECTION "VARIABLES WHICH   * 00009100
567003*       MUST BE SET BY THE APPLICATION PROGRAMMER", UPDATE THE  * 00009200
567004*       REQUIRED ENTRIES.                                       * 00009300
567005*                                                               * 00009400
567006*    2. IN THE LINKAGE SECTION, ADD ANY ADDITIONAL PCB-S THAT   * 00009500
567007*       ARE REQUIRED IN THE INDICATED PLACE.                    * 00009600
567008*                                                               * 00009700
567009*                                                               * 00009800
567010*  PROCEDURE DIVISION                                           * 00009900
567011*                                                               * 00010000
567012*    1. IF ADDITIONAL PCB-S ARE REQUIRED, UPDATE THE "ENTER"    * 00010100
567013*       STATEMENT.                                              * 00010200
567014*                                                               * 00010300
567015*                                                               * 00010400
567016*                                                               * 00010500
567017***************************************************************** 00010600
567018     EJECT                                                        00010700
567019***************************************************************** 00010800
567020*                                                               * 00010900
567021* "COPY" STATEMENTS INCLUDED IN BATCH REQUEST SHELL.            * 00011000
567022*                                                               * 00011100
567023*      BRTQSSA    - BR&T QUALIFIED SSA                          * 00011200
567024*      CHKDATA    - STORAGE FOR CHKDATA SUBROUTINE              * 00011300
567025*      COMMIMS    - COMMON IMS COMMANDS AND STATUS CODES        * 00011400
567026*      COMMDB2    - COMMON DB2 CALL TEXT DESCRIPTIONS           * 00011500
567027*      DATEPARM   - STORAGE FOR HDATERTN SUBROUTINE             * 00011600
567028*      HWSECPRM   - STORAGE FOR SECURITY PARMS SUBROUTINE       * 00011700
567029*      HARDCPY2   - STORAGE FOR HARD COPY MESSAGES              * 00011800
567030*      TBLIOWS    - STORAGE FOR HTBLIO SUBROUTINE               * 00011900
567031*      WSAAAL     - STORAGE FOR TABLE AAAL                      * 00012000
567032*      MAILISRT   - STORAGE FOR HMAIISRT SUBROUTINE             * 00012100
567033*      STMPPPCB   - LINKAGE SECTION PCB'S                       * 00012200
567034*      HPCBGSAM   - LINKAGE SECTION GSAM PCB'S                  * 00012300
567035*      BRTINPRM   - BATCH RQST AND TRACKING PARAMETERS          * 00012400
567036*      HWS0010I   - BASIC CHKP/XRST DATA AREA                   * 00012500
567037*      HWS0020I   - WORKING-STORAGE USED BY THE SHELL           * 00012600
567038*      HWS0050I   - STORAGE USED BY TABLE IO SETUP              * 00012700
567039*      NWS0060I   - CHECKPOINT FREQUENCY FILE RECORD LAYOUT     * 00012800
567040*      HWS0070I   - LITERALS USED BY HTBLIO CALLS               * 00012900
567041*      HWS0080I   - GSAM IMS FUNCTION CALLS                     * 00013000
567042*      HWS0990I   - DESCRIPTION OF PARAGRAPH NUMBERING SCHEME   * 00013100
567043*      HBP0000I   - 0000H-CONTROL-PROGRAM                       * 00013200
567044*      HBP0100I   - 0100H-PROGRAM-INIT                          * 00013300
567045*      HBP0200I   - 0200H-MAIN-PROCESS                          * 00013400
567046*      HBP0300I   - 0300H-OBTAIN-REQUEST-PARMS                  * 00013500
567047*      HBP0400I   - 0400H-END-OF-JOB                            * 00013600
567048*      HBP0600I   - 0600H-CALL-SECP-PARM                        * 00013700
567049*      HBP0700I   - 0700H-CALL-TABLE-IO                         * 00013800
567050*      HBP1000I   - 1000H-PROCESS-CHKP-FREQ-FILE                * 00013900
567051*                    (INCLUDING START OF 1010A-XRST-CALL)       * 00014000
567052*      HBP1100I   - 1100H-SHELL-SPECIFIC-INIT                   * 00014100
567053*      HBP2000I   - 2000H-SHELL-RESTART-INIT                    * 00014200
567054*      HBP3000I   - 3000H-PROCESS-REQUESTS                      * 00014300
567055*      HBP3300I   - 3300H-PROCESS-CHKP                          * 00014400
567056*      HBP3500I   - 3500H-PROCESS                               * 00014500
567057*      HBP6100I   - 6100H-DO-CHKP                               * 00014600
567058*      HBP6120I   - 6120A-CHKP-CALL (BEGINNING)                 * 00014700
567059*      HBP7000I   - 7000H-OBTAIN-BATCH-REQUESTS                 * 00014800
567060*      HBP7010I   - 7010H-OBTAIN-NEXT-BRT-BATCH                 * 00014900
567061*      HBP7700I   - 7700H-UPDATE-STATUS-COMPLETE                * 00015000
567062*      HBP8000I   - 8000H-FILL-REQUEST-TABLE                    * 00015100
567063*      HBP8020I   - 8020H-FETCH-REQUEST-OCCURRENCE              * 00015200
567064*      HBP8030I   - 8030H-HANDLE-HBRTINIT-STATUS                * 00015300
567065*      HBP8060I   - 8060H-GET-NEXT-REQUEST                      * 00015400
567066*      HBP8100I   - 8100H-INSERT-MAILBOX-MESSAGE                * 00015500
567067*      HBP8110I   - 8110H-FMT-PMI-PFKEY-SEGS                    * 00015600
567068*      ABENDBAT   - 9990H-ABNORMAL-END-OF-JOB                   * 00015700
567069*                                                               * 00015800
567070***************************************************************** 00015900
567071*                                                               * 00016000
567072     EJECT                                                        00016100
567073 ENVIRONMENT DIVISION.                                            00016200
567074 CONFIGURATION SECTION.                                           00016300
567075 OBJECT-COMPUTER. IBM-370.                                        00016400
567076 SOURCE-COMPUTER. IBM-370.                                        00016500
567077*SOURCE-COMPUTER. IBM-370 WITH DEBUGGING MODE.                    00016600
567078                                                                  00016700
567079 INPUT-OUTPUT SECTION.                                            00016800
567080 FILE-CONTROL.                                                    00016900
567081     SELECT CHKP-FREQUENCY-FILE                                   00017000
567082                     ASSIGN TO UT-S-CHKPXRST.                     00017100
567083 SKIP2                                                            00017200
567084***************************************************************** 00017300
567085*                     DATA DIVISION                             * 00017400
567086***************************************************************** 00017500
567087*                                                                 00017600
567088 DATA DIVISION.                                                   00017700
567089 FILE SECTION.                                                    00017800
567090 FD  CHKP-FREQUENCY-FILE                                          00017900
567091     RECORDING MODE F                                             00018000
567092     LABEL RECORDS ARE STANDARD                                   00018100
567093     BLOCK CONTAINS 0 RECORDS.                                    00018200
567094 01  CHKP-FREQUENCY-RECORD          PIC X(80).                    00018300
567095                                                                  00018400
567096 EJECT                                                            00018500
567097 WORKING-STORAGE SECTION.                                         00018600
567098 77  PAN-VALET PICTURE X(24) VALUE "001PA00674D  10/31/12".       00018700
567099                                                                  00018800
567100 01  WS-LITERAL                     PIC X(32)  VALUE              00018900
567101         "WORKING STORAGE BEGINS HERE".                           00019000
567102                                                                  00019100
567103     COPY  HWS0060I.                                              00019200
567104***************************************************************** 00019300
567105*    05  WS-CFR-FOR-APPLICATION-USE PIC X(31).                  * 00019400
567106*    MAY BE REDEFINED HERE AS YOU LIKE.                         * 00019500
567107***************************************************************** 00019600
567108     05  WS-FPSD-REQ-CHKP-FIELDS  REDEFINES                       00019700
567109         WS-CFR-FOR-APPLICATION-USE.                              00019800
567110         10  TEST-ABEND-SWITCH      PIC X(01).                    00019900
567111             88  ABEND-PROGRAM      VALUE "%".                    00020000
567112         10  ABEND-CHKP             PIC 9(09).                    00020100
567113         10  FILLER                 PIC X(21).                    00020200
567114                                                                  00020300
567115                                                                  00020400
567116                                                                  00020500
567117***************************************************************** 00020600
567118*  BATCH MESSAGE PROGRAM RESTART AREA                           * 00020700
567119*                                                               * 00020800
567120* THIS COPY MEMBER DEFINES THE RESTART AREA. THIS AREA IS USED  * 00020900
567121* IN "XRST" AND "CHKP" CALLS TO SAVE THE VALUES OF WORKING-     * 00021000
567122* STORAGE VARIABLES. THE AREA "WS-APPL-SPECIFIC-XRST-DATA" IS   * 00021100
567123* TO BE USED TO STORE APPLICATION-SPECIFIC DATA. THIS DATA MUST * 00021200
567124* BE SAVED WHEN A CHECKPOINT IS TAKEN, AND RESTORED WHEN AN     * 00021300
567125* IMS OR INTERNAL RESTART IS DONE.  NOTE THAT THERE IS A        * 00021400
567126* MAXIMUM LENGTH TO THIS AREA.                                  * 00021500
567127*                                                               * 00021600
567128* YOU MAY SAVE OTHER AREAS IN YOUR PROGRAM BY ADDING THEM TO    * 00021700
567129* THE XRST CALL IN PARA. 1010A AND THE CHKP CALL IN PARA.       * 00021800
567130* 6120A.  BUT SAVE (AND RESTORE) FROM (AND TO) COPIES OF        * 00021900
567131* THE DESIRED DATA, NOT THE "ORIGINALS."   WHEN A RESTART       * 00022000
567132* IS DONE, YOU OVERLAY THE "ORIGINALS" WITH THE "COPIES".       * 00022100
567133* ON IMS RESTARTS, IMS RESTORES THE SAVED DATA FOR YOU.  IF     * 00022200
567134* THE RESTART IS AN INTERNAL ONE (I.E., RECOVERY FROM A DEAD-   * 00022300
567135* LOCK), THE COPIES ARE THE ONLY SOURCES OF SAVED DATA.         * 00022400
567136*                                                               * 00022500
567137***************************************************************** 00022600
567138*                                                                 00022700
567139 01  FILLER                                PIC X(12) VALUE        00022800
567140     "**XRST-AREA*".                                              00022900
567141     COPY  HWS0010I.                                              00023000
567142     10  FILLER                            PIC X(3500).           00023100
567143     EJECT                                                        00023200
567144***************************************************************** 00023300
567145*                                                               * 00023400
567146* THIS IS THE APPLICATION-SPECIFIC RESTART AREA.                * 00023500
567147*                                                               * 00023600
567148* TO DEFINE APPLICATION-SPECIFIC DATA, REPLACE THE FILLER BELOW * 00023700
567149* WITH THE LAYOUT OF THE RESTART DATA.  IT ALL FOLLOWS THIS     * 00023800
567150* HEADING:                                                      * 00023900
567151*                                                               * 00024000
567152*  05  WS-APPL-SPECIFIC-XRST-DATA.                              * 00024100
567153*                                                               * 00024200
567154* THE RESTART AREA SHOULD INCLUDE ANY DATA YOU NEED TO RECOVER  * 00024300
567155* FROM AN IMS RESTART OR A DEADLOCK.  CANDIDATES FOR INCLUSION  * 00024400
567156* WOULD BE:                                                     * 00024500
567157*                                                               * 00024600
567158*       SUBSCRIPTS     DB2 ROW KEY DATA                         * 00024700
567159*       TOTALS         IMS/VS SEGMENT KEY DATA                  * 00024800
567160*       SWITCHES                                                * 00024900
567161*       COUNTERS                                                * 00025000
567162*       DATA FOR RESUMING THE PROCESSING OF REQUESTS            * 00025100
567163*                                                               * 00025200
567164* NOTE THAT THESE ARE "SAVED" COPIES OF VARIABLES, AND ARE TO   * 00025300
567165* BE USED ONLY TO SAVE VALUES DURING CHECKPOINT.  THE "WORKING" * 00025400
567166* VARIABLES SHOULD BE MOVED HERE WHEN THE CHECKPOINT IS TAKEN   * 00025500
567167* AND COPIED BACK FROM HERE WHEN A RESTART IS DONE.             * 00025600
567168*                                                               * 00025700
567169*<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<* 00025800
567170* THIS IS THE SAVE AREA OF OF THIS PROGRAM.  THIS IS FILLED     * 00025900
567171* DURING THE NORMAL PROCESSING.                                 * 00026000
567172*                                                               * 00026100
567173* WHEN A CHECKPOINT IS TAKEN THIS AREA IS MOVED TO THE          * 00026200
567174* WS-APPL-SPECIFIC-XRST-AREA. THAT IS DEFINED ABOVE (3500 BYTES)* 00026300
567175* AND PROVIDED BY THE SHELL.                                    * 00026400
567176*                                                               * 00026500
567177* DURING A RESTART THE DATA SAVED IN WS-APPL-SPECIFIC-XRST-AREA * 00026600
567178* DEFINED ABOVE IS MOVED INTO THE CHKPXRST-SAVE-AREA WHICH IS   * 00026700
567179* THE WORKING STORAGE VARIABLES USED THROUGHOUT THE PROGRAM.    * 00026800
567180*<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<* 00026900
567181*                                                               * 00027000
567182***************************************************************** 00027100
567183*                                                                 00027200
567184 01  FILLER                                PIC X(16) VALUE        00027300
567185     "*XRST-SAVE-AREA*".                                          00027400
567186                                                                  00027500
567187 01  WS-APPL-SPECIFIC-XRST-AREA-SVD.                              00027600
567188     05  WS-XRST-RSA-GSAM.                                        00027610
567189         10  WS-XRST-RSA-GSAM-WORD1        PIC S9(10) COMP.       00027620
567190     05  WS-XRST-GMT-TIMESTAMP             PIC X(26).             00027650
567191     05  WS-XRST-CHKP-CNT                  PIC S9(09) COMP-3.     00027700
567192     05  WS-XRST-COUNTERS.                                        00027800
567193         10  WS-XRST-RECS-READ             PIC S9(09) COMP-3.     00027900
567196*NUAD BEGIN
567197         10  WS-XRST-D22-READ              PIC S9(07) COMP-3      00028000
567198                                           VALUE ZEROES.
567199         10  WS-XRST-D22-DELETED           PIC S9(07) COMP-3      00028500
567200                                           VALUE ZEROES.
567201         10  WS-XRST-D26-READ              PIC S9(07) COMP-3      00028000
567202                                           VALUE ZEROES.
567205*NUAD END
567209         10  WS-ERROR-CNT                  PIC S9(07) COMP-3.     00028603
567211         10  WS-BATCH-DETAIL-CNT           PIC S9(07) COMP-3.     00028610
567212         10  WS-XRST-CURRENT-DATE          PIC X(10).             00028700
567213         10  WS-XRST-CURRENT-TIME          PIC X(08).             00028800
567214         10  WS-XRST-RPT-PAGE-CTR          PIC S9(09) COMP-3.     00028900
567215         10  WS-XRST-RPT-LINE-CTR          PIC S9(09) COMP-3.     00029000
567216         10  WS-CHECK-UPDATE               PIC X(01) VALUE "N".
567217                                                                  00029300
567218     EJECT                                                        00030200
567219     COPY  HWS0020I.                                              00030300
567220                                                                  00030400
567221***************************************************************** 00030500
567222* THIS FIELD IS USED TO DETERMINE THE TYPE OF ERROR TO PROCESS. * 00030600
567223* THE PROGRAMMER IS RESPONSIBLE FOR SETTING THE APPROPRIATE     * 00030700
567224* VALUE WHEN A FATAL ERROR CONDITION IS DETECTED                * 00030800
567225***************************************************************** 00030900
567226                                                                  00031000
567227 01  WS-ABEND-ERROR-TYPE            PIC X(03) VALUE SPACES.       00031100
567228     88  WS-ABEND-IMS-ERROR                   VALUE "IMS".        00031200
567229     88  WS-ABEND-SQL-ERROR                   VALUE "SQL".        00031300
567230     88  WS-ABEND-NON-DBMS-ERROR              VALUE "   ".        00031400
567231                                                                  00031500
567232     EJECT                                                        00031600
567233***************************************************************** 00031700
567234*                                                               * 00031800
567235* APPLICATION-SPECIFIC WORKING STORAGE                          * 00031900
567236*                                                               * 00032000
567237*                                                               * 00032100
567238*    THE APPLICATION PROGRAMMER SHOULD INCLUDE HERE ANY         * 00032200
567239*    WORKING STORAGE PARTICULAR TO THE APPLICATION. EXAMPLES    * 00032300
567240*    MIGHT BE:                                                  * 00032400
567241*                                                               * 00032500
567242*      IF THE PROGRAM IS A NON-RESPONSE MPP, INCLUDE THE LAYOUT * 00032600
567243*        OF THE INPUT MESSAGE.                                  * 00032700
567244*                                                               * 00032800
567245*      LAYOUTS OF DATA BASE SEGMENTS.                           * 00032900
567246*                                                               * 00033000
567247*      DECLARATIONS OF HOST VARIABLES.                          * 00033100
567248*                                                               * 00033200
567249*      DB2 TABLE DEFINITIONS.                                   * 00033300
567250*                                                               * 00033400
567251***************************************************************** 00033500
567252                                                                  00033600
567253 01  WS-APPL-REQUIRED-STUFF.                                      00033700
567254                                                                  00033800
567255***************************************************************** 00033900
567256* THE VALUE OF "PROGRAM-NAME" SHOULD BE SET TO THAT FOUND IN THE* 00034000
567257* PROGRAM-ID IN THE IDENTIFICATION DIVISION.                    * 00034100
567258***************************************************************** 00034200
567259                                                                  00034300
567260     05  PROGRAM-NAME               PIC X(08) VALUE "PA00674D".   00034400
567261                                                                  00034500
567262***************************************************************** 00034600
567263* THE VALUE OF "SW-BATCH-RQST-CNTL-PARM" MUST BE SET TO "R" IF  * 00034700
567264* USING BR&T ONLY, "N" IF NOT USING BR&T.  THE PROGRAM WILL     * 00034800
567265* DEFAULT TO PROCESSING NON BATCH REQUEST.                      * 00034900
567266***************************************************************** 00035000
567267                                                                  00035100
567268     05  SW-BATCH-RQST-CNTL-PARM    PIC X(01) VALUE "N".          00035200
567269         88  BATCH-RQST-TABLE-USED            VALUE "R".          00035300
567270         88  BATCH-PARM-NOT-USED              VALUE "N".          00035400
567271                                                                  00035500
567272***************************************************************** 00035600
567273* THE VALUE OF "SW-PROGRAM-RESTARTABLE" INDICATES WHETHER THIS  * 00035700
567274* PROGRAM MAY BE RESUMED FROM AN IMS CHECKPOINT OR MUST BE      * 00035800
567275* RERUN FROM THE BEGINNING IF IT ABENDS.  IT AFFECTS THE TIME   * 00035900
567276* AT WHICH BRT REQUESTS ARE MARKED COMPLETE, AND WHETHER A BRT  * 00036000
567277* REQUEST IS MARKED EXECUTING, AND WHETHER AN IMS RESTART IS    * 00036100
567278* ACCEPTED.                                                     * 00036200
567279***************************************************************** 00036300
567280                                                                  00036400
567281     05  SW-PROGRAM-IS-RESTARTABLE  PIC X(01) VALUE "Y".          00036500
567282         88  PROGRAM-IS-RESTARTABLE           VALUE "Y".          00036600
567283         88  PROGRAM-IS-RERUNNABLE            VALUE "N".          00036700
567284                                                                  00036800
567285***************************************************************** 00036900
567286* IF YOU PREFER THAT THE PROGRAM READ A DRIVING RECORD IMMED-   * 00037000
567287* IATELY AFTER GETTING EACH BATCH OF REQUESTS, AND CHECKPOINT-  * 00037100
567288* ING BEFORE THE DRIVING RECORD IS PROCESSED, SET SW-PRIMING-   * 00037200
567289* READ-REQUESTED TO "Y".  (A PRIMING READ IS USEFUL WHEN THE    * 00037300
567290* DRIVING RECORDS ARE THE ONLY CONTROL ON THE MAIN PROCESS--    * 00037400
567291* E.G., A SEQUENTIAL FILE.)  A BREAK IN THE DRIVING RECORDS     * 00037500
567292* MAY BE CONSIDERED THE END OF A "REQUEST," AND PARAS. 3100A    * 00037600
567293* AND 3400A ARE AVAILABLE TO PROCESS SUCH BREAKS.               * 00037700
567294* IF YOU PREFER THAT THE PROGRAM CHECKPOINT AFTER A DRIVING     * 00037800
567295* RECORD IS PROCESSED, LEAVE SW-PRIMING-READ-REQUESTED SET      * 00037900
567296* TO "N".  THIS IS USUALLY DONE WHEN THE DRIVING RECORDS        * 00038000
567297* ARE SELECTED BASED ON, FOR EXAMPLE, A BRT REQUEST.            * 00038100
567298******************************************************************00038200
567299                                                                  00038300
567300     05  SW-PRIMING-READ-REQUESTED  PIC X(01) VALUE "N".          00038400
567301         88  PRIMING-READ-REQUESTED           VALUE "Y".          00038500
567302         88  NOT-PRIMING-READ-REQUESTED       VALUE "N".          00038600
567303                                                                  00038700
567304     EJECT                                                        00038800
567305***************************************************************** 00038900
567306* THE FIELD "WS-LEN-LONGEST-IO-AREA" SHOULD NOT BE CHANGED,     * 00039000
567307* UNLESS THE APPLICATION PROGRAMMER USES AN IO-AREA FOR IMS/VS  * 00039100
567308* CALLS WHICH IS LARGER THAN  2200  BYTES.IF SO, SET THE FIELD  * 00039200
567309* TO A NUMBER AT LEAST AS LARGE AS THE LARGEST IO-AREA.         * 00039300
567310***************************************************************** 00039400
567311                                                                  00039500
567312     05  WS-LEN-LONGEST-IO-AREA     PIC S9(8) VALUE +2200 COMP.   00039600
567313                                                                  00039700
567314     EJECT                                                        00039800
567315****************************************************************  00039900
567316* THE FOLLOWING DATA ELEMENT IS USED BY THE SHELL TO CONTROL   *  00040000
567317* CHECKPOINT PROCESSING. IT COMES FROM THE CHECKPOINT          *  00040100
567318* FREQUENCY FILE.  WHEN EXCEEDED BY THE CHECKPOINT COUNTER,    *  00040200
567319* A CHECKPOINT IS TAKEN.                                       *  00040300
567320****************************************************************  00040400
567321                                                                  00040500
567322     05  WS-CHKP-LIMIT              PIC S9(8) VALUE +500 COMP.    00040600
567323                                                                  00040700
567324***************************************************************** 00040800
567325* THE FOLLOWING DATA ELEMENT REFLECTS THE NUMBER OF TIMES THE   * 00040900
567326* PROGRAMMER WILL ALLOW THE PROGRAM TO RECOVER FROM DEADLOCK    * 00041000
567327* BEFORE ABENDING.  THIS VALUE IS SUPPLIED IN THE CHECKPOINT    * 00041100
567328* FREQUENCY FILE.                                               * 00041200
567329***************************************************************** 00041300
567330                                                                  00041400
567331     05  WS-INTERNAL-RESTART-MAX    PIC S9(4) VALUE +5 COMP.      00041500
567332                                                                  00041600
567333****************************************************************  00041700
567334* "WS-NUMBER-OF-RQST-TYPES" SHOULD BE SET TO THE NUMBER OF     *  00041800
567335* DIFFERENT TYPES OF REQUESTS WHICH THE PROGRAM MAY PROCESS.   *  00041900
567336* IT HAS A MAXIMUM VALUE OF  3.                                *  00042000
567337****************************************************************  00042100
567338                                                                  00042200
567339     05  WS-NUMBER-OF-RQST-TYPES    PIC S9(4) VALUE +1 COMP.      00042300
567340                                                                  00042400
567341****************************************************************  00042500
567342* "WS-NUMBER-OF-RQST-OCCURRENCES" SHOULD BE SET TO THE MAXIMUM *  00042600
567343* NUMBER OF REQUESTS OF ANY TYPE WHICH MAY BE PROCESSED AT THE *  00042700
567344* SAME TIME. IT HAS A MAXIMUM VALUE OF  8.                     *  00042800
567345****************************************************************  00042900
567346                                                                  00043000
567347     05  WS-NUMBER-OF-RQST-OCCURRENCES                            00043100
567348                                    PIC S9(4) VALUE +1 COMP.      00043200
567349                                                                  00043300
567350***************************************************************** 00043400
567351* THE FOLLOWING TABLE LISTS THE NAMES OF THE REQUESTS WHICH THE * 00043500
567352* PROGRAM PROCESSES. THE PROGRAMMER SHOULD UPDATE THE TABLE TO  * 00043600
567353* REFLECT THE CORRECT REQUEST NAMES, AND SHOULD ALSO UPDATE THE * 00043700
567354* FOLLOWING "OCCURS" STATEMENT WITH THE CORRECT NUMBER OF TABLE * 00043800
567355* ENTRIES.                                                      * 00043900
567356***************************************************************** 00044000
567357                                                                  00044100
567358     05  WS-A-RQST-ENTRIES.                                       00044200
567359         10  WS-REQUEST-1           PIC X(08) VALUE "XXXXXXXX".   00044300
567360         10  FILLER                 PIC X(01) VALUE "F".          00044400
567361         10  WS-REQUEST-2           PIC X(08) VALUE "YYYYYYYY".   00044500
567362         10  FILLER                 PIC X(01) VALUE "F".          00044600
567363         10  WS-REQUEST-3           PIC X(08) VALUE "ZZZZZZZZ".   00044700
567364         10  FILLER                 PIC X(01) VALUE "F".          00044800
567365*****                                                             00044900
567366     05  WS-H-RQST-PROCESS-STATUS-TABLE                           00045000
567367              REDEFINES  WS-A-RQST-ENTRIES.                       00045100
567368         10  WS-H-RQST-OCCURS       OCCURS  1  TIMES.             00045200
567369             15  WS-RQST-PROCESS-ID     PIC X(08).                00045300
567370             15  WS-RQST-PROCESSED-SW   PIC X(01).                00045400
567371     EJECT                                                        00045500
567372***************************************************************** 00045600
567373** FIELDS FOR APPLICATION SPECIFIC DATA AREA DEFINED HERE      ** 00045700
567374***************************************************************** 00045800
567375 01  FILLER                               PIC X(27) VALUE         00045900
567376        "BEGIN WS-APPL-SPECIFIC-DATA".                            00046000
567377                                                                  00046100
567378 01  WS-APPL-SPECIFIC-DATA.                                       00046200
567379     05  WS-TEST-ABEND-DATA.                                      00046300
567380         10  FILLER                      PIC X(11) VALUE          00046400
567381             "##TEST-AB##".                                       00046500
567382         10  TEST-ALPHA                  PIC X(01)  VALUE SPACE.  00046600
567383         10  TEST-COMP3                  PIC S9(01) VALUE +1.     00046700
567384                                                                  00046800
567385***************************************************************** 00046900
567386** FIELDS FOR PROGRAM SWITCHES AREA DEFINED HERE               ** 00047000
567387***************************************************************** 00047100
567388                                                                  00047200
567389     05  WS-SWITCHES.                                             00047300
567390                                                                  00047400
567391         10  FILLER                       PIC X(12) VALUE         00047500
567400             "##SWITCHES##".                                      00047600
567706                                                                  00050600
567707***************************************************************** 00050700
567708** FIELDS FOR PROGRAM PARAGRAPH NUMBERS AND LITERALS DEFINES   ** 00050800
567709***************************************************************** 00050900
567710                                                                  00051000
567711         05  FILLER                      PIC X(22)  VALUE         00051100
567712             "LITERALS & CONSTANTS  ".                            00051200
567713                                                                  00051300
567714         05  LITERALS-AND-CONSTANTS.                              00051400
567715                                                                  00051500
567716             15  LIT-MISC.                                        00051600
567717                 20  LIT-Y               PIC X(01) VALUE "Y".     00051700
567718                 20  LIT-G               PIC X(01) VALUE "G".     00051800
567719                 20  LIT-S               PIC X(01) VALUE "S".     00051800
567720                 20  LIT-N               PIC X(01) VALUE "N".     00051800
567721                 20  LIT-1               PIC X(1)  VALUE "1".     00051800
567722                 20  LIT-B               PIC X(01) VALUE "B".     00051800
567723                 20  LIT-C               PIC X(01) VALUE "C".     00051800
567724                 20  LIT-D               PIC X(01) VALUE "D".     00051800
567725                 20  LIT-F               PIC X(01) VALUE "F".     00051800
567726                 20  LIT-I               PIC X(01) VALUE "I".     00051800
567727                 20  LIT-M               PIC X(01) VALUE "M".     00051800
567728                 20  LIT-P               PIC X(01) VALUE "P".     00051800
567729                 20  LIT-R               PIC X(01) VALUE "R".     00051800
567730                 20  LIT-U               PIC X(01) VALUE "U".     00051800
567731                 20  LIT-V               PIC X(01) VALUE "V".     00051800
567732                 20  LIT-W               PIC X(01) VALUE "W".     00051800
567733                 20  LIT-A               PIC X(01) VALUE "A".     00051900
567734                 20  LIT-E               PIC X(01) VALUE "E".     00051910
567735                 20  LIT-0000            PIC X(04) VALUE "0000".  00052100
567736                 20  LIT-00              PIC X(02) VALUE "00".    00052200
567737                 20  LIT-DASH            PIC X(01) VALUE "-".     00052600
567738                 20  LIT-COMMA           PIC X(01) VALUE ",".     00052700
567739                 20  LIT-SLASH           PIC X(01) VALUE "/".     00052800
567740                 20  LIT-SPACES          PIC X(01) VALUE SPACES.  00052800
567741                 20  LIT-COLON           PIC X(01) VALUE ":".     00052900
567742                 20  LIT-LOW-DATE   PIC X(10)  VALUE "0000-01-01".00053000
567743                 20  LIT-HIGH-DATE  PIC X(10)  VALUE "9999-12-31".00053100
567744                                                                  00055200
567745             15  LIT-PARAGRAPH-NUMBER.                            00055300
567746                 20  LIT-3400A           PIC X(05) VALUE "3400A". 00055500
567747                 20  LIT-3600A           PIC X(05) VALUE "3600A". 00055510
567748                 20  LIT-3610M           PIC X(05) VALUE "3610M". 00055600
567749                 20  LIT-3620M           PIC X(05) VALUE "3620M". 00055700
567750                 20  LIT-4000M           PIC X(05) VALUE "4000M". 00057600
567751                 20  LIT-4225M           PIC X(05) VALUE "4225M". 00057603
567752                 20  LIT-4250M           PIC X(05) VALUE "4250M". 00057605
567753                 20  LIT-4255M           PIC X(05) VALUE "4255M". 00057605
567754                 20  LIT-4257M           PIC X(05) VALUE "4257M". 00057605
567755                 20  LIT-4258M           PIC X(05) VALUE "4258M". 00057605
567756                 20  LIT-4259M           PIC X(05) VALUE "4259M". 00057605
567757                 20  LIT-4260M           PIC X(05) VALUE "4260M". 00057605
567758                 20  LIT-4261M           PIC X(05) VALUE "4261M". 00057605
567759                 20  LIT-4300M           PIC X(05) VALUE "4300M". 00057606
567760                 20  LIT-4307M           PIC X(05) VALUE "4307M". 00057606
567761                 20  LIT-4350M           PIC X(05) VALUE "4350M". 00057607
567762                 20  LIT-4503M           PIC X(05) VALUE "4503M". 00057608
567763                 20  LIT-4504M           PIC X(05) VALUE "4504M". 00057609
567764                 20  LIT-4505M           PIC X(05) VALUE "4505M". 00057610
567765                 20  LIT-4506M           PIC X(05) VALUE "4506M". 00057611
567766                 20  LIT-4507M           PIC X(05) VALUE "4507M". 00057612
567767                 20  LIT-4508M           PIC X(05) VALUE "4508M". 00057613
567768                 20  LIT-4515M           PIC X(05) VALUE "4515M". 00057614
567769                 20  LIT-4516M           PIC X(05) VALUE "4516M". 00057615
567770                 20  LIT-4520M           PIC X(05) VALUE "4520M". 00057616
567771                 20  LIT-4550M           PIC X(05) VALUE "4550M". 00057617
567772                 20  LIT-4551M           PIC X(05) VALUE "4551M". 00057617
567773                 20  LIT-4700M           PIC X(05) VALUE "4700M". 00057618
567774                 20  LIT-4720M           PIC X(05) VALUE "4720M". 00057619
567775                 20  LIT-4740M           PIC X(05) VALUE "4740M". 00057620
567776                 20  LIT-4990M           PIC X(05) VALUE "4990M". 00057621
567777                 20  LIT-5000A           PIC X(05) VALUE "5000A". 00057622
567778                 20  LIT-5001M           PIC X(05) VALUE "5001M". 00057623
567779                 20  LIT-5002M           PIC X(05) VALUE "5002M". 00057630
567780                 20  LIT-5003M           PIC X(05) VALUE "5003M". 00057640
567781                 20  LIT-5300M           PIC X(05) VALUE "5300M". 00058100
567782                 20  LIT-5400M           PIC X(05) VALUE "5400M". 00058101
567783                 20  LIT-5500M           PIC X(05) VALUE "5500M". 00058110
567784                 20  LIT-5600M           PIC X(05) VALUE "5600M". 00058200
567785                 20  LIT-5650M           PIC X(05) VALUE "5650M". 00058210
567786                 20  LIT-5700M           PIC X(05) VALUE "5700M". 00058300
567787                 20  LIT-5800M           PIC X(05) VALUE "5800M". 00058400
567788                 20  LIT-5900M           PIC X(05) VALUE "5900M". 00058500
567789                 20  LIT-5950M           PIC X(05) VALUE "5950M". 00058510
567790                 20  LIT-8300A           PIC X(05) VALUE "8300A". 00058600
567791                                                                  00058700
567792     05 LIT-E54-TABLE                    PIC X(17) VALUE
567793                                          "SMMPE54_REG_SV_PT".
567794     05 LIT-E62-TABLE                    PIC X(17) VALUE
567795                                          "SMMPE62_PDC_SV_PT".
567796     05 LIT-SPART-OBS-Y                   PIC X(18) VALUE
567797                                          "SPART_OBS_Y       ".
567798     05 LIT-SPART-OBS-C                   PIC X(18) VALUE
567799                                          "SPART_OBS_C       ".
567800***************************************************************** 00058800
567801** PROGRAM CONSTANT AREA                                       ** 00058900
567802***************************************************************** 00059000
567803                                                                  00059100
567804     05  FILLER                          PIC  X(13) VALUE         00059200
567805         "PGM-CONSTANTS".                                         00059300
567806                                                                  00059400
567807     05  WS-PGM-CONSTANT-AREA.                                    00059500
567808         10  WS-MAX-LINES-PER-PAGE      PIC S9(03) VALUE +60.     00059600
567809         10  WS-RPT-LINE-CTR-2          PIC S9(04) VALUE +61.     00059700
567810***************************************************************** 00059800
567811** PROGRAM MESSAGES AREA                                       ** 00059900
567812***************************************************************** 00060000
567813                                                                  00060100
567814     05  FILLER                          PIC  X(13) VALUE         00060200
567815         "PGM-MESSAGES ".                                         00060300
567816                                                                  00060400
567817     05  WS-PGM-MESSAGES-AREA.                                    00060500
567818         10  LIT-GSAM-IN-REPOSITION-ERR PIC X(21) VALUE           00060600
567819                                      "GSAM REPOSITION ERROR".    00060700
567820                                                                  00060800
567821         10  LIT-NOTFY-DISP-MSG         PIC X(50) VALUE           00061200
567822         "SETTING NOTIFY DATE WHEN ALREADY SET IN E14   ".        00061300
567823                                                                  00061400
567824         10  LIT-NOTFY-DISP-E54-MSG     PIC X(50) VALUE           00061200
567825         "SETTING NOTIFY DATE WHEN ALREADY SET IN E54   ".        00061300
567826                                                                  00061400
567827         10  LIT-NOTFY-PEND-MSG         PIC X(50) VALUE           00061401
567828         "SETTING NOTIFY DATE WHEN PENDING IS NOT SET IN E14".    00061402
567829                                                                  00061403
567830         10  LIT-NOTFY-PEND-E54-MSG     PIC X(50) VALUE           00061401
567831         "SETTING NOTIFY DATE WHEN PENDING IS NOT SET IN E54".    00061402
567832                                                                  00061403
567833         10  LIT-OBS-NOTFY-MSG          PIC X(50) VALUE           00061404
567834         "SETTING NOTIFY DATE WHEN OBS EFF IS SET FOR E14".       00061405
567835                                                                  00061406
567836         10  LIT-OBS-NOTFY-E54-MSG      PIC X(50) VALUE           00061404
567837         "SETTING NOTIFY DATE WHEN OBS EFF IS SET FOR E54".       00061405
567838                                                                  00061406
567839         10  LIT-TRLR-REC-MISSING       PIC X(30) VALUE           00061407
567840         "MISSING TRAILER REC ON INPUT".                          00061408
567841                                                                  00061409
567842         10  LIT-PEND-DT-DISP-MSG       PIC X(50) VALUE           00061410
567843         "PENDING DATE IS SET AND SVC DISP IS SPACES - E14".      00061411
567844                                                                  00061412
567845         10  LIT-PEND-DT-DISP-E54-MSG   PIC X(50) VALUE           00061410
567846         "SETTING PEND DATE WHEN E54 PEND IS ALREADY SET".        00061411
567847                                                                  00061412
567848         10  LIT-PEND-DT-DISP-E62-MSG   PIC X(50) VALUE           00061410
567849         "SETTING PEND DATE WHEN E62 PEND OR EFF SET".            00061411
567850                                                                  00061412
567851         10  LIT-PEND-DISP-MSG          PIC X(50) VALUE           00061413
567852         "OBSOLETING A SVC PART W/OUT A PRIOR SVC DISP  ".        00061414
567853                                                                  00061415
567854         10  LIT-PEND-MSG               PIC X(50) VALUE           00061416
567855         "OBSOLETING A SVC PART W/OUT A PENDING DATE SET".        00061417
567856                                                                  00061418
567857         10  LIT-NO-HDR                 PIC X(50) VALUE           00061419
567858         "INPUT HEADER IS NOT RECOGNISABLE              ".        00061420
567859                                                                  00061421
567860         10  LIT-OBS-MSG                PIC X(50) VALUE           00061422
567861         "SETTING A PENDING DATE WHEN CURRENTLY OBSOLETE".        00061423
567862                                                                  00061424
567863         10  LIT-PEND-GTR-MSG           PIC X(50) VALUE           00061425
567864         "WNG SVC PRT HAS PND DTE GTR THAN SAP DATE     ".        00061426
567865                                                                  00061427
567866         10  LIT-NOT-VALID-MSG          PIC X(50) VALUE           00061428
567867         "INVALID REC TYPE SENT FROM SAP                ".        00061429
567868                                                                  00061430
567869         10  LIT-ZERO-DATE-MSG          PIC X(50) VALUE           00061431
567870         "SERVICE PART HAS A ZERO DATE SENT BY SAP      ".        00061432
567871                                                                  00061433
567872         10  LIT-E14-MSG                PIC X(50) VALUE           00061434
567873         "SERVICE PART NOT FOUND ON SMMPE14 TABLE       ".        00061435
567874                                                                  00061436
567875         10  LIT-E54-MSG                PIC X(50) VALUE           00061434
567876         "SERVICE PART NOT FOUND ON SMMPE54 TABLE       ".        00061435
567877                                                                  00061436
567878         10  LIT-E62-MSG                PIC X(50) VALUE           00061434
567879         "SERVICE PART NOT FOUND ON SMMPE62 TABLE       ".        00061435
567880                                                                  00061436
567890         10  LIT-E62-MF-MSG             PIC X(50) VALUE           00061434
567891         "MARKET APPLICATIN FLAG IS NOT SET             ".        00061435
567892                                                                  00061436
567893         10  LIT-E54-MSG-REG            PIC X(50) VALUE           00061434
567894         "SERVICE PART NOT AVAILABLE IN REGION          ".        00061435
567895                                                                  00061436
567896         10  LIT-E14-OBS-MSG            PIC X(50) VALUE           00061437
567897         "SERVICE PART ALREADY HAS OBSOLESENCE DATE SET ".        00061438
567898                                                                  00061439
567899         10  LIT-NO-VALID-TYPE-MSG-14   PIC X(50) VALUE           00061440
567900         "NOT A VALID DATE TYPE  - MUST BE N/P/O      ".          00061441
567901
567902         10  LIT-NO-VALID-TYPE-MSG-54   PIC X(50) VALUE           00061440
567903         "NOT A VALID DATE TYPE  - MUST BE N/P/O     ".           00061441
567904                                                                  00061442
567905         10  LIT-FINAL-PEND-NOT-MSG     PIC X(50) VALUE           00061443
567906         "SETTING OBS EFF DT WHEN E14 PEND OR NOTIFY NOT SET".    00061444
567907                                                                  00061445
567908         10  LIT-FINAL-PEND-NOT-E54-MSG PIC X(50) VALUE           00061443
567909         "SETTING OBS EFF DT WHEN E54 PEND OR NOTIFY NOT SET".    00061444
567910                                                                  00061445
567911         10  LIT-FINAL-SVC-DISP-MSG     PIC X(50) VALUE           00061446
567912         "SETTING A OBS EFF DATE WHEN E14 SVC DISP NOT SET".      00061447
567913
567914         10  LIT-FINAL-SVC-DISP-E54-MSG PIC X(50) VALUE           00061446
567915         "SETTING A OBS EFF DATE WHEN E54 SVC DISP NOT SET".      00061447
567916                                                                  00061448
567917         10  LIT-FINAL-SET-DISP-MSG     PIC X(50) VALUE           00061449
567918         "SETTING A OBS EFF DATE WHEN E14 DATES ALL SET   ".      00061450
567919                                                                  00061451
567920         10  LIT-FINAL-SET-DISP-E54-MSG PIC X(50) VALUE           00061449
567921         "SETTING A OBS EFF DATE WHEN E54 DATES ALL SET   ".      00061450
567922                                                                  00061451
567923         10  LIT-FINAL-SET-DISP-E62-MSG PIC X(50) VALUE           00061449
567924         "SETTING A OBS EFF DATE WHEN E62 DATES ALL SET   ".      00061450
567925                                                                  00061451
567926         10  LIT-NOTFY-SVC-DISP-MSG     PIC X(50) VALUE           00061452
567927         "SETTING A NOTFY EFF DATE WHEN E14 SVC DISP NOT SET".    00061453
567928                                                                  00061454
567929         10  LIT-NOTFY-SVC-DISP-E54-MSG PIC X(50) VALUE           00061452
567930         "SETTING A NOTFY EFF DATE WHEN E54 SVC DISP NOT SET".    00061453
567940                                                                  00061454
567950         10  LIT-NOTFY-SVC-DISP-E62-MSG PIC X(50) VALUE           00061452
567951         "SETTING A NOTFY EFF DATE WHEN E62 PEND OR EFF SET".     00061453
567952                                                                  00061454
567953         10  LIT-PEND-SVC-DISP-MSG      PIC X(50) VALUE           00061455
567954         "SETTING A PENDING DATE WHEN E14 SVC DISP IS SET".       00061456
567955                                                                  00061457
567956         10  LIT-PEND-SVC-DISP-E54-MSG  PIC X(50) VALUE           00061455
567957         "SETTING A PENDING DATE WHEN E54 SVC DISP IS SET".       00061456
567958                                                                  00061457
567959         10  LIT-TRAILER-HEADER         PIC X(70) VALUE           00061458
567960         "TRAILER WITH NO PREVIOUS HEADER FOUND ".                00061459
567961                                                                  00061460
567962         10  LIT-HEADER-TRAILER         PIC X(70) VALUE           00061461
567963         "HEADER WITH NO PREVIOUS TRAILER FOUND ".                00061462
567964                                                                  00061463
567965         10  LIT-DETAIL-ERROR           PIC X(70) VALUE           00061464
567966         "DETAILS WITH NO PREVIOUS HEADER FOUND ".                00061465
567967                                                                  00061466
567968         10  LIT-TRAILER-COUNT-ERROR    PIC X(70)  VALUE          00061467
567969         "DETAIL RECORD COUNT DOES NOT MATCH TOTAL ON TRLR REC.". 00061468
567970         10  LIT-NAF-FILE               PIC X(70)  VALUE          00061469
567971         "PA.PA0067.NA.BTR.OBS.UPDATE           ".                00061470
567972         10  LIT-INPUT-FILE             PIC X(70)  VALUE          00061471
567973         "BATCH INPUT FILE RECORDS              ".                00061472
567976         10  LIT-ERROR-CNT              PIC X(70)  VALUE          00061475
567977         "RECS ON THE ERROR FILE                ".                00061476
567978         10  LIT-OPEN-CURSOR-ERROR     PIC X(70) VALUE            00061477
567979                                      "OPEN CURSOR ERROR   ".     00061478
567980         10  LIT-FETCH-CURSOR-ERROR    PIC X(70) VALUE            00061479
567981                                      "FETCH CURSOR ERROR  ".     00061480
567982         10  LIT-CLOSE-CURSOR-ERROR     PIC X(70) VALUE           00061481
567983                                      "CLOSE CURSOR ERROR  ".     00061482
567984         10  LIT-E14-SELECT-ERROR       PIC X(70) VALUE           00061483
567985                                      "SMMPE14 SELECT ERROR".     00061484
567986         10  LIT-E62-SELECT-ERROR       PIC X(70) VALUE           00061483
567987                                      "SMMPE62 SELECT ERROR".     00061484
567988         10  LIT-IMPACTED-CATEGORY      PIC X(18)                 00061485
567989                                  VALUE "IMPACTED_CATEGORY ".     00061486
567990                                                                  00061487
567991         10  LIT-E14-UPDT-ERROR         PIC X(70) VALUE           00061488
567992                                      "SMMPE14 UPDT ERROR ".      00061489
567993                                                                  00061490
567994         10  LIT-E62-UPDT-ERROR         PIC X(70) VALUE           00061488
567995                                      "SMMPE62 UPDT ERROR ".      00061489
567996                                                                  00061490
567997         10  LIT-INPUT-READ-ERR         PIC X(70) VALUE           00061491
567998                                      "INVALID READ ERROR ".      00061492
567999                                                                  00061493
568000         10  LIT-INVALID-OPEN-CALL      PIC X(70) VALUE           00061494
568001                                      "INVALID OPEN CALL  ".      00061495
568002                                                                  00061496
568003         10  LIT-INVALID-CLOSE-CALL     PIC X(70) VALUE           00061500
568004                                      "INVALID CLOSE CALL  ".     00061600
568005                                                                  00061700
568006         10  LIT-SQL-ERROR-X            PIC X(09) VALUE           00061800
568007                                      "SQL ERROR".                00061900
568008                                                                  00062000
568009                                                                  00062400
568010***************************************************************** 00062500
568011** WS TEST AREA #1                                             ** 00062600
568012***************************************************************** 00062700
568013                                                                  00062800
568014     05  FILLER                          PIC  X(14) VALUE         00062900
568015         "WS-TEST-AREA-1".                                        00063000
568016                                                                  00063100
568017     05  WS-TEST-AREA-1.                                          00063200
568018         10  WS-DATE-NUM                PIC S9(7)  VALUE +0.      00063300
568019         10  WS-DATE-NUM-RDF         REDEFINES                    00063400
568020             WS-DATE-NUM.                                         00063500
568021             15  FILLER                  PIC S9(01).              00063600
568022             15  WS-DATE-NUM-RDF-MMDDYY.                          00063700
568023                 20  WS-DATE-NUM-RDF-MM  PIC  9(02).              00063800
568024                 20  WS-DATE-NUM-RDF-DD  PIC  9(02).              00063900
568025                 20  WS-DATE-NUM-RDF-YY  PIC  9(02).              00064000
568026                                                                  00064100
568027         10  FILLER                      PIC X(17)  VALUE         00064200
568028             "WS-DATE-OUT-PARM=".                                 00064300
568029         10  CAT1                        PIC X(01).               00064301
568030         10  WS-SPACE                    PIC X(01).               00064310
568031         10  WS-DATE-OUT-PARM            PIC 9(08) VALUE ZEROS.   00064400
568032         10  WS-SVC-PART                 PIC X(40) VALUE SPACES.  00064501
568033*        10  WS-CURRENT-TIMESTAMP        PIC X(26) VALUE SPACES.  00064520
568034         10  FILLER                      PIC X(10) VALUE          00064600
568035             "&CURR-DATE".                                        00064700
568036         10  WS-CURRENT-DATE             PIC X(10).               00064800
568037         10  WS-CURRENT-DATE-RDF    REDEFINES                     00064900
568038             WS-CURRENT-DATE.                                     00065000
568039             15  WS-CURR-YEAR-MO-DY.                              00065100
568040                 20  WS-CURR-YEAR        PIC X(04).               00065200
568041                 20  FILLER              PIC X(01).               00065300
568042                 20  WS-CURR-MONTH       PIC X(02).               00065400
568043                 20  FILLER              PIC X(01).               00065500
568044                 20  WS-CURR-DAY         PIC X(02).               00065600
568045             15  WS-CURR-YYYY-MM-DD REDEFINES                     00065700
568046                 WS-CURR-YEAR-MO-DY      PIC X(10).               00065800
568047                                                                  00065900
568048         10  WS-CURRENT-TIME             PIC X(08).               00066000
568049         10  WS-CURRENT-TIME-RDF    REDEFINES                     00066100
568050             WS-CURRENT-TIME.                                     00066200
568051             15  WS-CURR-HR-MIN-SEC.                              00066300
568052                 20  WS-CURR-HOUR        PIC X(02).               00066400
568053                 20  FILLER              PIC X(01).               00066500
568054                 20  WS-CURR-MINUTES     PIC X(02).               00066600
568055                 20  FILLER              PIC X(01).               00066700
568056                 20  WS-CURR-SECONDS     PIC X(02).               00066800
568057             15  WS-CURR-HH-MM-SS REDEFINES                       00066900
568058                 WS-CURR-HR-MIN-SEC      PIC X(08).               00067000
568059                                                                  00067100
568060***************************************************************** 00067200
568061** WORK AREA #2                                                ** 00067300
568062***************************************************************** 00067400
568063                                                                  00067500
568064 01  FILLER                              PIC  X(14) VALUE         00067600
568065     "WS-MISC-AREA--".                                            00067700
568066                                                                  00067800
568067 01  WS-MISC.                                                     00067900
568068     05  WS-PAGE-CTR             PIC S9(09) COMP-3 VALUE +0.      00068200
568069     05  WS-LINE-CTR             PIC S9(09) COMP-3 VALUE +0.      00068300
568070     05  WS-HNDLG-C                      PIC X(01).               00068303
568071     05  WS-REG-ID                       PIC X(07).               00068303
568072     05  WS-HOLD-SPART-OBS-EFF-Y         PIC X(10).               00068303
568073     05  WS-HOLD-SPART-OBS-NOTFY-Y       PIC X(10).               00068305
568074     05  WS-HOLD-SPART-PEND-OBS-Y        PIC X(10).               00068306
568075     05  WS-HOLD-SPART-SERV-DSPSN-C      PIC X(02).               00068308
568076     05  WS-HOLD-SPART-OBS-C             PIC X(01).
568077     05  WS-HOLD-SPART-OBS-OVRD-F        PIC X(01).
568078     05  WS-HOLD-SPART-OBS-Y             PIC X(10).
568079     05  WS-COUNT-REPLCNG-E11            PIC S9(4) COMP.          00068309
568080     05  WS-SPART-SERV-DSPSN-C           PIC X(2).                00068310
568081     05  WS-EPTDK-REAS-C                 PIC X(2).                00068311
568082     05  WS-SPART-RPL-BT-DTL-F           PIC X(1).                00068312
568083     05  WS-SAP-DATE.                                             00068313
568084         10  WS-SAP-DATE-YYYY            PIC X(04).               00068314
568085         10  WS-DASH1                    PIC X(01).               00068315
568086         10  WS-SAP-DATE-MM              PIC X(02).               00068316
568087         10  WS-DASH2                    PIC X(01).               00068317
568088         10  WS-SAP-DATE-DD              PIC X(02).               00068318
568089     05  WS-CAT-CNT                      PIC 9(04) COMP.          00068319
568090     05  WS-CAT-ENTERED-CNT              PIC 9(04) COMP.          00068320
568091     05  WS-CJ-ROW-KEY                   PIC X(150).              00068330
568092     05  WS-E14-CJ-ROW-KEY REDEFINES WS-CJ-ROW-KEY.               00068460
568093         10  WS-E14-BASE                 PIC X(08).               00068470
568094         10  WS-E14-PREFIX               PIC X(05).               00068480
568095         10  WS-E14-SUFFIX               PIC X(05).               00068490
568096         10  WS-FILLER                   PIC X(132).              00068491
568097                                                                  00068500
568098     05  WS-E54-CJ-ROW-KEY REDEFINES WS-CJ-ROW-KEY.
568099         10  WS-E54-BASE                 PIC X(08).
568100         10  WS-E54-PREFIX               PIC X(05).
568101         10  WS-E54-SUFFIX               PIC X(05).
568102         10  WS-E54-OBS-REG              PIC X(01).
568103         10  WS-FILLER                   PIC X(131).
568104
568105     05  WS-E57-CJ-ROW-KEY REDEFINES WS-CJ-ROW-KEY.               00068600
568106         10  WS-E57-BASE                 PIC X(08).               00068700
568107         10  WS-E57-PREFIX               PIC X(05).               00068800
568108         10  WS-E57-SUFFIX               PIC X(05).               00068900
568109         10  WS-E57-CATEGORY             PIC X(01).               00068910
568110         10  WS-FILLER                   PIC X(131).              00068920
568120     05  WS-E62-CJ-ROW-KEY REDEFINES WS-CJ-ROW-KEY.
568130          10  WS-E62-BASE                 PIC X(08).
568140          10  WS-E62-PREFIX               PIC X(05).
568150          10  WS-E62-SUFFIX               PIC X(05).
568160          10  WS-E62-PDC-GSDB             PIC X(05).
568170          10  WS-E62-OBS-REG              PIC X(01).
568180          10  WS-E62-COUNTRY-C            PIC X(02).
568181          10  WS-FILLER                   PIC X(124).
568182                                                                  00069000
568183***************************************************************** 00070400
568184** RECORD FORMAT FOR OUTPUTS                                   ** 00070500
568185***************************************************************** 00070600
568186                                                                  00070700
568187 01  FILLER                         PIC X(011) VALUE              00070800
568188     "& OUTPUTS &".                                               00070900
568189 01  WS-OUTPUT-REC.                                               00071000
568190     05  WS-OUTPUT-CC               PIC X(01).                    00071100
568191     05  WS-OUTPUT-RECORD           PIC X(80).                    00071200
568192                                                                  00071300
568193 01  HEADING-1.                                                   00071400
568194     05  FILLER                     PIC X(25) VALUE SPACES.       00071500
568195     05  FILLER                     PIC X(31) VALUE               00071600
568196         "SAP TO PCII OBSOLESENCE UPDATES".                       00071700
568197     05  FILLER                     PIC X(24) VALUE SPACES.       00071800
568198                                                                  00071900
568199 01  HEADING-2.                                                   00072000
568200     05  FILLER                     PIC X(38) VALUE               00072100
568201         "    SERVICE PART                ERROR ".                00072200
568202     05  FILLER                     PIC X(22) VALUE               00072300
568203         "MESSAGE               ".                                00072400
568204     05  FILLER                     PIC X(20) VALUE SPACES.       00072500
568205                                                                  00072600
568206 01  DETAIL-LINE.                                                 00072700
568207     05  FILLER                     PIC X(01) VALUE '|'.          00073400
568209     05  DET-LN-RECINFO             PIC X(15).                    00072900
568210     05  FILLER                     PIC X(01) VALUE '|'.          00073400
568213     05  DET-LN-ERROR-MSG           PIC X(50).                    00073500
568214     05  FILLER                     PIC X(01) VALUE '|'.          00073400
568215     05  DET-LN-INPROWKEY           PIC X(150).                   00073500
568216     05  FILLER                     PIC X(01) VALUE '|'.          00073400
568217                                                                  00073700
568218 01  BLANK-LINE                     PIC X(81) VALUE SPACES.       00073800
568219                                                                  00073900
568220 01  WS-PRINT.                                                    00074000
568221     05  WS-PRINT-CC                PIC X(1).                     00074100
568222     05  WS-PRINT-LINE              PIC X(80).                    00074200
568223                                                                  00074300
568224 01  WS-AUDIT.                                                    00074400
568225     05  WS-AUDIT-CC                PIC X(1).                     00074500
568226     05  WS-AUDIT-LINE              PIC X(80) VALUE SPACES.       00074600
568227                                                                  00074700
568228 01  WS-ERROR.                                                    00074710
568229     05  WS-ERROR-CC                PIC X(1).                     00074720
568230                                                                  00074740
568231***************************************************************** 00074800
568232** FIELDS FOR PROGRAM INCLUDE MEMBERS DEFINED HERE             ** 00074900
568233***************************************************************** 00075000
568234                                                                  00075100
568235                                                                  00075200
568236 01  FILLER                          PIC X(10) VALUE              00075300
568237     "*WS-ISO-DT".                                                00075400
568238***  DATETIMESTAMP IN ISO FORMAT  ==========================> *** 00075500
568239                                                                  00075600
568240                                                                  00075700
568241 COPY PACMMPFW.                                                   00075800
568242                                                                  00075900
568243                                                                  00076000
568244 01  FILLER                          PIC X(10) VALUE              00076100
568245     "*PACEDI43*".                                                00076200
568246***  CARRIAGE CONTROL FOR PRINT PROGRAMS  ==================> *** 00076300
568247                                                                  00076400
568248                                                                  00076500
568249 COPY PACEDI43.                                                   00076600
568250                                                                  00076700
568251                                                                  00076800
568252 01  FILLER                          PIC X(10) VALUE              00076900
568253     "*COMM ERR*".                                                00077000
568254***  COMMON ERROR MESSAGES LITERALS       ==================> *** 00077100
568255                                                                  00077200
568256***************************************************************** 00077300
568257*                                                               * 00077400
568258*    MOVE THIS MESSAGE LITERALS INTO THE HE-MSG1 FIELD BEFORE   * 00077500
568259*    CALLING THE ERROR ROUTINE.  USE THE SWITCHES TO SPECIFY    * 00077600
568260*    WHAT TYPE OF ERROR OCCURED.  THE TABLE WORK AREA IS USED   * 00077700
568261*    TO COMMUNICATE WITH IMS TABLES TO RETRIEVE FATAL ERROR     * 00077800
568262*    PRINTER INFORMATION.                                       * 00077900
568263*                                                               * 00078000
568264***************************************************************** 00078100
568265                                                                  00078200
568266 01  ERROR-RTN-MSG-LITERALS.                                      00078300
568267     05  LIT-BAD-GU-STATUS           PIC X(53)       VALUE        00078400
568268         "GET UNIQUE ON MESSAGE RETURNED AN INVALID STATUS CODE". 00078500
568269                                                                  00078600
568270     05  LIT-BAD-DB2-CALL            PIC X(38)       VALUE        00078700
568271         "A DB2 CALL RETURNED AN INVALID SQLCODE".                00078800
568272                                                                  00078900
568273     05  LIT-BAD-ISRT-STATUS         PIC X(55)       VALUE        00079000
568274        "INSERT ON MESSAGE QUEUE RETURNED AN INVALID STATUS CODE".00079100
568275                                                                  00079200
568276     05  LIT-BAD-DATERTN-CALL        PIC X(55)       VALUE        00079900
568277        "DATE ROUTINE CALL RETURNED AN INVALID DATE ROUTINE CODE".00080000
568278                                                                  00080100
568279     EJECT                                                        00082800
568280                                                                  00082900
568281                                                                  00083000
568282 01  FILLER                          PIC X(10) VALUE              00083100
568283     "*PACMMPBY*".                                                00083200
568284***  DEFAULT DATE/TIME VALUES  =============================> *** 00083300
568285                                                                  00083400
568286                                                                  00083500
568287 COPY PACMMPBY.                                                   00083600
568288                                                                  00083700
568289                                                                  00083800
568290 01  FILLER                          PIC X(10) VALUE              00083900
568291     "*PACMMPBZ*".                                                00084000
568292***  CALL CODE LITERALS FOR HS2PDATE SUBROUTINE  ===========> *** 00084100
568293                                                                  00084200
568294                                                                  00084300
568295 COPY PACMMPBZ.                                                   00084400
568296                                                                  00084500
568297                                                                  00084600
568298 01  FILLER                          PIC X(10) VALUE              00084700
568299     "*PACMMPFT*".                                                00084800
568300***  MMP TABLE NAMES  ======================================> *** 00084900
568301                                                                  00085000
568302                                                                  00085100
568303 COPY PACMMPFT.                                                   00085200
568304                                                                  00085300
568305                                                                  00085400
568306                                                                  00085500
568307***  WS-SQLCA PARAMETERS FOR CALLED SUBROUTINES  ===========> *** 00085600
568308                                                                  00085700
568309 01  FILLER                        PIC X(12) VALUE                00085800
568310     "--WS-SQLCA--".                                              00085900
568311                                                                  00086000
568312 COPY PACMMPFS.                                                   00086100
568313                                                                  00086200
568314                                                                  00086300
568315***  LINKAGE-PARAMETERS  FOR CALLED SUBROUTINES  ===========> *** 00086400
568316 01  FILLER                        PIC X(12) VALUE                00086500
568317     "LINKAGE-PARM".                                              00086600
568318                                                                  00086700
568319                                                                  00086800
568320 COPY PACMMPFR.                                                   00086900
568321                                                                  00087000
568322                                                                  00087100
568323***  CHG JOURNAL PARAMETERS                                => *** 00087200
568324 01  FILLER                        PIC X(12) VALUE                00087300
568325     "--PACMMPPX--".                                              00087400
568326                                                                  00087500
568327                                                                  00087600
568328 COPY PACMMPPX.                                                   00087700
568329                                                                  00087800
568330                                                                  00087900
568331***  MMP STANDARD REPORT HEADERS                           => *** 00088000
568332 01  FILLER                        PIC X(12) VALUE                00088100
568333     "--HEADERS --".                                              00088200
568334                                                                  00088300
568335                                                                  00088400
568336 COPY PACMMPKD.                                                   00088500
568337                                                                  00088600
568338                                                                  00088700
568339     EJECT                                                        00088800
568340*                                                                 00088900
568341                                                                  00089000
568342 COPY PACPC2WW.                                                   00089100
568343                                                                  00089200
568344     EJECT                                                        00089300
568345                                                                  00089400
568346*                                                                 00089500
568347***************************************************************** 00089600
568348*                                                               * 00089700
568349*  REQUEST RECORD TABLE                                         * 00089800
568350*                                                               * 00089900
568351* NOTE: PROGRAMMER IS RESPONSIBLE FOR ENSURING THAT THIS DATA   * 00090000
568352*       IS SAVED WITH A CHECKPOINT IF THE PROGRAM IS RESTART-   * 00090100
568353*       ABLE.                                                   * 00090200
568354*                                                               * 00090300
568355*       ADJUST THE NUMBER OF OCCURRENCES, AND THE ARRAY'S       * 00090400
568356*       LENGTH IN WS-RQST-RECORD-TABLE-LEN, ACCORDING TO        * 00090500
568357*       THE NUMBER OF REQUEST TYPES AND NUMBER OF REQUESTS      * 00090600
568358*       PER BATCH THAT YOUR PROGRAM WILL HANDLE.                * 00090700
568359*                                                               * 00090800
568360***************************************************************** 00090900
568361*                                                                 00091000
568362 01  WS-RQST-RECORD-TABLE-LENGTH          PIC S9(9) COMP          00091100
568363                                          VALUE +1000.            00091200
568364 01  WS-RQST-RECORD-TABLE.                                        00091300
568365     05  WS-RQST-RECORD-TYPES             OCCURS  1  TIMES.       00091400
568366         10  WS-RQST-RECORD-OCCURS        OCCURS  1  TIMES.       00091500
568367             15  WS-RQST-RECORD-AREA.                             00091600
568368                 20  WS-RQST-REC-KEY.                             00091700
568369                     25  WS-RQST-REC-ID    PIC X(08).             00091800
568370                     25  WS-RQST-REC-DATE  PIC 9(08).             00091900
568371                     25  WS-RQST-REC-TIME  PIC 9(08).             00092000
568372                 20  FILLER                PIC X(976).            00092100
568373                                                                  00092200
568374     COPY  BRTQSSA.                                               00092300
568375                                                                  00092400
568376***************************************************************** 00092500
568377*                                                               * 00092600
568378*  COMPLETED REQUEST TABLE                                      * 00092700
568379*  THIS ARRAY CONTAINS THE KEYS OF BRT REQUESTS WAITING TO      * 00092800
568380*  BE MARKED COMPLETE.  RESTARTABLE PROGRAMS MUST SAVE IT       * 00092900
568381*  WHEN A CHECKPOINT IS TAKEN.                                  * 00093000
568382*  YOU MAY CHANGE THE VALUES AND NUMBER OF OCCURRENCES HERE.    * 00093100
568383*                                                               * 00093200
568384***************************************************************** 00093300
568385*                                                                 00093400
568386 01  WS-COMPLETED-RQST-TABLE.                                     00093500
568387     05  WS-COMPLETED-RQST           OCCURS 250 TIMES             00093600
568388                                     INDEXED BY WS-CR-IDX.        00093700
568389         10  WS-COMPLETED-RQST-TYPE  PIC X(08).                   00093800
568390         10  WS-COMPLETED-RQST-DATE  PIC X(08).                   00093900
568391         10  WS-COMPLETED-RQST-TIME  PIC X(06).                   00094000
568392         10  WS-COMPLETED-RQST-SEQ   PIC X(02).                   00094100
568393     05  WS-COMPLETED-RQST-FLOOR     PIC X(08)                    00094200
568394                                     VALUE HIGH-VALUES.           00094300
568395                                                                  00094400
568396 01  WS-RQST-TABLE-CONTROLS.                                      00094500
568397     05  WS-COMPLETED-RQST-LIMIT     PIC S9(3) COMP-3             00094600
568398                                     VALUE +250.                  00094700
568399     05  WS-COMPLETED-RQST-LENGTH    PIC S9(5) COMP               00094800
568400                                     VALUE +6000.                 00094900
568401     EJECT                                                        00095000
568402***************************************************************** 00095100
568403*     THE FOLLOWING AREA IS PASSED TO SEVERAL SUBROUTINES       * 00095200
568404*     FOR ABEND PROCESSING.                                     * 00095300
568405***************************************************************** 00095400
568406*                                                                 00095500
568407     COPY  HARDCPY2.                                              00095600
568408     EJECT                                                        00095700
568409***************************************************************** 00095800
568410*     BRT INIT CALL AREA                                        * 00095900
568411*     THE FOLLOWING COPYBOOK CONTAINS THE CALL AREA PASSED TO   * 00096000
568412*     THE BATCH REQUEST INITIATION SUBROUTINE.                  * 00096100
568413***************************************************************** 00096200
568414*                                                                 00096300
568415     COPY  BRTINPRM.                                              00096400
568416     EJECT                                                        00096500
568417***************************************************************** 00096600
568418*     SEC PARM CALL AREA                                        * 00096700
568419*     THE FOLLOWING COPYBOOK CONTAINS THE CALL AREA PASSED TO   * 00096800
568420*     THE SECURITY PARM SUBROUTINE.                             * 00096900
568421***************************************************************** 00097000
568422*                                                                 00097100
568423     COPY  HWSECPRM.                                              00097200
568424     EJECT                                                        00097300
568425***************************************************************** 00097400
568426*     AAAL TABL ID AREA                                         * 00097500
568427*     THE FOLLOWING COPYBOOK CONTAINS THE CALL AREA PASSED FROM * 00097600
568428*     THE TABE IO SUBROUTINE FOR GLOBAL PARMS TABLE             * 00097700
568429***************************************************************** 00097800
568430*                                                                 00097900
568431     COPY  WSAAAL.                                                00098000
568432     EJECT                                                        00098100
568433***************************************************************** 00098200
568434*                                                               * 00098300
568435*     MAILISRT AREA                                             * 00098400
568436*                                                               * 00098500
568437***************************************************************** 00098600
568438*     THE FOLLOWING FIELD SHOULD BE MOVED TO WS-MB-MESSAGE-TYPE   00098700
568439*     WHEN SENDING A MAILBOX ABEND MESSAGE.  YOU MAY DELETE IT    00098800
568440*     IF NOT USING MAILISRT.                                      00098900
568441*                                                                 00099000
568442 01  WS-ABEND-MSG-TYPE              PIC X(04)  VALUE "    ".      00099100
568443*                                                                 00099200
568444*     THE FOLLOWING COPYBOOK CONTAINS THE CALL AREA PASSED TO     00099300
568445*     THE MAILISRT SUBROUTINE IN ORDER TO WRITE A MESSAGE TO      00099400
568446*     MAILBOX DATABASE.  YOU MAY DELETE IT IF YOU DO NOT          00099500
568447*     USE MAILISRT.                                               00099600
568448*                                                                 00099700
568449     COPY  MAILISRT.                                              00099800
568450     EJECT                                                        00099900
568451***************************************************************** 00100000
568452* AREA FOR HCHKDATA ROUTINE.  MAY BE DELETED IF CHKDATA IS      * 00100100
568453* NOT USED.                                                     * 00100200
568454***************************************************************** 00100300
568455*                                                                 00100400
568456     COPY  CHKDATA.                                               00100500
568457     EJECT                                                        00100600
568458***************************************************************** 00100700
568459* AREA FOR HDATERTN ROUTINE.  MAY BE DELETED IF HDATERTN IS     * 00100800
568460* NOT USED.                                                     * 00100900
568461***************************************************************** 00101000
568462*                                                                 00101100
568463     COPY  DATEPARM.                                              00101200
568464     EJECT                                                        00101300
568465***************************************************************** 00101400
568466*              COMMON IMS REFERENCES                            * 00101500
568467***************************************************************** 00101600
568468*                                                                 00101700
568469     COPY  COMMIMS.                                               00101800
568470                                                                  00101900
568471***************************************************************** 00102000
568472*              COMMON GSAM FUNCTION CALLS                       * 00102100
568473***************************************************************** 00102200
568474*                                                                 00102300
568475     COPY  HWS0080I.                                              00102400
568476     EJECT                                                        00102500
568477***************************************************************** 00102600
568478*              COMMON DB2 REFERENCES                            * 00102700
568479***************************************************************** 00102800
568480*                                                                 00102900
568481     COPY  COMMDB2.                                               00103000
568482     EJECT                                                        00103100
568483***************************************************************** 00103200
568484* COPYBOOKS FOR HTBLIO                                          * 00103300
568485*     USED IN DETERMINING:  LANGUAGE CODE, TIME ZONE AND DATE   * 00103400
568486*                   FORMAT; LTERMS TO RECEIVE ABORT MESSAGES;   * 00103500
568487***************************************************************** 00103600
568488*                                                                 00103700
568489     COPY   TBLIOWS.                                              00103800
568490     EJECT                                                        00103900
568491***************************************************************** 00104000
568492*    COPYBOOKS HWS0070 AND HWS0050 CONTAIN LITERALS  REFERENCED * 00104100
568493*    BY HTBLIO CALLS IN THE PROCEDURE DIVISION.                 * 00104200
568494***************************************************************** 00104300
568495*                                                                 00104400
568496     COPY   HWS0070I.                                             00104500
568497     COPY   HWS0050I.                                             00104600
568498     EJECT                                                        00104700
570502                                                                  00112860
570503*NUAD BEGIN
570504 01  FI-INFILE-RECORD.
570505     05  FI-SMMPE29.
570506         10 FI-PCER-PGM-ID-R        PIC X(8)   VALUE SPACES.
570507         10 FI-PCER-TBL-N           PIC X(18)  VALUE SPACES.
570508         10 FI-PCER-ATTR-N          PIC X(18)  VALUE SPACES.
570509         10 FI-PCCJ-ROW-KEY-N       PIC X(150) VALUE SPACES.
570510         10 FI-PCER-ACTN-C          PIC X(1)   VALUE SPACES.
570511         10 FI-PCCJ-OLD-ATTR-D      PIC X(60)  VALUE SPACES.
570512         10 FI-PCCJ-NEW-ATTR-D      PIC X(60)  VALUE SPACES.
570513         10 FI-PCCJ-UPDT-S          PIC X(26)  VALUE SPACES.
570514         10 FI-PCCJ-UPDT-PGM-ID-R   PIC X(8)   VALUE SPACES.
570515         10 FI-P-LAST-UPDATE-S      PIC X(26)  VALUE SPACES.
570516         10 FI-P-LAST-UPDATE-C      PIC X(8)   VALUE SPACES.
570517
570518 01 WS-CURRENT-TIMESTAMP             PIC X(26) VALUE SPACES.
570519 01 WS-CURRENT-TIMESTAMP2            PIC X(26) VALUE SPACES.
570520 01 WS-DUMMY                         PIC X(01) VALUE SPACES.
570521 01 WS-ROW-COUNT-OLD-PART            PIC S9(09) COMP VALUE +0.
570522 01 WS-ROW-COUNT-NEW-PART            PIC S9(09) COMP VALUE +0.
570523 01 WS-REPLACEMENT-TYPE              PIC X(30) VALUE SPACES.
570524 01 WS-SUPERSESSION-PRESENT          PIC X(01) VALUE SPACES.
570525 01 WS-LINKED-EPNS-COUNT             PIC S9(02) COMP VALUE +0.
570526 01 WS-MAX-USAGES                    PIC S9(09) COMP VALUE +0.
570527 01 WS-SUB-COUNT                     PIC S9(09) COMP VALUE +0.
570528 01 WS-SUB2-COUNT                    PIC S9(09) COMP VALUE +0.
570529 01 WS-AR1-SUB-COUNT                 PIC S9(09) COMP VALUE +0.
570530 01 WS-AR2-SUB-COUNT                 PIC S9(09) COMP VALUE +0.
570531 01 WS-PREV-AR1-SUB-COUNT            PIC S9(09) COMP VALUE +0.
570532 01 WS-PREV-AR2-SUB-COUNT            PIC S9(09) COMP VALUE +0.
570533 01 WS-I                             PIC S9(09) COMP VALUE +0.
570534 01 WS-P-I                           PIC S9(09) COMP VALUE +0.
570535 01 WS-INP-FILE-REC-COUNT            PIC S9(09) COMP VALUE +0.
570536 01 WS-FIRST-COUNT                   PIC S9(09) COMP VALUE +0.
570537
570538*FOR FIRST&MID IN REPLACEMENT CHAIN PROCESSING
570539*AR1 & AR2 - FOR NEXT LEVEL TREE TRAVERSALS IN REPLACEMENT CHAIN
570540*AR1 STORES OLD/REPLACED PARTS LIST (HANDLES TREE STRUCTURE TOO)
570541 01 WS-AR1-TABLE.
570542    05 WS-AR1         OCCURS 1000 TIMES
570543*AS OF 2024-MAY,MAX REPLACEMENTS FOR PART FOR 1 REGION IS 22
570544*THERE CAN BE > 1 PART IN A LEVEL OF TREE
570545*DEFINING ARRAY MAX CAP 1000 SINCE AR2 DATA WILL BE INTERCHANGED
570546                      ASCENDING KEY IS WS-AR1-PREFIX
570547                                       WS-AR1-BASE
570548                                       WS-AR1-SUFFIX
570549                      INDEXED BY WS-AR1-SUB.
570550       10 WS-AR1-PREFIX                  PIC X(05) VALUE SPACES.
570551       10 WS-AR1-BASE                    PIC X(08) VALUE SPACES.
570552       10 WS-AR1-SUFFIX                  PIC X(05) VALUE SPACES.
570553*
570554 01 WS-AR2-TABLE.
570555*AR2 STORES NEW/REPLACING PARTS LIST (HANDLES TREE STRUCTURE TOO)
570556    05 WS-AR2         OCCURS 1000  TIMES
570557                      ASCENDING KEY IS WS-AR2-PREFIX
570558                                       WS-AR2-BASE
570559                                       WS-AR2-SUFFIX
570560                      INDEXED BY WS-AR2-SUB.
570561       10 WS-AR2-PREFIX                  PIC X(05) VALUE SPACES.
570562       10 WS-AR2-BASE                    PIC X(08) VALUE SPACES.
570563       10 WS-AR2-SUFFIX                  PIC X(05) VALUE SPACES.
570564*
570565 01 WS-TABLE.
570566*MAX EPNS FOR 1 GSPN (PROD E12) = 7 (AS OF MAY-2024)
570567*MAX USAGES FOR 1 EPN (PROD D22) = 18110 (AS OF MAY-2024)
570568*MAX USAGES POSSIBLE FOR A GSPN= 7 * 19000 = 133000
570569*ROUNDING OFF TO 150000.
570570*ASSUMING 5 FINAL ASSEMBLIES=5*150000=750000
570571    05 WS-USAGE-ARRAY OCCURS 1 TO 750000 TIMES
570572                      DEPENDING ON WS-MAX-USAGES
570573*E03 TABLE UNIQUE FIELDS ARE THE ASCENDING KEY(BELOW)
570574                      ASCENDING KEY IS WS-ENGP-ENGNRG-PART-R
570575                                       WS-EIO-ORIGIN-C
570576                                       WS-ENGP-SEQ-R
570577                      INDEXED BY WS-SUB.
570578*D22 TABLE UNIQUE FIELDS ARE THE FIELDS NEEDED(BELOW)
570579       10 WS-ENGP-ENGNRG-PART-R   PIC X(30) VALUE SPACES.
570580       10 WS-EIO-ORIGIN-C         PIC X(4)  VALUE SPACES.
570581       10 WS-ENGP-SEQ-R           PIC S9(4) USAGE COMP
570582                                            VALUE ZEROES.
570583       10 WS-FUNC-KEY             PIC X(13) VALUE SPACES.
570584       10 WS-VEHTYPE-CODE         PIC X(1)  VALUE SPACES.
570585       10 WS-PTEIO-ORIGIN-C       PIC X(4)  VALUE SPACES.
570586       10 WS-EVL-VEHICLE-LINE-C   PIC X(2)  VALUE SPACES.
570587       10 WS-PFTRC-COMBINATN-C    PIC S9(9) USAGE COMP
570588                                            VALUE ZEROES.
570589       10 WS-MFTRC-COMBINATN-C    PIC S9(9) USAGE COMP
570590                                            VALUE ZEROES.
570591       10 WS-REGINT-C             PIC X(1)  VALUE SPACES.
570592       10 WS-EVA-PER-USAGE-Q      PIC S9(5)V9(2) USAGE COMP-3
570593                                            VALUE ZEROES.
570594       10 WS-EFFIOP-EFF-IN-C      PIC X(16) VALUE SPACES.
570595       10 WS-EVA-USG-ACTV-STS-F   PIC X(1)  VALUE SPACES.
570596*
570597 01 WS-TABLE2.
570598    05 WS-USAGE-ARRAY2 OCCURS 400000 TIMES
570599                      ASCENDING KEY IS WS-ENGP-ENGNRG-PART-R2
570600                                       WS-EIO-ORIGIN-C2
570601                                       WS-ENGP-SEQ-R2
570602                      INDEXED BY WS-SUB22.
570603       10 WS-ENGP-ENGNRG-PART-R2  PIC X(30) VALUE SPACES.
570604       10 WS-EIO-ORIGIN-C2        PIC X(4)  VALUE SPACES.
570605       10 WS-ENGP-SEQ-R2          PIC S9(4) USAGE COMP
570606                                            VALUE ZEROES.
570607       10 WS-FUNC-KEY2            PIC X(13) VALUE SPACES.
570608       10 WS-VEHTYPE-CODE2        PIC X(1)  VALUE SPACES.
570609       10 WS-PTEIO-ORIGIN-C2      PIC X(4)  VALUE SPACES.
570610       10 WS-EVL-VEHICLE-LINE-C2  PIC X(2)  VALUE SPACES.
570611       10 WS-PFTRC-COMBINATN-C2   PIC S9(9) USAGE COMP
570612                                            VALUE ZEROES.
570613       10 WS-MFTRC-COMBINATN-C2   PIC S9(9) USAGE COMP
570614                                            VALUE ZEROES.
570615       10 WS-REGINT-C2            PIC X(1)  VALUE SPACES.
570616       10 WS-EVA-PER-USAGE-Q2     PIC S9(5)V9(2) USAGE COMP-3
570617                                            VALUE ZEROES.
570618       10 WS-EFFIOP-EFF-IN-C2     PIC X(16) VALUE SPACES.
570619       10 WS-EVA-USG-ACTV-STS-F2  PIC X(1)  VALUE SPACES.
570620*
570621 01 WS-INP-FILE-DATA-TABLE.
570622    05 WS-INP-FILE-ARRAY OCCURS 1 TO 200000 TIMES
570623                      DEPENDING ON WS-INP-FILE-REC-COUNT
570624* PA0067JD INPUT FILE VOLUME=22000 OF MAY ,2024
570625                      INDEXED BY WS-IN.
570626       10 IN-PCER-PGM-ID-R        PIC X(8).
570627       10 IN-PCER-TBL-N           PIC X(18).
570628       10 IN-PCER-ATTR-N          PIC X(18).
570629       10 IN-PCCJ-ROW-KEY-N        PIC X(150).
570630       10 IN-ROW-KEY-EXPANDED REDEFINES IN-PCCJ-ROW-KEY-N.
570631          15  IN-CHG23-BASE                 PIC X(08).
570632          15  IN-CHG23-PREFIX               PIC X(05).
570633          15  IN-CHG23-SUFFIX               PIC X(05).
570634          15  IN-CHG23-REPL-BASE            PIC X(08).
570635          15  IN-CHG23-REPL-PREFIX          PIC X(05).
570636          15  IN-CHG23-REPL-SUFFIX          PIC X(05).
570637          15  IN-CHG23-REPL-REGION          PIC X(07).
570638          15  FILLER                        PIC X(107).
570639       10 IN-PCER-ACTN-C          PIC X(1).
570640       10 IN-PCCJ-OLD-ATTR-D      PIC X(60).
570641       10 IN-PCCJ-NEW-ATTR-D      PIC X(60).
570642       10 IN-PCCJ-UPDT-S          PIC X(26).
570643       10 IN-PCCJ-UPDT-PGM-ID-R   PIC X(8).
570644       10 IN-P-LAST-UPDATE-S      PIC X(26).
570645       10 IN-P-LAST-UPDATE-C      PIC X(8).
570646 01 WS-INFILE-RECORDS             PIC 9(9) VALUE ZEROES.
570647 01 ERR-PARA                    PIC X(70) VALUE SPACES.
570648 01 ERR-MSG-LINE1               PIC X(70) VALUE SPACES.
570649 01 ERR-MSG-LINE2               PIC X(70) VALUE SPACES.
570650*PGM-MSG-LENGTH = (DISPLAY DESC) + 150(INPUT KEY)~222
570651 01 WS-PGM-MSG                  PIC X(110) VALUE SPACES.
570652 01  WS-ERROR-FLAG              PIC X(1)  VALUE SPACES.
570653     88  ERROR-FOUND            VALUE 'Y'.
570654     88  NO-ERROR               VALUE 'N'.
570655 01  WS-USAGE-ARRAY-FLAG        PIC X(1)  VALUE SPACES.
570656     88  WS-USAGE-ARRAY-OVERFLOW VALUE 'Y'.
570657 01  WS-AR1-DATA-FLAG           PIC X(1)  VALUE SPACES.
570658     88  NO-DATA-IN-AR1         VALUE 'Y'.
570659 01  WS-AR2-DATA-FLAG           PIC X(1)  VALUE SPACES.
570660     88  NO-DATA-IN-AR2         VALUE 'Y'.
570661 01  WS-AR1-LOAD-FLAG           PIC X(1)  VALUE SPACES.
570662     88  END-OF-AR1-LOAD        VALUE 'Y'.
570663 01  WS-PREV-AR1-DATA-FLAG           PIC X(1)  VALUE SPACES.
570664     88  NO-DATA-IN-PREV-AR1         VALUE 'Y'.
570665 01  WS-PREV-AR2-DATA-FLAG           PIC X(1)  VALUE SPACES.
570666     88  NO-DATA-IN-PREV-AR2         VALUE 'Y'.
570667 01  WS-PREV-AR1-LOAD-FLAG           PIC X(1)  VALUE SPACES.
570668     88  END-OF-PREV-AR1-LOAD        VALUE 'Y'.
570669 01  WS-REP-CHAIN-FLAG          PIC X(1)  VALUE SPACES.
570670     88  NOT-IN-REP-CHAIN       VALUE 'N'.
570671     88  FIRST-IN-REP-CHAIN     VALUE 'F'.
570672     88  MID-IN-REP-CHAIN       VALUE 'M'.
570673     88  LAST-IN-REP-CHAIN      VALUE 'L'.
570674 01  WS-LEVEL-SWITCH            PIC X(1)  VALUE SPACES.
570675     88  LEVEL-1-ON             VALUE '1'.
570676     88  LEVEL-2-ON             VALUE '2'.
570677     88  LEVEL-X-ON             VALUE 'X'.
570678     88  LEVEL-OFF              VALUE ' '.
570679 01  WS-REP-CHAIN-PREV-LVL      PIC X(1)  VALUE SPACES.
570680     88  PREV-LVL-EXIST         VALUE 'Y'.
570681     88  NO-PREV-LVL            VALUE 'N'.
570682 01  WS-REP-CHAIN-NEXT-LVL      PIC X(1)  VALUE SPACES.
570683     88  NEXT-LVL-EXIST         VALUE 'Y'.
570684     88  NO-NEXT-LVL            VALUE 'N'.
570685 01  WS-REP-CHAIN-FLAG-F        PIC X(1)  VALUE SPACES.
570686     88  NOT-IN-REP-CHAIN-F     VALUE 'N'.
570687     88  FIRST-IN-REP-CHAIN-F   VALUE 'F'.
570688     88  MID-IN-REP-CHAIN-F     VALUE 'M'.
570689     88  LAST-IN-REP-CHAIN-F    VALUE 'L'.
570690 01  WS-REP-CHAIN-PREV-LVL-F    PIC X(1)  VALUE SPACES.
570691     88  PREV-LVL-EXIST-F       VALUE 'Y'.
570692     88  NO-PREV-LVL-F          VALUE 'N'.
570693 01  WS-REP-CHAIN-NEXT-LVL-F    PIC X(1)  VALUE SPACES.
570694     88  NEXT-LVL-EXIST-F       VALUE 'Y'.
570695     88  NO-NEXT-LVL-F          VALUE 'N'.
570696 01  WS-RECORD-VALID-FLAG       PIC X(1)  VALUE SPACES.
570697     88  GOOD-RECORD            VALUE 'G'.
570698     88  BAD-RECORD             VALUE 'B'.
570699 01  WS-RECORD-VALID-FLAG2      PIC X(1)  VALUE SPACES.
570700     88  GOOD-RECORD2           VALUE 'G'.
570701     88  BAD-RECORD2            VALUE 'B'.
570702 01  WS-E0F-STATUS              PIC X(1)  VALUE SPACES.
570703     88  WS-NOT-EOF             VALUE 'N'.
570704     88  WS-EOF                 VALUE 'Y'.
570705 01  WS-E0F-AR-LOAD-STATUS      PIC X(1)  VALUE SPACES.
570706     88  WS-NOT-EOF-END-AR-LOAD VALUE 'N'.
570707     88  WS-EOF-END-AR-LOAD     VALUE 'Y'.
570708 01  WS-INPUT-RECORD-TYPE       PIC X(1)  VALUE SPACES.
570709     88  DELETE-CJ-INPUT        VALUE 'D'.
570710     88  CHANGE-CJ-INPUT        VALUE 'C'.
570711 01  WS-INFILE-STATUS           PIC X(2)  VALUE SPACES.
570712     88  WS-INFILE-SUCCESS      VALUE '00'.
570713 01  WS-OTFILE-STATUS           PIC X(2)  VALUE SPACES.
570714     88  WS-OTFILE-SUCCESS      VALUE '00'.
570715 01  WS-SMMPE29.
570716     10 WS-PCER-PGM-ID-R        PIC X(8)   VALUE SPACES.
570717     10 WS-PCER-TBL-N           PIC X(18)  VALUE SPACES.
570718     10 WS-PCER-ATTR-N          PIC X(18)  VALUE SPACES.
570719     10 WS-PCCJ-ROW-KEY-N       PIC X(150) VALUE SPACES.
570720     10 WS-PCER-ACTN-C          PIC X(1)   VALUE SPACES.
570721     10 WS-PCCJ-OLD-ATTR-D      PIC X(60)  VALUE SPACES.
570722     10 WS-PCCJ-NEW-ATTR-D      PIC X(60)  VALUE SPACES.
570723     10 WS-PCCJ-UPDT-S          PIC X(26)  VALUE SPACES.
570724     10 WS-PCCJ-UPDT-PGM-ID-R   PIC X(8)   VALUE SPACES.
570725     10 WS-P-LAST-UPDATE-S      PIC X(26)  VALUE SPACES.
570726     10 WS-P-LAST-UPDATE-C      PIC X(8)   VALUE SPACES.
570727 01  WS-CHG-E52E53-INDEX.
570728     05  WS-CHG23-BASE                 PIC X(08) VALUE SPACES.
570729     05  WS-CHG23-PREFIX               PIC X(05) VALUE SPACES.
570730     05  WS-CHG23-SUFFIX               PIC X(05) VALUE SPACES.
570731     05  WS-CHG23-REPL-BASE            PIC X(08) VALUE SPACES.
570732     05  WS-CHG23-REPL-PREFIX          PIC X(05) VALUE SPACES.
570733     05  WS-CHG23-REPL-SUFFIX          PIC X(05) VALUE SPACES.
570734     05  WS-CHG23-REPL-REGION          PIC X(07) VALUE SPACES.
570735
570736 01  WS-REGION                         PIC X(01) VALUE SPACES.
570737 01  WS-REGION-EXT                     PIC X(05) VALUE SPACES.
570738
570739 01  WS-OLDP-KEY.
570740     05  WS-OLDP-BASE                 PIC X(08) VALUE SPACES.
570741     05  WS-OLDP-PREFIX               PIC X(05) VALUE SPACES.
570742     05  WS-OLDP-SUFFIX               PIC X(05) VALUE SPACES.
570743
570744 01  WS-NEWP-KEY.
570745     05  WS-NEWP-BASE                 PIC X(08) VALUE SPACES.
570746     05  WS-NEWP-PREFIX               PIC X(05) VALUE SPACES.
570747     05  WS-NEWP-SUFFIX               PIC X(05) VALUE SPACES.
570748
570749 01  WS-PART-KEY.
570750     05  WS-KEY-BASE                  PIC X(08) VALUE SPACES.
570751     05  WS-KEY-PREFIX                PIC X(05) VALUE SPACES.
570752     05  WS-KEY-SUFFIX                PIC X(05) VALUE SPACES.
570753
570754 01  WS-PREV-PART-KEY.
570755     05  WS-PREV-KEY-BASE                  PIC X(08) VALUE SPACES.
570756     05  WS-PREV-KEY-PREFIX                PIC X(05) VALUE SPACES.
570757     05  WS-PREV-KEY-SUFFIX                PIC X(05) VALUE SPACES.
570758
570759 01  CSR-OLD-EPN                      PIC X(30) VALUE SPACES.
570760 01  CSR-OLD-ENGP-EIO-C               PIC X(04) VALUE SPACES.
570761 01  CSR-OLD-ENGP-SEQ-R               PIC S9(4) USAGE COMP
570762                                                VALUE ZEROES.
570763
570764 01  CSR-NEW-EPN                      PIC X(30) VALUE SPACES.
570765 01  CSR-NEW-ENGP-EIO-C               PIC X(04) VALUE SPACES.
570766 01  CSR-NEW-ENGP-SEQ-R               PIC S9(4) USAGE COMP
570767                                                VALUE ZEROES.
570768
570769 01 DEL-NUAD-VARS.
570770    05 DL-ENGP-ENGNRG-PART-R   PIC X(30) VALUE SPACES.
570771    05 DL-EIO-ORIGIN-C         PIC X(4)  VALUE SPACES.
570772    05 DL-ENGP-SEQ-R           PIC S9(4) USAGE COMP
570773                                         VALUE ZEROES.
570774    05 DL-FUNC-KEY             PIC X(13) VALUE SPACES.
570775    05 DL-VEHTYPE-CODE         PIC X(1)  VALUE SPACES.
570776    05 DL-PTEIO-ORIGIN-C       PIC X(4)  VALUE SPACES.
570777    05 DL-EVL-VEHICLE-LINE-C   PIC X(2)  VALUE SPACES.
570778    05 DL-PFTRC-COMBINATN-C    PIC S9(9) USAGE COMP
570779                                         VALUE ZEROES.
570780    05 DL-MFTRC-COMBINATN-C    PIC S9(9) USAGE COMP
570781                                         VALUE ZEROES.
570782    05 DL-REGINT-C             PIC X(1)  VALUE SPACES.
570783    05 DL-EVA-PER-USAGE-Q      PIC S9(5)V9(2) USAGE COMP-3
570784                                         VALUE ZEROES.
570785    05 DL-EFFIOP-EFF-IN-C      PIC X(16) VALUE SPACES.
570786    05 DL-EVA-USG-ACTV-STS-F   PIC X(1)  VALUE SPACES.
570787
570790 01 MSG-AR1-OVERFLOW             PIC X(50) VALUE
570800         "WS-AR1 ARRAY OVERFLOW                         ".              35
570810 01 MSG-AR2-OVERFLOW             PIC X(50) VALUE
570811         "WS-AR2 ARRAY OVERFLOW                         ".              35
570812 01 MSG-USAGE-OVERFLOW           PIC X(50) VALUE
570813         "WS-USAGE-ARRAY OVERFLOW                       ".              35
570814 01 MSG-USAGE2-OVERFLOW          PIC X(50) VALUE
570815         "WS-USAGE-ARRAY2  OVERFLOW                     ".              35
570816 01 MSG-FILE-ARRAY-OVERFLOW      PIC X(50) VALUE
570817         "WS-INP-FILE-ARRAY OVERFLOW                    ".              35
570818
570819     EXEC SQL
570820         INCLUDE SQLCA
570821     END-EXEC.
570822
570823     EXEC SQL
570824         INCLUDE SIBM
570825     END-EXEC.
570826
570827     EXEC SQL
570828         INCLUDE SMMPD22
570829     END-EXEC.
570830
570831     EXEC SQL
570832         INCLUDE SMMPE12
570833     END-EXEC.
570834
570835     EXEC SQL
570836         INCLUDE SMMPE13
570837     END-EXEC.
570838
570839     EXEC SQL
570840         INCLUDE SMMPE14
570841     END-EXEC.
570842
570843     EXEC SQL
570844         INCLUDE SMMPD26
570845     END-EXEC.
570846
570847     EXEC SQL
570848         INCLUDE SMMPE53
570849     END-EXEC.
570850
570851*CURSOR-1: FOR GETTING LINKED EPNS FOR OLD GSPN/REPLACED PART
570852     EXEC SQL
570853       DECLARE LINKED-EPN-CSR1 CURSOR FOR
570864       SELECT     E12.SBASEPRT_NBR
570865                 ,E12.SPRFXPRT_PREFIX_R
570866                 ,E12.SUFXPRT_SUFFIX_NBR
570867                 ,E12.ENGP_ENGNRG_PART_R
570868                 ,E12.ENGP_EIO_C
570869                 ,E12.ENGP_SEQ_R
570870                 ,E12.SEEQ_EFFECT_IN_Y
570872       FROM       SMMPE12_SENG_EQL   E12
570873       WHERE      E12.SBASEPRT_NBR       = :WS-OLDP-BASE
570874       AND        E12.SPRFXPRT_PREFIX_R  = :WS-OLDP-PREFIX
570875       AND        E12.SUFXPRT_SUFFIX_NBR = :WS-OLDP-SUFFIX
570876
570893       ORDER BY   E12.SPRFXPRT_PREFIX_R
570894                 ,E12.SBASEPRT_NBR
570895                 ,E12.SUFXPRT_SUFFIX_NBR
570896       FOR READ ONLY
570897      END-EXEC.
570898
570899*CURSOR-2: FOR GETTING ALL USAGES FOR A EPN TO LOAD TO ARRAY
570900     EXEC SQL
570901       DECLARE GET-USAGES-CSR CURSOR FOR
570902       SELECT     D22.ENGP_ENGNRG_PART_R
570903                 ,D22.EIO_ORIGIN_C
570904                 ,D22.ENGP_SEQ_R
570905                 ,D22.FUNC_KEY
570906                 ,D22.VEHTYPE_CODE
570907                 ,D22.PTEIO_ORIGIN_C
570908                 ,D22.EVL_VEHICLE_LINE_C
570909                 ,D22.PFTRC_COMBINATN_C
570910                 ,D22.MFTRC_COMBINATN_C
570911                 ,D22.REGINT_C
570912                 ,D22.EVA_PER_USAGE_Q
570913                 ,D22.EFFIOP_EFF_IN_C
570914                 ,D22.EVA_USG_ACTV_STS_F
570915       FROM       SMMPD22_ENG_VL_APP D22
570916       WHERE      D22.ENGP_ENGNRG_PART_R = :CSR-OLD-EPN
570917       AND        D22.EIO_ORIGIN_C       = :CSR-OLD-ENGP-EIO-C
570918       AND        D22.ENGP_SEQ_R         = :CSR-OLD-ENGP-SEQ-R
570919       AND        D22.REGINT_C           = :WS-REGION
570920       AND        D22.EVA_USG_ACTV_STS_F = :LIT-Y
570921       ORDER BY   D22.FUNC_KEY
570922                 ,D22.VEHTYPE_CODE
570923                 ,D22.EVL_VEHICLE_LINE_C
570924                 ,D22.REGINT_C
570925       FOR READ ONLY
570926      END-EXEC.
570927
570928*CURSOR-3: FOR GETTING LINKED EPNS FOR NEW GSPN/REPLACING PART
570929     EXEC SQL
570930       DECLARE LINKED-EPN-CSR2 CURSOR FOR
570941       SELECT     E12.SBASEPRT_NBR
570942                 ,E12.SPRFXPRT_PREFIX_R
570943                 ,E12.SUFXPRT_SUFFIX_NBR
570944                 ,E12.ENGP_ENGNRG_PART_R
570945                 ,E12.ENGP_EIO_C
570946                 ,E12.ENGP_SEQ_R
570947                 ,E12.SEEQ_EFFECT_IN_Y
570949       FROM       SMMPE12_SENG_EQL   E12
570950       WHERE      E12.SBASEPRT_NBR       = :WS-NEWP-BASE
570951       AND        E12.SPRFXPRT_PREFIX_R  = :WS-NEWP-PREFIX
570952       AND        E12.SUFXPRT_SUFFIX_NBR = :WS-NEWP-SUFFIX
570970       ORDER BY   E12.SPRFXPRT_PREFIX_R
570971                 ,E12.SBASEPRT_NBR
570972                 ,E12.SUFXPRT_SUFFIX_NBR
570973       FOR READ ONLY
570974      END-EXEC.
570975
570976*CURSOR-4: FIRST-IN-REPLACEMENT-CHAIN PROCESSING CURSOR
570977* (ALSO USING THIS CURSOR FOR MID - FORWARD TREE TRAVERSAL)
570978     EXEC SQL
570979       DECLARE REP-FIRST CURSOR FOR
570980       SELECT     SBASEPRT_REPLCNG_R
570981                 ,SPRFXPRT_REPLCNG_R
570982                 ,SUFXPRT_REPLCNG_R
570983       FROM       SMMPE53_REP_SVPT_G E53
570984       WHERE      E53.SBASEPRT_NBR       = :WS-KEY-BASE
570985       AND        E53.SPRFXPRT_PREFIX_R  = :WS-KEY-PREFIX
570986       AND        E53.SUFXPRT_SUFFIX_NBR = :WS-KEY-SUFFIX
570987       AND        E53.SPRP_REPL_PRT_REG  LIKE :WS-REGION-EXT
570988       ORDER BY   SPRFXPRT_REPLCNG_R
570989                 ,SBASEPRT_REPLCNG_R
570990                 ,SUFXPRT_REPLCNG_R
570991       FOR READ ONLY
570992      END-EXEC
570993
570994* CURSOR-5: FINAL ASSEMBLY TO COMPONENT USAGES FETCH
570995     EXEC SQL
570996          DECLARE CSR_FINAL_ASSEMBLY  CURSOR FOR
570997          SELECT FINASC_ENG_PART_R,
570998                 FINASC_ORIGIN_C,
570999                 FINASC_SEQ_R,
571000                 EPNTSR_EFF_IN_Y_CMPNT,
571001                 EPNTSR_EFF_OUT_Y_CMPNT
571002          FROM   SMMPD26_FINASC
571003         WHERE   ENGP_ENGNRG_PART_R = :CSR-OLD-EPN
571004           AND   EIO_ORIGIN_C       = :CSR-OLD-ENGP-EIO-C
571005           AND   ENGP_SEQ_R         = :CSR-OLD-ENGP-SEQ-R
571006       ORDER BY  FINASC_ENG_PART_R
571007                ,FINASC_ORIGIN_C
571008                ,FINASC_SEQ_R
571009       FOR READ ONLY
571010     END-EXEC.
571011*NUAD END
571012 LINKAGE SECTION.                                                 00112900
571013***************************************************************** 00113000
571014*                   LINKAGE SECTION                             * 00113100
571015***************************************************************** 00113200
571016*                                                                 00113300
571017     COPY  STMPPPCB.                                              00113400
571018                                                                  00113500
571019 01  PCB-BATCH-RQST.                                              00113600
571020     05  PCB-BRT-DBDNAME            PIC X(8).                     00113700
571021     05  PCB-BRT-SEG-LEVEL          PIC X(2).                     00113800
571022     05  PCB-BRT-STATUS-CODE        PIC X(2).                     00113900
571023     05  PCB-BRT-PROC-OPTIONS       PIC X(4).                     00114000
571024     05  PCB-BRT-DLI-RES            PIC X(4).                     00114100
571025     05  PCB-BRT-SEG-NAME-FB        PIC X(8).                     00114200
571026     05  PCB-BRT-LENGTH-FD-KEY      PIC X(4).                     00114300
571027     05  PCB-BRT-NUMB-SENS-SEGS     PIC X(4).                     00114400
571028     05  PCB-BRT-FB-KEY             PIC X(24).                    00114500
571029                                                                  00114600
571030     COPY  HPCBGSAM.                                              00114700
571031***                                  ***                          00114800
571032*** ADDITIONAL PROGRAM PCB-S GO HERE ***                          00114900
571033***                                  ***                          00115000
571034     EJECT                                                        00115100
571035                                                                  00115200
571036     COPY  HWS0990I.                                              00115300
571037     EJECT                                                        00115400
571038                                                                  00115500
571039 PROCEDURE DIVISION.                                              00115600
571040                                                                  00115700
571041     ENTRY  "DLITCBL"  USING  IO-PCB                              00115800
571042                              ALT1-PCB                            00115900
571043                              ALT2-PCB                            00116000
571044                              ALT3-PCB                            00116100
571045                              PCB-HTABLES-GO                      00116200
571046                              PCB-HTABLES-UPDT                    00116300
571047                              PCB-HSECURITY                       00116400
571048                              PCB-HMAILBOX                        00116500
571049                              PCB-BATCH-RQST                      00116600
571050                              GS-IN-PCB1                          00116800
571051                              GS-OUT-PCB1                         00116900
571052                              GS-OUT-PCB2.                        00116910
571053                                                                  00117000
571054     COPY  HBP0000I.                                              00117100
571055     EJECT                                                        00117200
571056     COPY  HBP0100I.                                              00117300
571057     EJECT                                                        00117400
571058     COPY  HBP0200I.                                              00117500
571059     EJECT                                                        00117600
571060     COPY  HBP0300I.                                              00117700
571061     EJECT                                                        00117800
571062     COPY  HBP0400I.                                              00117900
571063     EJECT                                                        00118000
571064     COPY  HBP0600I.                                              00118100
571065     EJECT                                                        00118200
571066     COPY  HBP0700I.                                              00118300
571067     EJECT                                                        00118400
571068     COPY  HBP1000I.                                              00118500
571069***************************************************************** 00118600
571070*                                                               * 00118700
571071*    THE IMS RESTART CALL BEGINS IN THE COPYBOOK ABOVE.  ADD    * 00118800
571072*    HERE ANY AREAS YOU SAVED WITH A CHKP IN PARAGRAPH 6120A.   * 00118900
571073*    DELETE THE REFERENCES TO AREAS YOU DON'T NEED RESTORED.    * 00119000
571074*                                                               * 00119100
571075***************************************************************** 00119200
571076*                                                                 00119300
571077                             WS-RQST-RECORD-TABLE-LENGTH          00119400
571078                             WS-RQST-RECORD-TABLE                 00119500
571079                             WS-COMPLETED-RQST-LENGTH             00119600
571080                             WS-COMPLETED-RQST-TABLE              00119700
571081******                                                            00119800
571082******                       YOUR CHKP SAVE AREA(S) HERE.         00119900
571083******                       YOU MAY DELETE THE BATCH CONTROL     00120000
571084******                       AREA AND/OR BATCH REQUEST AREA       00120100
571085******                       IF UNNECESSARY, AND THERE MAY        00120200
571086******                       BE AS MANY AS SEVEN AREAS IN ALL.    00120300
571087******                       (COPYBOOK HBP1000I USES ONE.)        00120400
571088******                                                            00120500
571089******           THE FOLLOWING LINE CONTAINS THE REQUIRED PERIOD  00120600
571090     .                                                            00120700
571091 1010A-EXIT.                                                      00120800
571092     EXIT.                                                        00120900
571093                                                                  00121000
571094     EJECT                                                        00121100
571095     COPY  HBP1100I.                                              00121200
571096                                                                  00121300
571097     EJECT                                                        00121400
571098 1200A-APPL-SPECIFIC-INIT.                                        00121500
571099***************************************************************** 00121600
571100*                                                               * 00121700
571101*  THIS PARAGRAPH IS USED TO PERFORM ANY APPLICATION-SPECIFIC   * 00121800
571102*  GENERAL INITIALIZATION.                                      * 00121900
571103*                                                               * 00122000
571104***************************************************************** 00122100
571105*                                                                 00122200
571106***                                                               00122300
571107*** OPEN ANY OS/VS FILES USED (BMP ONLY)                          00122400
571108***                                                               00122500
571109*** ISSUE "OPEN" DL/I CALLS FOR ANY GSAM DATA BASES (BMP ONLY)    00122600
571110***                                                               00122700
571111*** IF MAILBOX IS TO BE USED, INITIALIZE FIELDS HERE.             00122800
571112***                                                               00122900
571113                                                                  00123000
571114     INITIALIZE                     WS-MISC                       00123100
571116                                    WS-APPL-SPECIFIC-XRST-AREA-SVD00123200
571117                                                                  00123300
571118     MOVE PROGRAM-NAME              TO LS-USERID-NUMBER           00123400
571119                                                                  00123500
571120*NUAD BEGIN
571121     PERFORM G00-GET-CURRENT-TIMESTAMP
571122     PERFORM L00-LOAD-ARRAY-FROM-FILE
571123*NUAD END
571124     PERFORM 5400M-OPEN-INPUT-FILE                                00123800
571125                                                                  00123820
571126     PERFORM 5500M-OPEN-ERROR-FILE                                00123830
571127                                                                  00123840
571128     PERFORM 5600M-OPEN-AUDIT-FILE                                00123850
571129                                                                  00123860
571130     PERFORM 3610M-GET-GMT-TIMESTAMP                              00124320
571131     .                                                            00124600
571132     EJECT                                                        00124700
571133                                                                  00124800
571134 1200A-EXIT.                                                      00124900
571135     EXIT.                                                        00125000
571136     EJECT                                                        00125100
571137     COPY  HBP2000I.                                              00125200
571138                                                                  00125300
571139     EJECT                                                        00125400
571140 2100A-APPL-RESTART-INIT.                                         00125500
571141***************************************************************** 00125600
571142*                                                               * 00125700
571143*  THIS PARAGRAPH SHOULD PERFORM ANY APPLICATION-SPECIFIC       * 00125800
571144*  INITIALIZATION TO BE DONE ON PROGRAM RESTART; E.G.,          * 00125900
571145*  REPOSITIONING IMS DATA BASES AND/OR REOPENING THE DRIVING    * 00126000
571146*  CURSOR, OR RESTORING SAVED DATA AREAS FROM THE COPIES MADE   * 00126100
571147*  AT THE TIME OF THE LAST CHECKPOINT.                          * 00126200
571148*                                                               * 00126300
571149***************************************************************** 00126400
571150*                                                                 00126500
571151***                                                               00126600
571152***  ONE POSSIBLE METHOD IS TO ISSUE A "GU" CALL USING THE        00126700
571153***  CONCATENATED KEY STORED IN THE KEY FEEDBACK AREA AT          00126800
571154***  RESTART TIME.                                                00126900
571155***                                                               00127000
571156***  GSAM DATA BASES ARE AUTOMATICALLY RE-POSITIONED BY           00127100
571157***  IMS/VS.                                                      00127200
571158***                                                               00127300
571159                                                                  00127400
571160                                                                  00127700
571161     MOVE PROGRAM-NAME                 TO LS-USERID-NUMBER        00127800
571162     MOVE WS-APPL-SPECIFIC-XRST-AREA                              00127810
571163          TO WS-APPL-SPECIFIC-XRST-AREA-SVD                       00127820
571164                                                                  00127900
571165     IF PROGRAM-HAS-BEEN-RESTARTED                                00128000
571166        PERFORM 5300M-XRST-GU-INFILE                              00128100
571167        MOVE  WS-XRST-RPT-PAGE-CTR TO WS-PAGE-CTR                 00128400
571168        MOVE  WS-XRST-RPT-LINE-CTR TO WS-LINE-CTR                 00128500
571169     END-IF                                                       00128600
571170                                                                  00128700
571171     .                                                            00128900
571172                                                                  00129000
571173 2100A-EXIT.                                                      00129100
571174     EXIT.                                                        00129200
571175     EJECT                                                        00129300
571176     COPY  HBP3000I.                                              00129400
571177                                                                  00129500
571178     EJECT                                                        00129600
571179 3100A-BEGIN-PROCESS.                                             00129700
571180***                                                               00129800
571181*** PERFORM ANY NECESSARY HOUSEKEEPING PRIOR TO PROCESSING        00129900
571182*** A REQUEST.                                                    00130000
571183***                                                               00130100
571184****                                                              00130200
571185**** THE FOLLOWING CODE MUST BE THE LAST LINE OF THIS PARAGRAPH   00130300
571186**** TO ALLOW THE SHELL TO PROCESS A VALID UNIT OF WORK.          00130400
571187****                                                              00130500
571188     SET NOT-REQUEST-COMPLETE TO TRUE.                            00130600
571189                                                                  00130700
571190 3100A-EXIT.                                                      00130800
571191     EXIT.                                                        00130900
571192                                                                  00131000
571193     EJECT                                                        00131100
571194     COPY  HBP3300I.                                              00131200
571195                                                                  00131300
571196     EJECT                                                        00131400
571197 3400A-END-PROCESS.                                               00131500
571198***                                                               00131600
571199*** PERFORM ANY NECESSARY WRAP-UP AFTER PROCESSING A REQUEST.     00131700
571200*** ANY NECESSARY END-OF-BATCH PROCESSING CAN ALSO BE DONE HERE.  00131800
571201*** NO-MORE-REQUESTS-TO-PROCESS IS SET IF THE BATCH IS ENDED.     00131900
571202***                                                               00132000
571203                                                                  00132100
571204     MOVE 1                       TO WS-MMP-HEAD1-PAGE            00132200
571205     MOVE TOP-OF-PAGE             TO WS-AUDIT-CC                  00132300
571206     MOVE WS-XRST-CURRENT-DATE(6:2)                               00132400
571207                                  TO WS-MMP-HEAD1-DATE(1:2)       00132500
571208     MOVE LIT-SLASH               TO WS-MMP-HEAD1-DATE(3:1)       00132600
571209     MOVE WS-XRST-CURRENT-DATE(9:2)                               00132700
571210                                  TO WS-MMP-HEAD1-DATE(4:2)       00132800
571211     MOVE LIT-SLASH               TO WS-MMP-HEAD1-DATE(6:1)       00132900
571212     MOVE WS-XRST-CURRENT-DATE(1:4)                               00133000
571213                                  TO WS-MMP-HEAD1-DATE(7:4)       00133100
571214     MOVE WS-MMP-STD-HEADING1     TO WS-AUDIT-LINE                00133200
571215     PERFORM 5650M-WRITE-AUDIT                                    00133300
571216                                                                  00133400
571217     MOVE DOUBLE-SPACE            TO WS-AUDIT-CC                  00133500
571218     MOVE PROGRAM-NAME            TO WS-MMP-HEAD2-PGM             00133600
571219     MOVE PAN-VALET(1:3)          TO WS-MMP-HEAD2-PGM-VER         00133700
571220     MOVE WS-XRST-CURRENT-TIME(1:2)                               00133800
571221                                  TO WS-MMP-HEAD2-TIME(1:2)       00133900
571222     MOVE LIT-COLON               TO WS-MMP-HEAD2-TIME(3:1)       00134000
571223     MOVE WS-XRST-CURRENT-TIME(4:2)                               00134100
571224                                  TO WS-MMP-HEAD2-TIME(4:2)       00134200
571225     MOVE LIT-COLON               TO WS-MMP-HEAD2-TIME(6:1)       00134300
571226     MOVE WS-XRST-CURRENT-TIME(7:2)                               00134400
571227                                  TO WS-MMP-HEAD2-TIME(7:2)       00134500
571228     MOVE WS-MMP-STD-HEADING2     TO WS-AUDIT-LINE                00134600
571229     PERFORM 5650M-WRITE-AUDIT                                    00134700
571230                                                                  00134800
571231     MOVE DOUBLE-SPACE            TO WS-AUDIT-CC                  00134900
571232     MOVE WS-MMP-STD-BTCH-HEAD1   TO WS-AUDIT-LINE                00135000
571233     PERFORM 5650M-WRITE-AUDIT                                    00135100
571234                                                                  00135200
571235     MOVE SINGLE-SPACE            TO WS-AUDIT-CC                  00135300
571236     MOVE WS-MMP-STD-BTCH-HEAD2   TO WS-AUDIT-LINE                00135400
571237     PERFORM 5650M-WRITE-AUDIT                                    00135500
571238                                                                  00135600
571239     MOVE WS-MMP-STD-BTCH-HEAD3   TO WS-AUDIT-LINE                00135700
571240     PERFORM 5650M-WRITE-AUDIT                                    00135800
571241                                                                  00135900
571242     INITIALIZE                      WS-MMP-STD-BTCH-DETAIL1      00136600
571243     MOVE LIT-INPUT-FILE                                          00136700
571244                                  TO WS-MMP-BTCH-FILE-NAME        00136800
571245     MOVE WS-XRST-RECS-READ       TO WS-MMP-BTCH-READ-CNT         00136900
571246     MOVE ZERO                    TO WS-MMP-BTCH-UPDATED-CNT      00137000
571247     MOVE ZERO                    TO WS-MMP-BTCH-DELETED-CNT      00137010
571248     MOVE WS-MMP-STD-BTCH-DETAIL1 TO WS-AUDIT-LINE                00137100
571249     PERFORM 5650M-WRITE-AUDIT                                    00137200
571250                                                                  00137300
571251*
571252     INITIALIZE                      WS-MMP-STD-BTCH-DETAIL1
571253     MOVE LIT-MMPD-ENG-VL-APP-TBL-N
571254                                  TO WS-MMP-BTCH-FILE-NAME
571255     MOVE WS-XRST-D22-READ        TO WS-MMP-BTCH-READ-CNT
571256     MOVE ZERO                    TO WS-MMP-BTCH-UPDATED-CNT
571257     MOVE WS-XRST-D22-DELETED     TO WS-MMP-BTCH-DELETED-CNT
571258     MOVE WS-MMP-STD-BTCH-DETAIL1 TO WS-AUDIT-LINE
571259     PERFORM 5650M-WRITE-AUDIT
571260*
571261     INITIALIZE                      WS-MMP-STD-BTCH-DETAIL1
571262     MOVE LIT-MMPD-FINASC-TBL-N
571263                                  TO WS-MMP-BTCH-FILE-NAME
571264     MOVE WS-XRST-D26-READ        TO WS-MMP-BTCH-READ-CNT
571265     MOVE ZERO                    TO WS-MMP-BTCH-UPDATED-CNT
571266     MOVE ZERO                    TO WS-MMP-BTCH-DELETED-CNT
571267     MOVE WS-MMP-STD-BTCH-DETAIL1 TO WS-AUDIT-LINE
571268     PERFORM 5650M-WRITE-AUDIT
571269*
571270
571271     INITIALIZE                      WS-MMP-STD-BTCH-DETAIL1      00137372
571272     MOVE LIT-ERROR-CNT                                           00137373
571273                                  TO WS-MMP-BTCH-FILE-NAME        00137374
571274     MOVE WS-ERROR-CNT            TO WS-MMP-BTCH-READ-CNT         00137375
571275     MOVE ZERO                    TO WS-MMP-BTCH-UPDATED-CNT      00137376
571276                                     WS-MMP-BTCH-DELETED-CNT      00137377
571277     MOVE WS-MMP-STD-BTCH-DETAIL1 TO WS-AUDIT-LINE                00137378
571278     PERFORM 5650M-WRITE-AUDIT                                    00137379
571279                                                                  00137380
571280     .                                                            00139500
571281                                                                  00139600
571282 3400A-EXIT.                                                      00139700
571283     EXIT.                                                        00139800
571284     EJECT                                                        00139900
571285     COPY  HBP3500I.                                              00140000
571286                                                                  00140100
571287     EJECT                                                        00140200
571288 3600A-PROCESS-BATCH-UOW.                                         00140300
571289***************************************************************** 00140400
571290*                                                               * 00140500
571291*  THIS PARAGRAPH SHOULD DRIVE THE PROCESSING OF A UNIT OF      * 00140600
571292*  WORK. SPECIAL CONSIDERATION:                                 * 00140700
571293*                                                               * 00140800
571294*       THE CODE MUST ALLOW FOR DEADLOCK SITUATIONS. THIS IS    * 00140900
571295*       WHEN THE PROGRAM HAS "LOCKED" A RESOURCE THAT ANOTHER   * 00141000
571296*       PROGRAM NEEDS, AND VICE VERSA. THIS WILL BE SIGNALED    * 00141100
571297*       BY THE FOLLOWING:                                       * 00141200
571298*                                                               * 00141300
571299*           DB2:        SQLCODE = -911                          * 00141400
571300*                                                               * 00141500
571301*       WHEN THIS CONDITION OCCURS, THE PROGRAMMER              * 00141600
571302*       IS RESPONSIBLE FOR PERFORMIMG 6500A-DETECT-             * 00141700
571303*       INTERNAL-RESTART.                                       * 00141800
571304*                                                               * 00141900
571305*       IMS WILL NOT RETURN A STATUS OF FD (DEADLOCK). INSTEAD  * 00142000
571306*       IT WILL WAIL TO GET CONTROL OF THE RESOURCES IT NEEDS.  * 00142100
571307*       IF IT SHOULD TIME OUT, A SYSTEM ABEND IS PERFORMED AND  * 00142200
571308*       CONTROL IS NOT PASSED BACK TO YOUR PROGRAM.             * 00142300
571309*                                                               * 00142400
571310***************************************************************** 00142500
571311*                                                                 00142600
571312                                                                  00142700
571313                                                                  00142900
571314     INITIALIZE SMMPE14                                           00142910
571315                DETAIL-LINE                                       00142930
571316                                                                  00142930
571317     PERFORM 3620M-GET-LOCAL-TIMESTAMP                            00143000
571318                                                                  00143100
571319*NUAD BEGIN
571320     IF INTERNAL-RESTART                                          00143500
571321         CONTINUE                                                 00143600
571322     ELSE                                                         00143610
571323*
571324         PERFORM P00-PROCESS-RECORD
571325*
571326     END-IF                                                       00144410
571330*NUAD END
571331     .                                                            00144500
571332 3600A-EXIT.                                                      00144600
571333     EXIT.                                                        00144700
571334     EJECT                                                        00144800
571335                                                                  00144900
571336 3610M-GET-GMT-TIMESTAMP.                                         00145000
571337                                                                  00145100
571338                                                                  00145200
571339 COPY PACMMPFA.                                                   00145300
571340                                                                  00145400
571341                                                                  00145500
571342     EVALUATE SQLCODE                  ALSO SQLWARN0              00145600
571343        WHEN DB2-SUCCESSFUL-RETURN     ALSO SPACES                00145700
571344           CONTINUE                                               00145800
571345        WHEN OTHER                                                00146100
571346          MOVE DB2-SELECT-CALL          TO HE-SQL-FUNCTION        00146200
571347          MOVE LIT-3610M                TO HE-PARAGRAPH           00146300
571348          MOVE LIT-MMP-IBM-STUPID-TBL-N TO HE-DB2-TABLE1          00146400
571349          MOVE LIT-BAD-DATERTN-CALL     TO HE-MSG1                00146500
571350          PERFORM 9998M-SETUP-DB2-ABEND                           00146600
571351     END-EVALUATE                                                 00146700
571352     .                                                            00146800
571353                                                                  00146900
571354 3620M-GET-LOCAL-TIMESTAMP.                                       00147000
571355     EXEC SQL                                                     00147100
571356        SELECT CURRENT DATE, CURRENT TIME                         00147200
571357        INTO   :WS-XRST-CURRENT-DATE,                             00147300
571358               :WS-XRST-CURRENT-TIME                              00147400
571359        FROM   SIBM_STUPID                                        00147500
571360     END-EXEC                                                     00147600
571361                                                                  00147700
571362     EVALUATE SQLCODE                  ALSO SQLWARN0              00147800
571363        WHEN DB2-SUCCESSFUL-RETURN     ALSO SPACES                00147900
571364           CONTINUE                                               00148000
571365        WHEN DB2-DEADLOCK              ALSO ANY                   00148100
571366          PERFORM 6500A-DETECT-INTERNAL-RESTART                   00148200
571367        WHEN OTHER                                                00148300
571368          MOVE DB2-SELECT-CALL          TO HE-SQL-FUNCTION        00148400
571369          MOVE LIT-3620M                TO HE-PARAGRAPH           00148500
571370          MOVE LIT-MMP-IBM-STUPID-TBL-N TO HE-DB2-TABLE1          00148600
571371          MOVE LIT-BAD-DATERTN-CALL     TO HE-MSG1                00148700
571372          PERFORM 9998M-SETUP-DB2-ABEND                           00148800
571373     END-EVALUATE                                                 00148900
571374     .                                                            00149000
571375 3800A-APPL-END-OF-JOB.                                           00149100
571376***************************************************************** 00149200
571377*                                                               * 00149300
571378*     THIS PARAGRAPH IS PERFORMED AS PART OF END-OF-JOB         * 00149400
571379*     PROCESSING.  CLOSE ALL FILES, GSAM OR OTHER.              * 00149500
571380*                                                               * 00149600
571381***************************************************************** 00149700
571382*                                                                 00149800
571383                                                                  00150000
571384     PERFORM 5800M-CLOSE-INPUT-FILE                               00150300
571385     PERFORM 5900M-CLOSE-AUDIT-FILE                               00150310
571386     PERFORM 5950M-CLOSE-ERROR-FILE                               00150320
571387     .                                                            00150400
571388     EJECT                                                        00150500
571389 3800A-EXIT.                                                      00150600
571390     EXIT.                                                        00150700
571391     EJECT                                                        00150800
578202                                                                  00216960
612302***************************************************************** 00246649
612303*                  4990M-ISRT-CHANGE-JOURNAL                    * 00246650
612304* PERFORMED BY:    4400M-                                       * 00246651
612305* PERFORMS:        6500A-,9998M-                                * 00246652
612306*                                                               * 00246653
612307***************************************************************** 00246654
612308*                                                                 00246655
612309 4990M-ISRT-CHANGE-JOURNAL.                                       00246656
612310                                                                  00246657
612311     MOVE WS-ISO-DATE-TIME-STAMP TO CHG-JOURNAL-UPDATE-TIMESTAMP  00246658
612312     MOVE PROGRAM-NAME           TO CHG-JOURNAL-UPDATE-PROGRAM-ID 00246659
612313                                    LS-USERID-NUMBER              00246660
612314                                                                  00246661
612315     CALL "PA0046JC" USING WS-SQLCA                               00246662
612316                           LINKAGE-PARAMETERS                     00246663
612317                           CHG-JOURNAL-PARMS                      00246664
612318                           ALT3-PCB                               00246665
612319                                                                  00246666
612320     IF  NORMAL-COMPLETION                                        00246667
612321         CONTINUE                                                 00246668
612322     ELSE                                                         00246669
612323         IF  WS-SQLCODE = DB2-DEADLOCK                            00246670
612324             MOVE WS-SQLCA   TO SQLCA                             00246671
612325             PERFORM 6500A-DETECT-INTERNAL-RESTART                00246672
612326         ELSE                                                     00246673
612327             MOVE WS-SQLCA             TO SQLCA                   00246674
612328             MOVE LIT-4990M            TO HE-PARAGRAPH            00246675
612329             MOVE LS-COMMENT-TEXT-2    TO HE-MSG1                 00246676
612330             MOVE LS-ERR-TABLE-NAME    TO HE-DB2-TABLE1           00246677
612331             MOVE LS-ERR-CURSOR-NAME   TO HE-HOST-VAR1            00246678
612332             STRING                                               00246679
612333                  LS-PROGRAM-NAME      ","                        00246680
612334                  LS-PARAGRAPH-NUMBER  ","                        00246681
612335                  LS-COMMENT-TEXT      ","                        00246682
612336                  DELIMITED BY SIZE INTO  HE-MSG2                 00246683
612337             END-STRING                                           00246684
612338             PERFORM 9998M-SETUP-DB2-ABEND                        00246685
612339         END-IF                                                   00246686
612340     END-IF                                                       00246687
612341     .                                                            00246688
612342     EJECT                                                        00246689
612343 5000A-GET-NEXT-DRIVING-RECORD.                                   00246690
612344***************************************************************** 00246691
612345*                                                               * 00246692
612346*  THIS PARAGRAPH SHOULD BE USED TO OBTAIN THE NEXT RECORD TO   * 00246700
612347*  BE USED TO "DRIVE" APPLICATION LOGIC.                        * 00246800
612348*                                                               * 00246900
612349*  NOTE:  THE PROGRAMMER IS RESPONSIBLE FOR SETTING THE SWITCH  * 00247000
612350*         "DRIVING-RECORD-OBTAINED". THIS WILL INFORM THE SHELL * 00247100
612351*         TO CONTINUE PROCESSING.                               * 00247200
612352*                                                               * 00247300
612353*  PROGRAMMERS USING PRIMING READ MAY WISH TO BREAK THE INPUT   * 00247400
612354*  INTO "REQUESTS" BY SETTING REQUEST-COMPLETE TO TRUE WHEN     * 00247500
612355*  A BREAK OCCURS.  YOU CAN THEN USE PARA. 3100A FOR PRE-       * 00247600
612356*  LIMINARY PROCESSING AND PARA. 3400A FOR FINISHING UP.        * 00247700
612357*                                                               * 00247800
612358*  IF THE END OF DRIVING RECORDS SIGNIFIES THE END OF THE       * 00247900
612359*  RUN, SET NO-MORE-REQUESTS-TO-PROCESS TO TRUE WHEN IT         * 00248000
612360*  OCCURS.                                                      * 00248100
612361*                                                               * 00248200
612362***************************************************************** 00248300
612363*                                                                 00248400
612364     SET   NOT-DRIVING-RECORD-OBTAINED  TO  TRUE                  00248500
612365                                                                  00248600
612366     CALL "CBLTDLI" USING GN                                      00248700
612367                          GS-IN-PCB1                              00248800
612369                          FI-INFILE-RECORD                        00248900
612370                          WS-XRST-RSA-GSAM                        00249000
612371                                                                  00249100
612372     EVALUATE GS-IN-PCB1-STATUS                                   00249200
612373                                                                  00249300
612374         WHEN BB                                                  00249400
612375            SET DRIVING-RECORD-OBTAINED      TO TRUE              00249500
612376            ADD +1                           TO WS-XRST-RECS-READ 00249600
612380                                                                  00249700
612381         WHEN GB                                                  00249800
612382            SET NO-MORE-REQUESTS-TO-PROCESS  TO TRUE              00249900
612383                                                                  00250000
612384         WHEN OTHER                                               00250100
612385            SET WS-ABEND-IMS-ERROR       TO TRUE                  00250200
612386            MOVE LIT-5000A               TO HE-PARAGRAPH          00250300
612387            MOVE GN                      TO HE-CALL               00250400
612388            MOVE GS-IN-PCB1-STATUS       TO HE-STATUS             00250500
612389            MOVE GS-IN-PCB1-KEY-FB       TO HE-FEEDBACK           00250600
612390            MOVE LIT-INPUT-READ-ERR      TO HE-MSG1               00250700
612391            PERFORM 9990H-ABNORMAL-END-OF-JOB                     00250800
612392                                                                  00250900
612393     END-EVALUATE                                                 00251000
612394     .                                                            00251100
612395                                                                  00251200
612396 5000A-EXIT.                                                      00251300
612397     EXIT.                                                        00251400
612398     EJECT                                                        00251500
612399 L000A-READ-INPUT-RECORD.                                         00246690
612419     CALL "CBLTDLI" USING GN                                      00248700
612420                          GS-IN-PCB1                              00248800
612422                          FI-INFILE-RECORD                        00248900
612423                          WS-XRST-RSA-GSAM                        00249000
612425     EVALUATE GS-IN-PCB1-STATUS                                   00249200
612427         WHEN BB                                                  00249400
612429            ADD +1 TO WS-INP-FILE-REC-COUNT                             00
612431         WHEN GB                                                  00249800
612432            SET WS-EOF             TO TRUE                        00249900
612434         WHEN OTHER                                               00250100
612435            SET WS-ABEND-IMS-ERROR       TO TRUE                  00250200
612436            MOVE "L0000A"                TO HE-PARAGRAPH          00250300
612437            MOVE GN                      TO HE-CALL               00250400
612438            MOVE GS-IN-PCB1-STATUS       TO HE-STATUS             00250500
612439            MOVE GS-IN-PCB1-KEY-FB       TO HE-FEEDBACK           00250600
612440            MOVE LIT-INPUT-READ-ERR      TO HE-MSG1               00250700
612441            PERFORM 9990H-ABNORMAL-END-OF-JOB                     00250800
612443     END-EVALUATE                                                 00251000
612444     .                                                            00251100
612445                                                                  00251200
612446 L000A-EXIT.                                                      00251300
612447     EXIT.                                                        00251400
612448     EJECT                                                        00251500
612449 L005A-LOAD-ARRAY.                                                00246690
612450     CALL "CBLTDLI" USING GN                                      00248700
612451                          GS-IN-PCB1                              00248800
612452                          FI-INFILE-RECORD                        00248900
612453                          WS-XRST-RSA-GSAM                        00249000
612454     EVALUATE GS-IN-PCB1-STATUS                                   00249200
612455         WHEN BB                                                  00249400
612456            MOVE FI-INFILE-RECORD TO WS-INP-FILE-ARRAY(WS-IN)           00
612457         WHEN GB                                                  00249800
612458            SET WS-EOF-END-AR-LOAD TO TRUE                        00249900
612459         WHEN OTHER                                               00250100
612460            SET WS-ABEND-IMS-ERROR       TO TRUE                  00250200
612461            MOVE "L0000A"                TO HE-PARAGRAPH          00250300
612462            MOVE GN                      TO HE-CALL               00250400
612463            MOVE GS-IN-PCB1-STATUS       TO HE-STATUS             00250500
612464            MOVE GS-IN-PCB1-KEY-FB       TO HE-FEEDBACK           00250600
612465            MOVE LIT-INPUT-READ-ERR      TO HE-MSG1               00250700
612466            PERFORM 9990H-ABNORMAL-END-OF-JOB                     00250800
612467     END-EVALUATE                                                 00251000
612468     .                                                            00251100
612469                                                                  00251200
612470 L005A-EXIT.                                                      00251300
612471     EXIT.                                                        00251400
612472     EJECT                                                        00251500
612473 5300M-XRST-GU-INFILE.                                            00251600
612474***************************************************************** 00251700
612475*                                                               * 00251800
612476*  REPOSITION ON A RESTART                                      * 00251900
612477*                                                               * 00252194
612478***************************************************************** 00252195
612479*                                                                 00252196
612480     SET   NOT-DRIVING-RECORD-OBTAINED  TO  TRUE                  00252197
612481                                                                  00252198
612482     CALL "CBLTDLI" USING GU                                      00252199
612483                          GS-IN-PCB1                              00252200
612484                          FI-INFILE-RECORD                        00252201
612485                          WS-XRST-RSA-GSAM                        00252202
612486                                                                  00252203
612487     EVALUATE GS-IN-PCB1-STATUS                                   00252204
612488                                                                  00252205
612489         WHEN BB                                                  00252206
612490            SET DRIVING-RECORD-OBTAINED      TO TRUE              00252207
612491            ADD +1                           TO WS-XRST-RECS-READ 00252208
612494         WHEN GB                                                  00252210
612495            SET NO-MORE-REQUESTS-TO-PROCESS  TO TRUE              00252211
612496                                                                  00252212
612497         WHEN OTHER                                               00252213
612498            SET WS-ABEND-IMS-ERROR       TO TRUE                  00252214
612499            MOVE LIT-5300M               TO HE-PARAGRAPH          00252215
612500            MOVE GU                      TO HE-CALL               00252216
612501            MOVE GS-IN-PCB1-STATUS       TO HE-STATUS             00252217
612502            MOVE GS-IN-PCB1-KEY-FB       TO HE-FEEDBACK           00252218
612503            MOVE LIT-INPUT-READ-ERR      TO HE-MSG1               00252219
612504            PERFORM 9990H-ABNORMAL-END-OF-JOB                     00252220
612505                                                                  00252221
612506     END-EVALUATE                                                 00252222
612507     .                                                            00252223
612508                                                                  00252224
612509 5300M-EXIT.                                                      00252225
612510     EXIT.                                                        00252226
612511     EJECT                                                        00252227
612512***************************************************************** 00252230
612513*                  5400M-OPEN-INPUT-FILE                        * 00252300
612514* PERFORMED BY:    1200A-                                       * 00252400
612515* PERFORMS:        9990H-                                       * 00252500
612516*                                                               * 00252600
612517***************************************************************** 00252700
612518*                                                                 00252800
612519 5400M-OPEN-INPUT-FILE.                                           00258200
612520                                                                  00258300
612521     CALL "CBLTDLI"  USING    GSAM-OPEN                           00258400
612522                              GS-IN-PCB1                          00258500
612523                                                                  00258600
612524     EVALUATE GS-IN-PCB1-STATUS                                   00258700
612525                                                                  00258800
612526            WHEN BB                                               00258900
612527                 CONTINUE                                         00259000
612528                                                                  00259100
612529            WHEN OTHER                                            00259200
612530                 SET  WS-ABEND-IMS-ERROR        TO TRUE           00259300
612531                 MOVE GS-IN-PCB1-STATUS         TO HE-STATUS      00259400
612532                 MOVE GS-IN-PCB1-KEY-FB         TO HE-FEEDBACK    00259410
612533                 MOVE GSAM-OPEN                 TO HE-CALL        00259500
612534                 MOVE LIT-5400M                 TO HE-PARAGRAPH   00259600
612535                 MOVE LIT-INVALID-OPEN-CALL     TO HE-MSG1        00259700
612536                 PERFORM 9990H-ABNORMAL-END-OF-JOB                00259800
612537                                                                  00259900
612538     END-EVALUATE                                                 00260000
612539     .                                                            00260100
612540     EJECT                                                        00260200
612541                                                                  00260300
612542***************************************************************** 00260301
612543*                  5500M-OPEN-ERROR-FILE                        * 00260302
612544* PERFORMED BY:    1200A-                                       * 00260303
612545* PERFORMS:        9990H-                                       * 00260304
612546*                                                               * 00260305
612547***************************************************************** 00260306
612548*                                                                 00260307
612549 5500M-OPEN-ERROR-FILE.                                           00260308
612550                                                                  00260309
612551     CALL "CBLTDLI"  USING    GSAM-OPEN                           00260310
612552                              GS-OUT-PCB1                         00260311
612553                                                                  00260312
612554     EVALUATE GS-OUT-PCB1-STATUS                                  00260313
612555                                                                  00260314
612556            WHEN BB                                               00260315
612557                 CONTINUE                                         00260316
612558                                                                  00260317
612559            WHEN OTHER                                            00260318
612560                 SET  WS-ABEND-IMS-ERROR        TO TRUE           00260319
612561                 MOVE GS-OUT-PCB1-STATUS        TO HE-STATUS      00260320
612562                 MOVE GS-OUT-PCB1-KEY-FB        TO HE-FEEDBACK    00260321
612563                 MOVE GSAM-OPEN                 TO HE-CALL        00260322
612564                 MOVE LIT-5500M                 TO HE-PARAGRAPH   00260324
612565                 MOVE LIT-INVALID-OPEN-CALL     TO HE-MSG1        00260325
612566                 PERFORM 9990H-ABNORMAL-END-OF-JOB                00260326
612567                                                                  00260327
612568     END-EVALUATE                                                 00260328
612569     .                                                            00260329
612570     EJECT                                                        00260330
612571                                                                  00260331
612572***************************************************************** 00260332
612573*                  5600M-OPEN-AUDIT-FILE                        * 00260333
612574* PERFORMED BY:    1200A-                                       * 00260334
612575* PERFORMS:        9990H-                                       * 00260335
612576*                                                               * 00260336
612577***************************************************************** 00260337
612578*                                                                 00260338
612579 5600M-OPEN-AUDIT-FILE.                                           00260339
612580                                                                  00260340
612581     CALL "CBLTDLI"  USING    GSAM-OPEN                           00260341
612582                              GS-OUT-PCB2                         00260342
612583                                                                  00260343
612584     EVALUATE GS-OUT-PCB2-STATUS                                  00260344
612585                                                                  00260345
612586            WHEN BB                                               00260346
612587                 CONTINUE                                         00260347
612588                                                                  00260348
612589            WHEN OTHER                                            00260349
612590                 SET  WS-ABEND-IMS-ERROR        TO TRUE           00260350
612591                 MOVE GS-OUT-PCB2-STATUS        TO HE-STATUS      00260351
612592                 MOVE GS-OUT-PCB2-KEY-FB        TO HE-FEEDBACK    00260352
612593                 MOVE GSAM-OPEN                 TO HE-CALL        00260353
612594                 MOVE LIT-5600M                 TO HE-PARAGRAPH   00260354
612595                 MOVE LIT-INVALID-OPEN-CALL     TO HE-MSG1        00260355
612596                 PERFORM 9990H-ABNORMAL-END-OF-JOB                00260356
612597                                                                  00260357
612598     END-EVALUATE                                                 00260358
612599     .                                                            00260359
612600     EJECT                                                        00260360
612601                                                                  00260361
612602***************************************************************** 00260362
612603*                  5650M-WRITE-AUDIT                            * 00260363
612604* PERFORMED BY:    3400A-                                       * 00260364
612605* PERFORMS:        9990H-                                       * 00260365
612606*                                                               * 00260366
612607***************************************************************** 00260367
612608*                                                                 00260370
612609 5650M-WRITE-AUDIT.                                               00260400
612610                                                                  00260500
612611     CALL "CBLTDLI" USING ISRT                                    00260600
612612                          GS-OUT-PCB2                             00260700
612613                          WS-AUDIT-LINE.                          00260800
612614                                                                  00260900
612615     EVALUATE GS-OUT-PCB2-STATUS                                  00261000
612616                                                                  00261100
612617            WHEN BB                                               00261200
612618                 CONTINUE                                         00261300
612619                                                                  00261400
612620            WHEN OTHER                                            00261500
612621                 SET  WS-ABEND-IMS-ERROR        TO TRUE           00261600
612622                 MOVE GS-OUT-PCB2-KEY-FB        TO HE-FEEDBACK    00261610
612623                 MOVE GS-OUT-PCB2-STATUS        TO HE-STATUS      00261700
612624                 MOVE ISRT                      TO HE-CALL        00261800
612625                 MOVE LIT-5650M                 TO HE-PARAGRAPH   00261900
612626                 MOVE LIT-BAD-ISRT-STATUS       TO HE-MSG1        00262000
612627                 PERFORM 9990H-ABNORMAL-END-OF-JOB                00262100
612628                                                                  00262200
612629     END-EVALUATE                                                 00262300
612630     .                                                            00262400
612631     EJECT                                                        00262500
612632                                                                  00262600
612633 5700M-WRITE-ERROR.                                               00262610
612634                                                                  00262620
612635     CALL "CBLTDLI" USING ISRT                                    00262630
612636                          GS-OUT-PCB1                             00262640
612637                          DETAIL-LINE.                            00262650
612638                                                                  00262660
612639     EVALUATE GS-OUT-PCB1-STATUS                                  00262670
612640                                                                  00262680
612641            WHEN BB                                               00262690
612642                 CONTINUE                                         00262691
612643                                                                  00262692
612644            WHEN OTHER                                            00262693
612645                 SET  WS-ABEND-IMS-ERROR        TO TRUE           00262694
612646                 MOVE GS-OUT-PCB1-STATUS        TO HE-STATUS      00262695
612647                 MOVE ISRT                      TO HE-CALL        00262696
612648                 MOVE GS-OUT-PCB1-KEY-FB        TO HE-FEEDBACK    00262697
612649                 MOVE LIT-5700M                 TO HE-PARAGRAPH   00262698
612650                 MOVE LIT-BAD-ISRT-STATUS       TO HE-MSG1        00262699
612651                 PERFORM 9990H-ABNORMAL-END-OF-JOB                00262700
612652                                                                  00262701
612653     END-EVALUATE                                                 00262702
612654     .                                                            00262703
612655     EJECT                                                        00262704
612656                                                                  00262705
612657***************************************************************** 00262710
612658*                  5800M-CLOSE-INPUT-FILE                       * 00262800
612659* PERFORMED BY:    3800A-                                       * 00262900
612660* PERFORMS:        9990H-                                       * 00263000
612661*                                                               * 00263200
612662***************************************************************** 00263300
612663*                                                                 00263400
612664 5800M-CLOSE-INPUT-FILE.                                          00266700
612665                                                                  00266800
612666     CALL "CBLTDLI"  USING    GSAM-CLSE                           00266900
612667                              GS-IN-PCB1                          00267000
612668                                                                  00267100
612669     EVALUATE GS-IN-PCB1-STATUS                                   00267200
612670                                                                  00267300
612671            WHEN BB                                               00267400
612672                 CONTINUE                                         00267500
612673                                                                  00267600
612674            WHEN OTHER                                            00267700
612675                 SET  WS-ABEND-IMS-ERROR          TO TRUE         00267800
612676                 MOVE GS-IN-PCB1-STATUS           TO HE-STATUS    00267900
612677                 MOVE GS-IN-PCB1-KEY-FB           TO HE-FEEDBACK  00267910
612678                 MOVE GSAM-CLSE                   TO HE-CALL      00268000
612679                 MOVE LIT-5800M                   TO HE-PARAGRAPH 00268100
612680                 MOVE LIT-INVALID-CLOSE-CALL      TO HE-MSG1      00268200
612681                 PERFORM 9990H-ABNORMAL-END-OF-JOB                00268300
612682                                                                  00268400
612683     END-EVALUATE                                                 00268500
612684     .                                                            00268600
612685                                                                  00271700
612686***************************************************************** 00271710
612687*                  5900M-CLOSE-AUDIT-FILE                       * 00271720
612688* PERFORMED BY:    3800A-                                       * 00271730
612689* PERFORMS:        9990H-                                       * 00271740
612690*                                                               * 00271750
612691***************************************************************** 00271760
612692*                                                                 00271770
612693 5900M-CLOSE-AUDIT-FILE.                                          00271780
612694                                                                  00271790
612695     CALL "CBLTDLI"  USING    GSAM-CLSE                           00271791
612696                              GS-OUT-PCB2                         00271792
612697                                                                  00271793
612698     EVALUATE GS-OUT-PCB2-STATUS                                  00271794
612699                                                                  00271795
612700            WHEN BB                                               00271796
612701                 CONTINUE                                         00271797
612702                                                                  00271798
612703            WHEN OTHER                                            00271799
612704                 SET  WS-ABEND-IMS-ERROR          TO TRUE         00271800
612705                 MOVE GS-OUT-PCB2-STATUS          TO HE-STATUS    00271801
612706                 MOVE GS-OUT-PCB2-KEY-FB          TO HE-FEEDBACK  00271802
612707                 MOVE GSAM-CLSE                   TO HE-CALL      00271803
612708                 MOVE LIT-5900M                   TO HE-PARAGRAPH 00271804
612709                 MOVE LIT-INVALID-CLOSE-CALL      TO HE-MSG1      00271805
612710                 PERFORM 9990H-ABNORMAL-END-OF-JOB                00271806
612711                                                                  00271807
612712     END-EVALUATE                                                 00271808
612713     .                                                            00271809
612714***************************************************************** 00271810
612715*                  5950M-CLOSE-AUDIT-FILE                       * 00271811
612716* PERFORMED BY:    3800A-                                       * 00271812
612717* PERFORMS:        9990H-                                       * 00271813
612718*                                                               * 00271814
612719***************************************************************** 00271815
612720*                                                                 00271816
612721 5950M-CLOSE-ERROR-FILE.                                          00271817
612722                                                                  00271818
612723     CALL "CBLTDLI"  USING    GSAM-CLSE                           00271819
612724                              GS-OUT-PCB1                         00271820
612725                                                                  00271821
612726     EVALUATE GS-OUT-PCB1-STATUS                                  00271822
612727                                                                  00271823
612728            WHEN BB                                               00271824
612729                 CONTINUE                                         00271825
612730                                                                  00271826
612731            WHEN OTHER                                            00271827
612732                 SET  WS-ABEND-IMS-ERROR          TO TRUE         00271828
612733                 MOVE GS-OUT-PCB1-STATUS          TO HE-STATUS    00271829
612734                 MOVE GS-OUT-PCB1-KEY-FB          TO HE-FEEDBACK  00271830
612735                 MOVE GSAM-CLSE                   TO HE-CALL      00271831
612736                 MOVE LIT-5900M                   TO HE-PARAGRAPH 00271832
612737                 MOVE LIT-INVALID-CLOSE-CALL      TO HE-MSG1      00271833
612738                 PERFORM 9990H-ABNORMAL-END-OF-JOB                00271834
612739                                                                  00271835
612740     END-EVALUATE                                                 00271836
612741     .                                                            00271837
612742                                                                  00271838
612743 6000A-CLOSE-CURSORS.                                             00271840
612744***************************************************************** 00271900
612745*                                                               * 00272000
612746* THIS PARAGRAPH SHOULD BE USED AS PART OF NORMAL CHECKPOINT    * 00272100
612747* PROCESSING. ALL DB2 CURSORS MUST BE CLOSED PRIOR TO ISSUING   * 00272200
612748* THE CHECKPOINT.                                               * 00272300
612749*                                                               * 00272400
612750***************************************************************** 00272500
612751*                                                                 00272600
612752 6000A-EXIT.                                                      00272700
612753     EXIT.                                                        00272800
612754                                                                  00272900
612755     EJECT                                                        00273000
612756     COPY  HBP6100I.                                              00273100
612757                                                                  00273200
612758     EJECT                                                        00273300
612759 6110A-SAVE-APPL-SPECIFIC-DATA.                                   00273400
612760***************************************************************** 00273500
612761*                                                               * 00273600
612762* THIS PARAGRAPH IS USED TO SAVE ANY DATA WHICH THE APPLICATION * 00273700
612763* WOULD LIKE TO HAVE AVAILABLE ON PROGRAM RESTART.              * 00273800
612764* "WS-APPL-SPECIFIC-XRST-AREA" IS PART OF WS-XRST-AREA, AND IS  * 00273900
612765* SAVED WITH THE CODE PROVIDED.  MAKE COPIES OF OTHER DATA YOU  * 00274000
612766* WISH TO SAVE AND ADD THEIR NAMES TO THE CHKP CALL IN PARA     * 00274100
612767* 6120A AND TO THE XRST CALL IN PARA 1010A.  THESE MOVES MAY    * 00274200
612768* BE DELETED IF YOU DON'T USE BR&T.                             * 00274300
612769*                                                               * 00274400
612770***************************************************************** 00274500
612771*                                                                 00274600
612772                                                                  00274700
612773     IF SECOND-CHKP-TAKEN                                         00274800
612774        ADD +1                           TO WS-XRST-CHKP-CNT      00274900
612775     ELSE                                                         00275000
612776         MOVE ZEROES                     TO WS-XRST-CHKP-CNT      00275100
612777     END-IF                                                       00275200
612778                                                                  00275300
612779     MOVE WS-PAGE-CTR TO WS-XRST-RPT-PAGE-CTR                     00275400
612780     MOVE WS-LINE-CTR TO WS-XRST-RPT-LINE-CTR                     00275500
612781                                                                  00275610
612782     MOVE WS-APPL-SPECIFIC-XRST-AREA-SVD                          00275700
612783       TO WS-APPL-SPECIFIC-XRST-AREA                              00275800
612784     .                                                            00275900
612785 6110A-EXIT.                                                      00276000
612786     EXIT.                                                        00276100
612787                                                                  00276200
612788     EJECT                                                        00276300
612789 6120A-CHKP-CALL.                                                 00276400
612790                                                                  00276500
612791     COPY HBP6120I.                                               00276600
612792                                                                  00276700
612793***************************************************************** 00276800
612794*    THE IMS CHECKPOINT CALL BEGINS IN THE COPYBOOK ABOVE.      * 00276900
612795*    ADD HERE ANY AREAS YOU WANT RESTORED WITH THE XRST IN      * 00277000
612796*    PARAGRAPH 1010A.  DELETE THE REFERENCES TO AREAS YOU       * 00277100
612797*    DON'T NEED TO SAVE.                                        * 00277200
612798***************************************************************** 00277300
612799                                                                  00277400
612800                             WS-RQST-RECORD-TABLE-LENGTH          00277500
612801                             WS-RQST-RECORD-TABLE                 00277600
612802                             WS-COMPLETED-RQST-LENGTH             00277700
612803                             WS-COMPLETED-RQST-TABLE              00277800
612804******                                                            00277900
612805******                       ADD YOUR CHKP SAVE AREA(S) HERE.     00278000
612806******                       YOU MAY DELETE ANY OF THE LENGTH/    00278100
612807******                       AREA PAIRS ABOVE THAT YOU DO NOT     00278200
612808******                       NEED, AND THERE MAY BE AS MANY       00278300
612809******                       AS SEVEN PAIRS IN ALL.               00278400
612810******                       (COPYBOOK HBP6120I USES ONE.)        00278500
612811******                                                            00278600
612812******    THE FOLLOWING LINE CONTAINS THE REQUIRED PERIOD         00278700
612813                                                                  00278800
612814     .                                                            00278900
612815 6120A-EXIT.                                                      00279000
612816     EXIT.                                                        00279100
612817                                                                  00279200
612818     EJECT                                                        00279300
612819 6200A-POST-CHKP-PROCESS.                                         00279400
612820***************************************************************** 00279500
612821*                                                               * 00279600
612822* THIS PARAGRAPH IS PERFORMED AFTER TAKING A CHECKPOINT.        * 00279700
612823*                                                               * 00279800
612824***************************************************************** 00279900
612825*                                                                 00280000
612826*** ANY IMS/VS NON-GSAM DATABASES IN USE AT THE TIME OF           00280100
612827*** THE CHECKPOINT HAVE LOST THEIR POSITION. IF THE APPL-         00280200
612828*** ICATION MUST CONTINUE PROCESSING ONE OF THESE DATA            00280300
612829*** BASES AT POINT WHERE IT LEFT OFF, THE DATA BASES MUST         00280400
612830*** BE RE-POSITIONED.                                             00280500
612831***                                                               00280600
612832*** ANY DB2 CURSORS IN USE AT THE TIME OF THE CHECKPOINT          00280700
612833*** HAVE BEEN CLOSED. IF IT IS NECESSARY TO CONTINUE              00280800
612834*** PROCESSING THE DRIVING CURSOR AT THE POINT WHERE IT           00280900
612835*** LEFT OFF, THE APPLICATION MUST POSITION AND RE-OPEN           00281000
612836*** THE DRIVING CURSOR HERE.                                      00281100
612837***                                                               00281200
612838 6200A-EXIT.                                                      00281300
612839     EXIT.                                                        00281400
612840     EJECT                                                        00281500
612841                                                                  00281600
612842 6500A-DETECT-INTERNAL-RESTART.                                   00281700
612843***************************************************************** 00281800
612844*                                                               * 00281900
612845*  THIS PARAGRAPH CHECKS THE "SQLCODE" RETURNED FROM A DB2      * 00282000
612846*  CALL. IF THE CODE INDICATES THAT THE PROGRAM HAS BEEN RE-    * 00282100
612847*  STARTED AFTER A DEADLOCK SITUATION ("DEADLY EMBRACE"), THEN  * 00282200
612848*  THIS PARAGRAPH SETS THE APPROPRIATE SWITCH. THE PROGRAM      * 00282300
612849*  THEN ATTEMPTS TO CONTINUE PROCESSING. SHOULD THIS SITUATION  * 00282400
612850*  OCCUR AGAIN, THIS PARAGRAPH COUNTS THE NUMBER OF TIMES IT    * 00282500
612851*  HAS BEEN INVOKED ("WS-INTERNAL-RESTART-COUNTER").  IF IT BE  * 00282600
612852*  INVOKED TOO MANY TIMES (PERS2PS INDICATING A RECURRENT LOOP) * 00282700
612853*  IT SETS "SW-INTERNAL-RESTART-LIMIT-REACHED".  THE PROGRAM    * 00282800
612854*  WILL THEN ABNORMALLY TERMINATE.                              * 00282900
612855*                                                               * 00283000
612856*  IF THIS PARAGRAPH IS BEING PERFORMED AS INDICATED IN PARA    * 00283100
612857*  3600A-PROCESS-BATCH-UOW, UNCOMMENT THE FOLLOWING CODE.       * 00283200
612858*                                                               * 00283300
612859***************************************************************** 00283400
612860                                                                  00283500
612861     IF  SQLCODE  EQUAL  WS-SQLCODE-DEADLOCK                      00283600
612862         SET INTERNAL-RESTART      TO TRUE                        00283700
612863         ADD +1                    TO  WS-INTERNAL-RESTART-COUNTER00283800
612864         IF  WS-INTERNAL-RESTART-COUNTER  GREATER THAN            00283900
612865                     WS-INTERNAL-RESTART-MAX                      00284000
612866             SET INTERNAL-RESTART-LIMIT-REACHED                   00284100
612867                                   TO TRUE                        00284200
612868         END-IF                                                   00284300
612869     END-IF                                                       00284400
612870     .                                                            00284500
612871 6500A-EXIT.                                                      00284600
612872     EXIT.                                                        00284700
612873     EJECT                                                        00284800
612874     COPY  HBP7000I.                                              00284900
612875                                                                  00285000
612876     EJECT                                                        00285100
612877     COPY  HBP7010I.                                              00285200
612878                                                                  00285300
612879     EJECT                                                        00285400
612880 7100A-PREPARE-FOR-BATCH.                                         00285500
612881***                                                               00285600
612882***  PARAGRAPH 7100A IS PERFORMED AFTER EACH BATCH OF REQUESTS    00285700
612883***  IS OBTAINED.  HERE THE PROGRAMMER MAY PREPARE TO PROCESS     00285800
612884***  THE BATCH; E.G., SET A SUBSCRIPT TO POINT TO THE FIRST       00285900
612885***  REQUEST.                                                     00286000
612886***                                                               00286100
612887 7100A-EXIT.                                                      00286200
612888     EXIT.                                                        00286300
612889                                                                  00286400
612890     EJECT                                                        00286500
612891 7300A-APPL-OBTAIN-REQUESTS.                                      00286600
612892***************************************************************** 00286700
612893*                                                               * 00286800
612894*  THIS PARAGRAPH SHOULD BE USED TO OBTAIN REQUEST FOR THE      * 00286900
612895*  PROGRAM TO PROCESS WHEN THE BATCH REQUEST TABLE IS NOT       * 00287000
612896*  USED.                                                        * 00287100
612897*                                                               * 00287200
612898*  NOTE:  THE PROGRAMMER IS RESPONSIBLE FOR SETTING THE SWITCH  * 00287300
612899*         "VALID-PARAMETER".  THIS WILL INFORM THE SHELL TO     * 00287400
612900*         CONTINUE PROCESSING.                                  * 00287500
612901*                                                               * 00287600
612902*  PLEASE NOTE THAT WHEN THIS PARAGRAPH DETECTS THE INPUT HAS   * 00287700
612903*  BEEN EXHAUSTED, IS IN ERROR, OR DEADLOCK OCCURS, THE         * 00287800
612904*  FOLLOWING SWITCH MUST BE SET:                                * 00287900
612905*                                                               * 00288000
612906*  "SET NO-MORE-REQUESTS-TO-PROCESS TO TRUE".                   * 00288100
612907*                                                               * 00288200
612908*  WHEN THE INPUT HAS BEEN EXHAUSTED SET THE FOLLOWING SWITCH   * 00288300
612909*                                                               * 00288400
612910*  "SET END-BATCH-CNTL TO TRUE".                                * 00288500
612911*                                                               * 00288600
612912*   THE APPLICATION PROGRAM IS RESPONSIBLE FOR OBTAINING        * 00288700
612913*   REQUEST INFORMATION, AND STORING IT IN A SUITABLE PLACE.    * 00288800
612914*                                                               * 00288900
612915*?  IF THE PROGRAM PROCESSES BOTH BR&T AND BATCH CONTROL        * 00289000
612916*?  PARAMETERS, WHEN A NEW PLANT IS OBTAINED THE PROGRAMMER     * 00289100
612917*?  MUST SET WS-RQST-PROCESSED-SW (1) TO 'F'.  THIS WILL ALLOW  * 00289200
612918*?  THE BR&T PROCESSING TO LOOK FOR THE NEW BR&T REQUEST ID.    * 00289300
612919*?  PLEASE SEE TO DOCUMENTATION FOR FURTHER EXPLAINATION OF     * 00289400
612920*?  THIS PROCESSING.                                            * 00289500
612921*?                                                              * 00289600
612922*?  WE HAVE ALLOWED FOR THE PROCESSING OF THE 'IN-RALPH-ED'     * 00289700
612923*?  FLAG.  WHEN YOU VALIDATE THE NEW BATCH CONTROL PLANT OR     * 00289800
612924*?  WHEREVER YOU OBTAIN YOUR PLANT PROCESSING INFORMATION FROM, * 00289900
612925*?  IF THE FLAG IS ON, YOU CAN SET 'IN-RALPH-ED-FLAG' TO TRUE.  * 00290000
612926*?  THE SHELL WILL RESET THE SWITCH PRIOR TO PERFORMING THIS    * 00290100
612927*?  PARAGRAPH.  PLEASE SEE THE DOCUMENTATION FOR FURTHER        * 00290200
612928*?  INFORMATION ON THIS SUBJECT.  IF YOU ARE NOT CONCERNED WITH * 00290300
612929*?  THIS PROCESSING, NO ACTION IS REQUIRED.  THE SHELL WILL NOT * 00290400
612930*?  DEMAND THAT YOU ALTER THE SWITCH AT ALL.                    * 00290500
612931*                                                               * 00290600
612932***************************************************************** 00290700
612933*                                                                 00290800
612934*                                                                 00290900
612935     SET VALID-PARAMETER TO TRUE.                                 00291000
612936                                                                  00291100
612937     IF  REQUEST-COMPLETE                                         00291200
612938         SET NO-MORE-REQUESTS-TO-PROCESS        TO TRUE           00291300
612939         SET END-BATCH-CNTL                     TO TRUE           00291400
612940     END-IF                                                       00291500
612941     .                                                            00291600
612942*                                                                 00291700
612943 7300A-EXIT.                                                      00291800
612944     EXIT.                                                        00291900
612945                                                                  00292000
612946     EJECT                                                        00292100
612947     COPY  HBP7700I.                                              00292200
612948                                                                  00292300
612949      EJECT                                                       00292400
612950 7720A-APPL-HANDLE-HBRT-ERROR.                                    00292500
612951***************************************************************** 00292600
612952*                                                               * 00292700
612953*  THIS PARAGRAPH SHOULD BE USED TO HANDLE ANY INVALID STATUS   * 00292800
612954*  CODE RETURNED FROM "HBRTINIT".  THE FOLLOWING IS AN EXAMPLE  * 00292900
612955*  OF ERROR PROCESSING WITH FATAL ERROR SETUP                   * 00293000
612956***************************************************************** 00293100
612957***                                                               00293200
612958***  IF REQUEST-NOT-FOUND                                         00293300
612959***      SETUP ERROR PROCESSING                                   00293400
612960***  ELSE                                                         00293500
612961***      SET WS-ABEND-IMS-ERROR TO TRUE                           00293600
612962***      MOVE LIT-PARA-7720A TO HE-PARAGRAPH                      00293700
612963***      MOVE PCB-BRT-STATUS-CODE TO HE-STATUS                    00293800
612964***      MOVE PCB-BRT-SEG-LEVEL TO HE-LEVEL                       00293900
612965***      MOVE SPACES TO HE-SSA1 HE-SSA2 HE-SSA3                   00294000
612966***                     HE-SSA4 HE-SSA5                           00294100
612967***      MOVE LIT-HS2PBRTI TO WS-SUB-NAME                         00294200
612968***      MOVE WS-SUBROUTINE-ABEND TO HE-MSG1                      00294300
612969***      STRING "RETURN CODE= ", HBRTINIT-RETURN-CODE             00294400
612970***             DELIMITED BY SIZE INTO HE-MSG2                    00294500
612971***      PERFORM 9990H-ABNORMAL-END-OF-JOB THRU                   00294600
612972***              9990H-EXIT.                                      00294700
612973                                                                  00294800
612974 7720A-EXIT.                                                      00294900
612975      EXIT.                                                       00295000
612976                                                                  00295100
612977      EJECT                                                       00295200
612978 7800A-OBTAIN-RUN-TIME-PARMS.                                     00295300
612979***************************************************************** 00295400
612980*                                                               * 00295500
612981*  THIS PARAGRAPH OBTAINS VARIOUS FIELDS WHICH THE PROGRAM      * 00295600
612982*  REQUIRES.                                                    * 00295700
612983*                                                               * 00295800
612984*  NOTE:  STANDARD CHECKPOINT FREQUENCY FILE PROCESSING IS      * 00295900
612985*         NOW DONE IN PARAGRAPH 1000H.                          * 00296000
612986*                                                               * 00296100
612987***************************************************************** 00296200
612988                                                                  00296300
612989 7800A-EXIT.                                                      00296400
612990     EXIT.                                                        00296500
612991                                                                  00296600
612992     EJECT                                                        00296700
612993     COPY  HBP8000I.                                              00296800
612994     EJECT                                                        00296900
612995     COPY  HBP8020I.                                              00297000
612996     EJECT                                                        00297100
612997     COPY  HBP8030I.                                              00297200
612998                                                                  00297300
612999     EJECT                                                        00297400
613000 8040A-APPL-HANDLE-HBRT-ERROR.                                    00297500
613001***************************************************************** 00297600
613002*                                                               * 00297700
613003* THIS PARAGRAPH SHOULD BE USED TO HANDLE ANY ERROR STATUS CODES* 00297800
613004* PASSED BACK FROM CALLS TO "HBRTINIT".  THE FOLLOWING IS AN    * 00297900
613005* EXAMPLE FOR FATAL ERROR SETUP.                                * 00298000
613006***************************************************************** 00298100
613007***                                                               00298200
613008***  SET WS-ABEND-IMS-ERROR TO TRUE                               00298300
613009***  MOVE LIT-PARA-8040A TO HE-PARAGRAPH.                         00298400
613010***  MOVE PCB-BRT-STATUS-CODE TO HE-STATUS.                       00298500
613011***  MOVE PCB-BRT-SEG-LEVEL TO HE-LEVEL.                          00298600
613012***  MOVE SPACES TO HE-SSA1 HE-SSA2 HE-SSA3                       00298700
613013***                 HE-SSA4 HE-SSA5.                              00298800
613014***  MOVE LIT-HS2PBRTI TO WS-SUB-NAME                             00298900
613015***  MOVE WS-SUBROUTINE-ABEND TO HE-MSG1.                         00299000
613016***  STRING "RETURN CODE= ", HBRTINIT-RETURN-CODE                 00299100
613017***         DELIMITED BY SIZE INTO HE-MSG2.                       00299200
613018***  PERFORM 9990H-ABNORMAL-END-OF-JOB THRU                       00299300
613019***          9990H-EXIT.                                          00299400
613020*                                                                 00299500
613021 8040A-EXIT.                                                      00299600
613022     EXIT.                                                        00299700
613023                                                                  00299800
613024     EJECT                                                        00299900
613025     COPY  HBP8060I.                                              00300000
613026                                                                  00300100
613027     EJECT                                                        00300200
613028***************************************************************** 00300300
613029*                                                               * 00300400
613030* THIS PARAGRAPH ACCESES THE MAILBOX SUBSYSTEM.   IF YOU DO     * 00300500
613031* NOT USE MAILBOX, YOU MAY REMOVE IT AND COPYBOOKS MAILISRT     * 00300600
613032* AND HBP8110I, AND PARAGRAPH 8120A.                            * 00300700
613033*                                                               * 00300800
613034* TO USE THIS ROUTINE, YOU MUST:                                * 00300900
613035*  1) SET FIELDS IN "WS-MB-MESSAGE-ID-AREA" TO THE REGION,      * 00301000
613036*     DEPT, AND USER-ID OF THE MESSAGE DESTINATION.             * 00301100
613037*  2) SET "WS-MB-MESSAGE-TYPE" TO A VALID MESSAGE TYPE.         * 00301200
613038*  3) SET "WS-MB-SCREEN-MESSAGE" TO THE REQUIRED MESSAGE.       * 00301300
613039*  4) SET "WS-MB-PFKEY-" DATA TO THE APPROPRIATE START-UP PFKEY * 00301400
613040*     DATA.                                                     * 00301500
613041*  5) SET "WS-MB-PFKEY-SEG-COUNT" TO THE NUMBER OF POSSIBLE     * 00301600
613042*     PFKEY SEGMENTS IN THE WS- AREA.                           * 00301700
613043*  6) SET ANY OPTIONAL PARAMETERS (IF NECESSARY -- THEY WILL    * 00301800
613044*     BE BLANK OTHERWISE) IN "WS-MB-OPTIONAL-MESSAGE-AREA".     * 00301900
613045*                                                               * 00302000
613046***************************************************************** 00302100
613047*                                                                 00302200
613048     COPY  HBP8100I.                                              00302300
613049                                                                  00302400
613050     EJECT                                                        00302500
613051     COPY  HBP8110I.                                              00302600
613052                                                                  00302700
613053     EJECT                                                        00302800
613054 8120A-APPL-MAILBOX-RETURN.                                       00302900
613055***************************************************************** 00303000
613056*                                                               * 00303100
613057*  THIS PARAGRAPH SHOULD BE USED BY THE APPLICATION WHEN USING  * 00303200
613058*  THE "MAILBOX" FUNCTION TO CHECK RETURN CODES FROM "HS2PMAII".* 00303300
613059*                                                               * 00303400
613060***************************************************************** 00303500
613061*                                                                 00303600
613062 8120A-EXIT.                                                      00303700
613063     EXIT.                                                        00303800
613064                                                                  00303900
613065     EJECT                                                        00304000
613066                                                                  00304100
613067 8300A-CALL-CHECK-DATA.                                           00304200
613068***************************************************************** 00304300
613069*                                                               * 00304400
613070* THIS PARAGRAPH CONTAINS SAMPLE CODE WHICH MAY BE USED TO CALL * 00304500
613071* THE "HS2PCHKD" ROUTINE.  YOU MAY REMOVE IT, AND COPYBOOK      * 00304600
613072* CHKDATA, IF YOU ARE NOT USING "HCHKDATA."                     * 00304700
613073*                                                               * 00304800
613074*  PLEASE BE ADVISED 'HS2PCHKD' PASSES BACK A RETURN CODE       * 00304900
613075*  TO INDICATE A DEADLOCK CONDITION.  THE APPLICATION MUST      * 00305000
613076*  PROVIDE FOR THIS RETURN CODE FOLLOWING THE CALL BELOW.       * 00305100
613077*  AN '88' LEVEL 'CHKDATA-DEADLOCK-OCCURRED' HAS BEEN PROVIDED  * 00305200
613078*  IN COPYBOOK CHKDATA FOR THIS RETURN CODE.                    * 00305300
613079***************************************************************** 00305400
613080*                                                                 00305500
613081     MOVE SPACES TO CHECK-DATA-PARM.                              00305600
613082***                                                               00305700
613083***  SET THE FOLLOWING FIELDS:                                    00305800
613084***                                                               00305900
613085***     REGION    --  SET TO THE REGION OF THE REQUESTING USER    00306000
613086***     DEPT-ID   --  SET TO THE DEPARTMENT ID OF THE REQUESTING  00306100
613087***                       USER                                    00306200
613088***     USER-ID   --  SET TO THE USER ID OF THE REQUESTING USER   00306300
613089***     CHKDATA-ELEMENT-ID -- ELEMENT ID TO BE CHECKED (NUMBER)   00306400
613090***     CHKDATA-ELEMENT-VALUE -- ELEMENT VALUE TO BE CHECKED      00306500
613091***     CHKDATA-ELEMENT-ACCESS -- 'I' FOR INQUIRY OR              00306600
613092***                               'U' FOR UPDATE                  00306700
613093***                                                               00306800
613094     CALL "HS2PCHKD"  USING  CHECK-DATA-PARM                      00306900
613095                             PCB-HSECURITY.                       00307000
613096                                                                  00307100
613097     IF CHKDATA-USER-AUTHORIZED                                   00307200
613098         NEXT SENTENCE                                            00307300
613099     ELSE                                                         00307400
613100***  IF CHKDATA-USER-NOT-AUTHORIZED                               00307500
613101***      SETUP ERROR PROCESSING                                   00307600
613102***  ELSE                                                         00307700
613103         MOVE LIT-8300A                 TO HE-PARAGRAPH           00307800
613104         SET WS-ABEND-IMS-ERROR         TO TRUE                   00307900
613105         MOVE PCB-HSECUR-STATUS-CODE    TO HE-STATUS              00308000
613106         MOVE PCB-HSECUR-SEG-LEVEL      TO HE-LEVEL               00308100
613107         MOVE SPACES                    TO HE-SSA1 HE-SSA2 HE-SSA300308200
613108                                           HE-SSA4 HE-SSA5        00308300
613109         MOVE LIT-HS2PCHKD              TO WS-SUB-NAME            00308400
613110         MOVE WS-SUBROUTINE-ABEND       TO HE-MSG1.               00308500
613111         STRING "RETURN CODE= ", CHKDATA-RETURN-SWITCH            00308600
613112                DELIMITED BY SIZE INTO HE-MSG2                    00308700
613113         PERFORM 9990H-ABNORMAL-END-OF-JOB THRU                   00308800
613114                 9990H-EXIT.                                      00308900
613115                                                                  00309000
613116 8300A-EXIT.                                                      00309100
613117     EXIT.                                                        00309200
613118                                                                  00309300
613119     EJECT                                                        00309400
613120     COPY  ABENDBAT.                                              00309500
613121                                                                  00309600
613122     EJECT                                                        00309700
613123 9995A-APPL-ABORT-PROCESS.                                        00309800
613124***                                                               00309900
613125***  ON ENTRY TO THIS PARAGRAPH, THE ABORT MESSAGE HAS BEEN       00310000
613126***  FORMATTED IN HARDCOPY-ERROR.  THE SHELL HAS TRIED TO GET     00310100
613127***  THE WS-PROD-SUPP-LTERM AND WS-SEC-COORD-LTERM FROM THE       00310200
613128***  TABLES DATA BASE IF THE FIELDS WERE BLANK.                   00310300
613129***                                                               00310400
613130***  IN THIS PARAGRAPH, YOU MAY SEND THE ABORT MESSAGE VIA        00310500
613131***  THE MAIL SUBSYSTEM INSTEAD OF THROUGH IMS.  YOU MAY          00310600
613132***  ALSO SEND THE MESSAGE ANY WAY YOU LIKE TO DESTINATIONS       00310700
613133***  IN ADDITION TO THE SUPPORT AGENCY OR SECTION COORDINATOR.    00310800
613134***                                                               00310900
613135***  BEFORE LEAVING, MOVE SPACES TO WS-PROD-SUPP-LTERM AND/OR     00311000
613136***  WS-SEC-COORD-LTERM TO SUPPRESS THEIR USE TO RECEIVE THE      00311100
613137***  HARDCOPY MESSAGE, OR REPLACE THEM WITH NON-BLANK VALUES      00311200
613138***  TO ESTABLISH DIFFERENT LTERMS.                               00311300
613139***                                                               00311400
613140***  FOR TESTING PURPOSES, SPACES ARE MOVED TO "WS-SEC-COORD-     00311500
613141***  LTERM" TO SUPPRESS PRINTING OF ABEND MESSAGES TO FORD'S      00311600
613142***  ABEND PRINTER.  AS LONG AS DBUG IS ON THE ABORT MESSAGE      00311700
613143***  WILL NOT PRINT AT FORD.                                      00311800
613144***                                                               00311900
613145*    MOVE SPACES  TO  WS-SEC-COORD-LTERM                          00312000
613146*    MOVE LIT-YES TO  SW-FATAL-ERROR-PRT                          00312100
613147     CONTINUE                                                     00312200
613148     .                                                            00312300
613149 9995A-EXIT.                                                      00312400
613150     EXIT.                                                        00312500
613151 9998M-SETUP-DB2-ABEND.                                           00312600
613152                                                                  00312700
613153     SET WS-ABEND-SQL-ERROR       TO TRUE                         00312800
613154     MOVE SQLCODE                 TO HE-SQL-RETURN-CODE           00312900
613155     MOVE SQLWARN                 TO HE-SQL-WARNING               00313000
613156     MOVE SQLERRMC                TO HE-SQL-ERROR-MESSAGE         00313100
613157     MOVE LIT-BAD-DB2-CALL        TO HE-MSG1                      00313200
613158                                                                  00313300
613159     CALL DSNTIAR  USING SQLCA                                    00313400
613160                    SQLERR-MESSAGE-AREA                           00313500
613161                    SQLERR-TEXT-LENGTH                            00313600
613162                                                                  00313700
613163     MOVE SQLERR-LINE-1           TO HE-SQL-MSG1                  00313800
613164     MOVE SQLERR-LINE-2           TO HE-SQL-MSG2                  00313900
613165     MOVE SQLERR-LINE-3           TO HE-SQL-MSG3                  00314000
613166     MOVE SQLERR-LINE-4           TO HE-SQL-MSG4                  00314100
613167     PERFORM 9990H-ABNORMAL-END-OF-JOB                            00314200
613168     .                                                            00314300
613169*                                                                 00314400
613170********************                                              00314500
613171** END OF PROGRAM **                                              00314600
613172********************                                              00314700
613173*NUAD BEGIN
613174*
613175
613176 G00-GET-CURRENT-TIMESTAMP.
613177     EXEC SQL
613178       SELECT CURRENT TIMESTAMP
613179       INTO   :WS-CURRENT-TIMESTAMP
613180       FROM SYSIBM.SYSDUMMY1
613181     END-EXEC
613182     EVALUATE SQLCODE
613183        WHEN +000
613184             CONTINUE
613185        WHEN OTHER
613186             SET ERROR-FOUND TO TRUE
613187             MOVE "G00-GET-CURRENT-TIMESTAMP" TO ERR-PARA
613188             MOVE "SELECT TIMESTAMP ERROR"    TO ERR-MSG-LINE1
613189             GO TO S00-STOP-PROCESS
613190     END-EVALUATE
613191     .
613192
613193 L00-LOAD-ARRAY-FROM-FILE.
613194*OPEN FILE, GET TOTAL RECORDS COUNT FROM FILE(FOR DYNAMIC ARRAY),
613195*CLOSE FILE
613196     PERFORM 5400M-OPEN-INPUT-FILE
613197
613198*--GET INPUT FILE REC COUNT. IF # OF RECS > ARRAYSIZE, THEN ABEND.
613199     INITIALIZE WS-INP-FILE-REC-COUNT
613200     SET WS-NOT-EOF             TO TRUE
613201     PERFORM UNTIL WS-EOF
613202
613203       IF WS-INP-FILE-REC-COUNT > 200000
613204          SET WS-ABEND-NON-DBMS-ERROR  TO  TRUE
613205          MOVE "L00-"                  TO  HE-PARAGRAPH
613206          MOVE MSG-FILE-ARRAY-OVERFLOW TO  HE-MSG1
613207          PERFORM 9990H-ABNORMAL-END-OF-JOB
613208       END-IF
613209
613210       PERFORM L000A-READ-INPUT-RECORD
613211
613212     END-PERFORM
613213*--
613214
613215     PERFORM 5800M-CLOSE-INPUT-FILE
613216
613217*OPEN FILE, LOAD ALL INP FILE RECORDS TO ARRAY, CLOSE FILE
613218     PERFORM 5400M-OPEN-INPUT-FILE
613219
613220     SET WS-IN TO 1
613221     SET WS-NOT-EOF-END-AR-LOAD TO TRUE
613222     PERFORM UNTIL WS-EOF-END-AR-LOAD
613223       PERFORM L005A-LOAD-ARRAY
613224       SET WS-IN UP BY 1
613225     END-PERFORM
613226
613227     PERFORM 5800M-CLOSE-INPUT-FILE
613229     .
613230 T00-TIME-TRACK.
613240     INITIALIZE WS-CURRENT-TIMESTAMP2
613241     EXEC SQL
613242       SELECT CURRENT TIMESTAMP
613243       INTO   :WS-CURRENT-TIMESTAMP2
613244       FROM SYSIBM.SYSDUMMY1
613245     END-EXEC
613246     EVALUATE SQLCODE
613247        WHEN +000
613248             CONTINUE
613249        WHEN OTHER
613250             SET ERROR-FOUND TO TRUE
613251             MOVE "T00-TIME-TRACK"            TO ERR-PARA
613252             MOVE "SELECT TIMESTAMP ERROR"    TO ERR-MSG-LINE1
613253             GO TO S00-STOP-PROCESS
613254     END-EVALUATE
613255     .
613256
613257 P00-PROCESS-RECORD.
613258
613259     PERFORM T00-TIME-TRACK
613260     ADD 1 TO WS-INFILE-RECORDS
613261*-----------------------------------------------------------------
613262     INITIALIZE WS-PGM-MSG
613263     STRING "|"                   DELIMITED BY SIZE
613264            WS-CURRENT-TIMESTAMP2 DELIMITED BY SIZE
613266            "|STARTING TO PROCESS RECORD-"
613267                                  DELIMITED BY SIZE
613268            WS-INFILE-RECORDS     DELIMITED BY SIZE
613269            "|"                   DELIMITED BY SIZE
613270            FI-PCCJ-ROW-KEY-N(1:36) DELIMITED BY SIZE
613271            "|"                   DELIMITED BY SIZE
613272     INTO   WS-PGM-MSG
613273     END-STRING
613274     DISPLAY WS-PGM-MSG
613275
613276     INITIALIZE WS-INPUT-RECORD-TYPE
613277                WS-REGION
613278                WS-REGION-EXT
613279*
613280     SET GOOD-RECORD TO TRUE
613281     PERFORM V00-VALIDATION
613282*
613283     IF FI-PCER-ACTN-C   =  'C'
613284        AND FI-PCER-ATTR-N   = "SPRP_REPL_PRT_REG"
613285            SET CHANGE-CJ-INPUT TO TRUE
613286     ELSE IF FI-PCER-ACTN-C = 'D'
613287             AND FI-PCER-ATTR-N = SPACES
613288                 SET DELETE-CJ-INPUT TO TRUE
613289          END-IF
613290     END-IF
613291*
613292     MOVE FI-PCCJ-ROW-KEY-N   TO WS-CHG-E52E53-INDEX
613293*
613294     IF CHANGE-CJ-INPUT
613295        IF FI-PCCJ-OLD-ATTR-D(1:1) = 'A' AND
613296           FI-PCCJ-NEW-ATTR-D(1:1) = ' '
613297           MOVE 'A'     TO WS-REGION
613298           MOVE 'A%%%%' TO WS-REGION-EXT
613299           PERFORM P01-VALIDATE-AND-PROCESS
613300        END-IF
613301        IF FI-PCCJ-OLD-ATTR-D(3:1) = 'N' AND
613302           FI-PCCJ-NEW-ATTR-D(3:1) = ' '
613303           MOVE 'N'     TO WS-REGION
613304           MOVE '%%N%%' TO WS-REGION-EXT
613305           PERFORM P01-VALIDATE-AND-PROCESS
613306        END-IF
613307        IF FI-PCCJ-OLD-ATTR-D(4:1) = 'S' AND
613308           FI-PCCJ-NEW-ATTR-D(4:1) = ' '
613309           MOVE 'S'     TO WS-REGION
613310           MOVE '%%%S%' TO WS-REGION-EXT
613311           PERFORM P01-VALIDATE-AND-PROCESS
613312        END-IF
613313     END-IF
613314
613315     IF DELETE-CJ-INPUT
613316        IF WS-CHG23-REPL-REGION(1:1) = 'A'
613317           MOVE 'A'     TO WS-REGION
613318           MOVE 'A%%%%' TO WS-REGION-EXT
613319           PERFORM P01-VALIDATE-AND-PROCESS
613320        END-IF
613321        IF WS-CHG23-REPL-REGION(3:1) = 'N'
613322           MOVE 'N'     TO WS-REGION
613323           MOVE '%%N%%' TO WS-REGION-EXT
613324           PERFORM P01-VALIDATE-AND-PROCESS
613325        END-IF
613326        IF WS-CHG23-REPL-REGION(4:1) = 'S'
613327           MOVE 'S'     TO WS-REGION
613328           MOVE '%%%S%' TO WS-REGION-EXT
613329           PERFORM P01-VALIDATE-AND-PROCESS
613330        END-IF
613331     END-IF
613332     .
613333
613334 P01-VALIDATE-AND-PROCESS.
613335
613336     SET GOOD-RECORD2 TO TRUE
613337     PERFORM V01-VALIDATION1
613338
613339     IF GOOD-RECORD AND GOOD-RECORD2
613340* CHECK REPL CHAIN USING CURR E53 TABLE (EXCLUDING INP FILE)
613341        PERFORM R00-REPLACEMENT-CHAIN-CHECK
613342* CHECK REPL CHAIN USING INPUT FILE
613343        PERFORM RF0-REPL-CHAIN-CHECK-INP-FILE
613344* CHECK REPL TYPE USING E53 TABLE
613345        PERFORM R01-REPLACEMENT-TYPE-CHECK
613346*
613347        INITIALIZE WS-USAGE-ARRAY-FLAG
613348*
613349        IF FIRST-IN-REP-CHAIN OR FIRST-IN-REP-CHAIN-F OR
613350           MID-IN-REP-CHAIN   OR MID-IN-REP-CHAIN-F
613351           PERFORM Z02-REPCHAIN-FIRST-F
613352        ELSE
613353*       (NOT-IN-REP-CHAIN   OR LAST-IN-REP-CHAIN   OR
613354*        NOT-IN-REP-CHAIN-F OR LAST-IN-REP-CHAIN-F)
613355           PERFORM Z01-REPCHAIN-NOT-OR-LAST
613356        END-IF
613357     END-IF
613358     .
613359
613360 Z01-REPCHAIN-NOT-OR-LAST.
613361*SET KEY FOR GETTING LINKED EPN USAGE FOR OLDPART
613362     MOVE WS-CHG23-BASE   TO WS-OLDP-BASE
613363     MOVE WS-CHG23-PREFIX TO WS-OLDP-PREFIX
613364     MOVE WS-CHG23-SUFFIX TO WS-OLDP-SUFFIX
613365
613366     PERFORM P10-GET-LINKED-EPNS-COUNT-OLDP
613367     PERFORM P20-GET-EPNS-AND-LOAD-USG-OLDP
613368
613369*
613370     IF WS-USAGE-ARRAY-OVERFLOW
613371        NEXT SENTENCE
613372     END-IF
613373*
613374
613375*SET KEY FOR DELETING NUAD USAGES FROM NEW PART
613376     MOVE WS-CHG23-REPL-BASE   TO WS-NEWP-BASE
613377     MOVE WS-CHG23-REPL-PREFIX TO WS-NEWP-PREFIX
613378     MOVE WS-CHG23-REPL-SUFFIX TO WS-NEWP-SUFFIX
613379
613380     PERFORM P30-GET-EPNS-AND-DEL-NUAD-NEWP
613381     .
613382
613383 Z02-REPCHAIN-FIRST-F.
613384*SET KEY FOR GETTING LINKED EPN USAGE FOR OLDPART
613385*NORMAL 1:1 DELETE PROCESS BEGINS
613386     MOVE WS-CHG23-BASE   TO WS-OLDP-BASE
613387     MOVE WS-CHG23-PREFIX TO WS-OLDP-PREFIX
613388     MOVE WS-CHG23-SUFFIX TO WS-OLDP-SUFFIX
613389
613390     PERFORM P10-GET-LINKED-EPNS-COUNT-OLDP
613391     PERFORM P20-GET-EPNS-AND-LOAD-USG-OLDP
613392
613393*
613394     IF WS-USAGE-ARRAY-OVERFLOW
613395        NEXT SENTENCE
613396     END-IF
613397*
613398*TRAVERSE NEXT LEVELS & DEL NUAD USAGES IN EACH LEVEL OF RPLCMNT
613399*DEL FROM INTIAL/1ST LEVEL ALONE (NORMAL PROCESS)
613400     MOVE WS-CHG23-REPL-BASE   TO WS-NEWP-BASE
613401     MOVE WS-CHG23-REPL-PREFIX TO WS-NEWP-PREFIX
613402     MOVE WS-CHG23-REPL-SUFFIX TO WS-NEWP-SUFFIX
613403
613404* ARRAY REFRESH STARTS-FOR FIRST & MID CHAINS ONLY
613405     INITIALIZE WS-LEVEL-SWITCH
613406     SET LEVEL-1-ON TO TRUE
613407     SET WS-SUB22 TO 1
613408* ARRAY REFRESH ENDS
613409
613410     PERFORM P30-GET-EPNS-AND-DEL-NUAD-NEWP
613411
613412* NUAD USAGES SAVE FINISHED - BEGIN
613413     SET LEVEL-OFF TO TRUE
613414* NUAD USAGES SAVE FINISHED - END
613415
613416*NORMAL 1:1 DELETE PROCESS ENDS
613417
613418*DEL FROM NEXT LEVELS
613419
613420*DEL FROM NEXT LEVELS USING 2 ARRAYS AND INTERCHANGING DATA
613421*WITHIN THE 2 ARRAYS
613422
613423*DELETE & THEN LOAD CHAIN ELEMENTS IN ARRAY 1 - PROCESS BEGINS
613424     INITIALIZE WS-PART-KEY
613425     MOVE WS-CHG23-REPL-BASE   TO WS-KEY-BASE
613426     MOVE WS-CHG23-REPL-PREFIX TO WS-KEY-PREFIX
613427     MOVE WS-CHG23-REPL-SUFFIX TO WS-KEY-SUFFIX
613428     EXEC SQL
613429       OPEN REP-FIRST
613430     END-EXEC
613431     EVALUATE SQLCODE
613432        WHEN +000
613433             CONTINUE
613434        WHEN OTHER
613435             SET ERROR-FOUND TO TRUE
613436             MOVE "Z02-REPCHAIN-FIRST-F"      TO ERR-PARA
613437             MOVE "REP-FIRST OPEN ERROR"      TO ERR-MSG-LINE1
613438             GO TO S00-STOP-PROCESS
613439     END-EVALUATE
613440
613441     INITIALIZE WS-AR1-TABLE
613442     SET WS-AR1-SUB TO 1
613443     MOVE 1 TO WS-AR1-SUB-COUNT
613444
613445*ARRAY REFRESH & NUAD USAGES SAVE - BEGIN
613446     PERFORM R00-REFRESH-ARRAY1
613447
613448     SET LEVEL-2-ON TO TRUE
613449     SET WS-SUB22 TO 1
613450*ARRAY REFRESH & NUAD USAGES SAVE - END
613451
613452*FILE CHECK BEGINS
613453*&DEL-FILECHK BEGINS
613454*&   SET WS-IN TO 1
613455*&   SEARCH WS-INP-FILE-ARRAY VARYING WS-IN
613456*&     AT END
613457*&       CONTINUE
613458*&     WHEN IN-CHG23-BASE(WS-IN)   = WS-KEY-BASE   AND
613459*&          IN-CHG23-PREFIX(WS-IN) = WS-KEY-PREFIX AND
613460*&          IN-CHG23-SUFFIX(WS-IN) = WS-KEY-SUFFIX
613461*&       MOVE IN-CHG23-REPL-BASE(WS-IN)
613462*&                             TO WS-AR1-BASE(WS-AR1-SUB)
613463*&       MOVE IN-CHG23-REPL-PREFIX(WS-IN)
613464*&                             TO WS-AR1-PREFIX(WS-AR1-SUB)
613465*&       MOVE IN-CHG23-REPL-SUFFIX(WS-IN)
613466*&                             TO WS-AR1-SUFFIX(WS-AR1-SUB)
613467*&       SET WS-AR1-SUB UP BY 1
613468*&       ADD 1 TO WS-AR1-SUB-COUNT
613469*&
613470*&       MOVE IN-CHG23-REPL-BASE(WS-IN)
613471*&                               TO WS-NEWP-BASE
613472*&       MOVE IN-CHG23-REPL-PREFIX(WS-IN)
613473*&                               TO WS-NEWP-PREFIX
613474*&       MOVE IN-CHG23-REPL-SUFFIX(WS-IN)
613475*&                               TO WS-NEWP-SUFFIX
613476*&
613477*&
613478*&       PERFORM P30-GET-EPNS-AND-DEL-NUAD-NEWP
613479*&
613480*&   END-SEARCH
613481*FILE CHECK ENDS
613482*TABLE CHECK BEGINS
613483     INITIALIZE SQLCODE
613484     PERFORM UNTIL SQLCODE = +100
613485       INITIALIZE SMMPE53
613486       EXEC SQL
613487         FETCH REP-FIRST
613488         INTO      :SMMPE53.SBASEPRT-REPLCNG-R
613489                  ,:SMMPE53.SPRFXPRT-REPLCNG-R
613490                  ,:SMMPE53.SUFXPRT-REPLCNG-R
613491       END-EXEC
613492       EVALUATE SQLCODE
613493          WHEN +000
613494               MOVE SBASEPRT-REPLCNG-R OF SMMPE53
613495                            TO WS-AR1-BASE(WS-AR1-SUB)
613496               MOVE SPRFXPRT-REPLCNG-R OF SMMPE53
613497                            TO WS-AR1-PREFIX(WS-AR1-SUB)
613498               MOVE SUFXPRT-REPLCNG-R  OF SMMPE53
613499                            TO WS-AR1-SUFFIX(WS-AR1-SUB)
613500
613501               SET WS-AR1-SUB UP BY 1
613502               ADD 1 TO WS-AR1-SUB-COUNT
613503
613504               MOVE SBASEPRT-REPLCNG-R OF SMMPE53
613505                                       TO WS-NEWP-BASE
613506               MOVE SPRFXPRT-REPLCNG-R OF SMMPE53
613507                                       TO WS-NEWP-PREFIX
613508               MOVE SUFXPRT-REPLCNG-R  OF SMMPE53
613509                                       TO WS-NEWP-SUFFIX
613510
613511               PERFORM P30-GET-EPNS-AND-DEL-NUAD-NEWP
613512
613513          WHEN +100
613514               CONTINUE
613515          WHEN OTHER
613516               SET ERROR-FOUND TO TRUE
613517               MOVE "Z02-REPCHAIN-FIRST-F"      TO ERR-PARA
613518               MOVE "REP-FIRST FETCH ERROR"     TO ERR-MSG-LINE1
613519               GO TO S00-STOP-PROCESS
613520       END-EVALUATE
613521     END-PERFORM
613522     EXEC SQL
613523       CLOSE REP-FIRST
613524     END-EXEC
613525     EVALUATE SQLCODE
613526        WHEN +000
613527             CONTINUE
613528        WHEN OTHER
613529             SET ERROR-FOUND TO TRUE
613530             MOVE "Z02-REPCHAIN-FIRST-F"      TO ERR-PARA
613531             MOVE "REP-FIRST CLOSE ERROR"     TO ERR-MSG-LINE1
613532             GO TO S00-STOP-PROCESS
613533     END-EVALUATE
613534
613535*SWITCH OFF - SAVED ALL DELETED NUAD FROM 2ND LEVEL GSPNS IN TREE.
613536* NUAD USAGES SAVE FINISHED - BEGIN
613537     SET LEVEL-OFF TO TRUE
613538* NUAD USAGES SAVE FINISHED - END
613539
613540*1ST NEXT LEVEL TABLE CHECK ENDS
613541
613542*LOAD ARRAY 2 AND PROCESS UNTIL END OF CHAIN
613543
613544     INITIALIZE WS-AR2-DATA-FLAG
613545                WS-AR2-SUB-COUNT
613546
613547*INITIALIZE ARRAY2 BEFORE LOOPING
613548     INITIALIZE WS-AR2-TABLE
613549     SET WS-AR2-SUB TO 1
613550     MOVE 1 TO WS-AR2-SUB-COUNT
613551
613552     PERFORM UNTIL NO-DATA-IN-AR2
613553
613554
613555*      LOAD ARRAY 1 WITH ARRAY 2 DATA-BEGIN,AND INITIALIZE AR2 TBL
613556       IF NO-DATA-IN-AR1
613579*US6670580 CHANGES BEGIN
613580          INITIALIZE WS-AR1-TABLE
613581*US6670580 CHANGES END
613582          MOVE 1 TO WS-I
613583          INITIALIZE WS-AR1-LOAD-FLAG
613584          PERFORM UNTIL END-OF-AR1-LOAD
613585            MOVE WS-AR2-PREFIX(WS-I) TO WS-AR1-PREFIX(WS-I)
613586            MOVE WS-AR2-BASE(WS-I)   TO WS-AR1-BASE(WS-I)
613587            MOVE WS-AR2-SUFFIX(WS-I) TO WS-AR1-SUFFIX(WS-I)
613588            ADD  1 TO WS-I
613589            IF WS-AR2-PREFIX(WS-I) = SPACES AND
613590               WS-AR2-BASE(WS-I)   = SPACES AND
613591               WS-AR2-SUFFIX(WS-I) = SPACES
613592               SET END-OF-AR1-LOAD TO TRUE
613593            END-IF
613594          END-PERFORM
613595          INITIALIZE WS-AR1-DATA-FLAG
613596*
613597          INITIALIZE WS-AR2-TABLE
613598          SET WS-AR2-SUB TO 1
613599          MOVE 1 TO WS-AR2-SUB-COUNT
613600*
613601       END-IF
613602*      LOAD ARRAY 1 WITH ARRAY 2 DATA-END
613603
613604*US6670580 CHANGES BEGIN
613605*MOVED BELOW 2 LINES AND THE REFRESH PROCESS
613606*FROM INSIDE TO OUT OF THE BELOW 'NO-DATA-IN-AR1' LOOP
613607         SET WS-AR1-SUB TO 1
613608         MOVE 1 TO WS-AR1-SUB-COUNT
613609
613610*ARRAY REFRESH & NUAD USAGES SAVE - BEGIN
613611         PERFORM R00-REFRESH-ARRAY1
613612
613613         SET LEVEL-X-ON TO TRUE
613614         SET WS-SUB22 TO 1
613615*ARRAY REFRESH & NUAD USAGES SAVE - END
613616*US6670580 CHANGES END
613617
613618       PERFORM UNTIL NO-DATA-IN-AR1
613619
613620         INITIALIZE WS-PART-KEY
613621         MOVE WS-AR1-PREFIX(WS-AR1-SUB) TO WS-KEY-PREFIX
613622         MOVE WS-AR1-BASE(WS-AR1-SUB)   TO WS-KEY-BASE
613623         MOVE WS-AR1-SUFFIX(WS-AR1-SUB) TO WS-KEY-SUFFIX
613624
613625*FILE CHECK BEGINS
613626*&DEL-FILECHK BEGINS
613627*&       SET WS-IN TO 1
613628*&       SEARCH WS-INP-FILE-ARRAY VARYING WS-IN
613629*&         AT END
613630*&           CONTINUE
613631*&         WHEN IN-CHG23-BASE(WS-IN)   = WS-KEY-BASE   AND
613632*&              IN-CHG23-PREFIX(WS-IN) = WS-KEY-PREFIX AND
613633*&              IN-CHG23-SUFFIX(WS-IN) = WS-KEY-SUFFIX
613634*&           MOVE IN-CHG23-REPL-BASE(WS-IN)
613635*&                                 TO WS-AR2-BASE(WS-AR2-SUB)
613636*&           MOVE IN-CHG23-REPL-PREFIX(WS-IN)
613637*&                                 TO WS-AR2-PREFIX(WS-AR2-SUB)
613638*&           MOVE IN-CHG23-REPL-SUFFIX(WS-IN)
613639*&                                 TO WS-AR2-SUFFIX(WS-AR2-SUB)
613640*&           SET WS-AR2-SUB UP BY 1
613641*&           ADD 1 TO WS-AR2-SUB-COUNT
613642*&
613643*&           MOVE IN-CHG23-REPL-BASE(WS-IN)
613644*&                                   TO WS-NEWP-BASE
613645*&           MOVE IN-CHG23-REPL-PREFIX(WS-IN)
613646*&                                   TO WS-NEWP-PREFIX
613647*&           MOVE IN-CHG23-REPL-SUFFIX(WS-IN)
613648*&                                   TO WS-NEWP-SUFFIX
613649*&
613650*&           PERFORM P30-GET-EPNS-AND-DEL-NUAD-NEWP
613651*&
613652*&       END-SEARCH
613653*&DEL-FILECHK ENDS
613654*FILE CHECK ENDS
613655         EXEC SQL
613656           OPEN REP-FIRST
613657         END-EXEC
613658         EVALUATE SQLCODE
613659            WHEN +000
613660                 CONTINUE
613661            WHEN OTHER
613662                 SET ERROR-FOUND TO TRUE
613663                 MOVE "Z02-REPCHAIN-FIRST-F"      TO ERR-PARA
613664                 MOVE "REP-FIRST OPEN ERROR-2"    TO ERR-MSG-LINE1
613665                 GO TO S00-STOP-PROCESS
613666         END-EVALUATE
613667
613668         INITIALIZE SQLCODE
613669         PERFORM UNTIL SQLCODE = +100
613670           INITIALIZE SMMPE53
613671           EXEC SQL
613672             FETCH REP-FIRST
613673             INTO      :SMMPE53.SBASEPRT-REPLCNG-R
613674                      ,:SMMPE53.SPRFXPRT-REPLCNG-R
613675                      ,:SMMPE53.SUFXPRT-REPLCNG-R
613676           END-EXEC
613677           EVALUATE SQLCODE
613678              WHEN +000
613679                   MOVE SBASEPRT-REPLCNG-R OF SMMPE53
613680                                TO WS-AR2-BASE(WS-AR2-SUB)
613681                   MOVE SPRFXPRT-REPLCNG-R OF SMMPE53
613682                                TO WS-AR2-PREFIX(WS-AR2-SUB)
613683                   MOVE SUFXPRT-REPLCNG-R  OF SMMPE53
613684                                TO WS-AR2-SUFFIX(WS-AR2-SUB)
613685
613686                   SET WS-AR2-SUB UP BY 1
613687                   ADD 1 TO WS-AR2-SUB-COUNT
613688
613689                   MOVE SBASEPRT-REPLCNG-R OF SMMPE53
613690                                           TO WS-NEWP-BASE
613691                   MOVE SPRFXPRT-REPLCNG-R OF SMMPE53
613692                                           TO WS-NEWP-PREFIX
613693                   MOVE SUFXPRT-REPLCNG-R  OF SMMPE53
613694                                           TO WS-NEWP-SUFFIX
613695
613696                   PERFORM P30-GET-EPNS-AND-DEL-NUAD-NEWP
613697
613698              WHEN +100
613699                   CONTINUE
613700              WHEN OTHER
613701                   SET ERROR-FOUND TO TRUE
613702                   MOVE "Z02-REPCHAIN-FIRST-F"    TO ERR-PARA
613703                   MOVE "REP-FIRST FETCH ERROR-2" TO ERR-MSG-LINE1
613704                   GO TO S00-STOP-PROCESS
613705           END-EVALUATE
613706         END-PERFORM
613707         EXEC SQL
613708           CLOSE REP-FIRST
613709         END-EXEC
613710         EVALUATE SQLCODE
613711            WHEN +000
613712                 CONTINUE
613713            WHEN OTHER
613714                 SET ERROR-FOUND TO TRUE
613715                 MOVE "Z02-REPCHAIN-FIRST-F"      TO ERR-PARA
613716                 MOVE "REP-FIRST CLOSE ERROR-2"   TO ERR-MSG-LINE1
613717                 GO TO S00-STOP-PROCESS
613718         END-EVALUATE
613719
613720         SET WS-AR1-SUB UP BY 1
613721         ADD 1 TO WS-AR1-SUB-COUNT
613722
613723         IF WS-AR1-PREFIX(WS-AR1-SUB) = SPACES AND
613724            WS-AR1-BASE(WS-AR1-SUB)   = SPACES AND
613725            WS-AR1-SUFFIX(WS-AR1-SUB) = SPACES
613726            SET NO-DATA-IN-AR1 TO TRUE
613727* NUAD USAGES SAVE FINISHED - BEGIN
613728            SET LEVEL-OFF TO TRUE
613729* NUAD USAGES SAVE FINISHED - END
613730         END-IF
613731
613732       END-PERFORM
613733
613734       IF WS-AR2-PREFIX(1) = SPACES AND
613735          WS-AR2-BASE(1)   = SPACES AND
613736          WS-AR2-SUFFIX(1) = SPACES
613737          SET NO-DATA-IN-AR2 TO TRUE
613738       END-IF
613739
613740     END-PERFORM
613741     .
613742
613743 R00-REFRESH-ARRAY1.
613744
613745*INITIALIZE ARRAY1 - COMPLETELY
613746     SET WS-SUB TO 1
613747     PERFORM VARYING WS-SUB FROM 1 BY 1
613748       UNTIL (WS-SUB = WS-MAX-USAGES)
613749
613750       INITIALIZE             WS-USAGE-ARRAY(WS-SUB)
613751
613752     END-PERFORM
613753
613754*INITIALIZE ARRAY1 - UNTIL RECORDS IN ARRAY2
613755     SET WS-SUB TO 1
613756     PERFORM VARYING WS-SUB FROM 1 BY 1
613757       UNTIL ((WS-ENGP-ENGNRG-PART-R2(WS-SUB) = SPACES) AND
613758              (WS-EIO-ORIGIN-C2(WS-SUB)       = SPACES) AND
613759              (WS-ENGP-SEQ-R2(WS-SUB)         = ZEROES))
613760
613761       INITIALIZE             WS-USAGE-ARRAY(WS-SUB)
613762
613763     END-PERFORM
613764
613765*LOAD ARRAY2 DATA TO ARRAY1
613766     SET WS-SUB22 TO 1
613767     PERFORM VARYING WS-SUB22 FROM 1 BY 1
613768       UNTIL ((WS-ENGP-ENGNRG-PART-R2(WS-SUB22) = SPACES) AND
613769              (WS-EIO-ORIGIN-C2(WS-SUB22)       = SPACES) AND
613770              (WS-ENGP-SEQ-R2(WS-SUB22)         = ZEROES))
613771       MOVE WS-USAGE-ARRAY2(WS-SUB22)
613772                           TO WS-USAGE-ARRAY(WS-SUB22)
613773     END-PERFORM
613774     .
613775
613776 V00-VALIDATION.
613777     INITIALIZE ERR-MSG-LINE1
613778                ERR-MSG-LINE2
613779*VALIDATION-1
613780     IF FI-PCER-PGM-ID-R   = "PA00674D"
613781        CONTINUE
613782     ELSE
613783        SET BAD-RECORD TO TRUE
613784*
613785        STRING "WRONG 'FI-PCER-PGM-ID-R'-" DELIMITED BY SIZE
613786               FI-PCER-PGM-ID-R         DELIMITED BY SIZE
613787        INTO   ERR-MSG-LINE1
613788        END-STRING
613789
613790        STRING "REC #-"                 DELIMITED BY SIZE
613791               WS-INFILE-RECORDS        DELIMITED BY SIZE
613792        INTO   ERR-MSG-LINE2
613793        END-STRING
613794*
613795        ADD +1 TO WS-ERROR-CNT
613796        MOVE ERR-MSG-LINE2          TO DET-LN-RECINFO
613797        MOVE ERR-MSG-LINE1          TO DET-LN-ERROR-MSG
613798        MOVE FI-PCCJ-ROW-KEY-N      TO DET-LN-INPROWKEY
613799        PERFORM 5700M-WRITE-ERROR
613800*
613801     END-IF
613802
613803*VALIDATION-2
613804     IF GOOD-RECORD
613805     IF FI-PCER-TBL-N      = "SMMPE53_REP_SVPT_G"
613806        CONTINUE
613807     ELSE
613808        SET BAD-RECORD TO TRUE
613809*
613810        STRING "WRONG 'FI-PCER-TBL-N'-" DELIMITED BY SIZE
613811               FI-PCER-TBL-N            DELIMITED BY SIZE
613812        INTO   ERR-MSG-LINE1
613813        END-STRING
613814
613815        STRING "REC #-"                 DELIMITED BY SIZE
613816               WS-INFILE-RECORDS        DELIMITED BY SIZE
613817        INTO   ERR-MSG-LINE2
613818        END-STRING
613819*
613820        ADD +1 TO WS-ERROR-CNT
613821        MOVE ERR-MSG-LINE2          TO DET-LN-RECINFO
613822        MOVE ERR-MSG-LINE1          TO DET-LN-ERROR-MSG
613823        MOVE FI-PCCJ-ROW-KEY-N      TO DET-LN-INPROWKEY
613824        PERFORM 5700M-WRITE-ERROR
613825*
613826     END-IF
613827     END-IF
613828
613829*VALIDATION-3
613830     IF GOOD-RECORD
613831     IF FI-PCER-ATTR-N     = "SPRP_REPL_PRT_REG" OR SPACES
613832        CONTINUE
613833     ELSE
613834        SET BAD-RECORD TO TRUE
613835*
613836        STRING "WRONG 'FI-PCER-ATTR-N'-" DELIMITED BY SIZE
613837               FI-PCER-ATTR-N            DELIMITED BY SIZE
613838        INTO   ERR-MSG-LINE1
613839        END-STRING
613840*
613841        STRING "REC #-"                 DELIMITED BY SIZE
613842               WS-INFILE-RECORDS        DELIMITED BY SIZE
613843        INTO   ERR-MSG-LINE2
613844        END-STRING
613845*
613846        ADD +1 TO WS-ERROR-CNT
613847        MOVE ERR-MSG-LINE2          TO DET-LN-RECINFO
613848        MOVE ERR-MSG-LINE1          TO DET-LN-ERROR-MSG
613849        MOVE FI-PCCJ-ROW-KEY-N      TO DET-LN-INPROWKEY
613850        PERFORM 5700M-WRITE-ERROR
613851*
613852     END-IF
613853     END-IF
613854
613855*VALIDATION-4
613856     IF GOOD-RECORD
613857     IF FI-PCER-ACTN-C     = 'D' OR
613858        FI-PCER-ACTN-C     = 'C'
613859        CONTINUE
613860     ELSE
613861        SET BAD-RECORD TO TRUE
613862*
613863        STRING "WRONG 'FI-PCER-ACTN-C'-" DELIMITED BY SIZE
613864               FI-PCER-ACTN-C            DELIMITED BY SIZE
613865        INTO   ERR-MSG-LINE1
613866        END-STRING
613867*
613868        STRING "REC #-"                 DELIMITED BY SIZE
613869               WS-INFILE-RECORDS        DELIMITED BY SIZE
613870        INTO   ERR-MSG-LINE2
613871        END-STRING
613872*
613873        ADD +1 TO WS-ERROR-CNT
613874        MOVE ERR-MSG-LINE2          TO DET-LN-RECINFO
613875        MOVE ERR-MSG-LINE1          TO DET-LN-ERROR-MSG
613876        MOVE FI-PCCJ-ROW-KEY-N      TO DET-LN-INPROWKEY
613877        PERFORM 5700M-WRITE-ERROR
613878*
613879     END-IF
613880     END-IF
613881     .
613882
613883 V01-VALIDATION1.
613884*VALIDATION-1 (IF SUPERSESSION PRESENT IN E53, SKIP THE RECORD)
613885     INITIALIZE WS-SUPERSESSION-PRESENT
613886     EXEC SQL
613887       SELECT    "Y"
613888       INTO      :WS-SUPERSESSION-PRESENT
613889       FROM       SMMPE53_REP_SVPT_G E53
613890       WHERE      E53.SBASEPRT_NBR       = :WS-CHG23-BASE
613891       AND        E53.SPRFXPRT_PREFIX_R  = :WS-CHG23-PREFIX
613892       AND        E53.SUFXPRT_SUFFIX_NBR = :WS-CHG23-SUFFIX
613893       AND        E53.SBASEPRT_REPLCNG_R = :WS-CHG23-REPL-BASE
613894       AND        E53.SPRFXPRT_REPLCNG_R = :WS-CHG23-REPL-PREFIX
613895       AND        E53.SUFXPRT_REPLCNG_R  = :WS-CHG23-REPL-SUFFIX
613896       AND        E53.SPRP_REPL_PRT_REG  LIKE :WS-REGION-EXT
613897      END-EXEC
613898     EVALUATE SQLCODE
613899       WHEN +000
613900         SET BAD-RECORD2 TO TRUE
613901         MOVE "RECORD SKIPPED/BYPASSED SINCE PRESENT IN E53"
613902              TO ERR-MSG-LINE1
613903*
613904         STRING "REC #-"                 DELIMITED BY SIZE
613905                WS-INFILE-RECORDS        DELIMITED BY SIZE
613906         INTO   ERR-MSG-LINE2
613907         END-STRING
613908*
613909         ADD +1 TO WS-ERROR-CNT
613910         MOVE ERR-MSG-LINE2          TO DET-LN-RECINFO
613911         MOVE ERR-MSG-LINE1          TO DET-LN-ERROR-MSG
613912         MOVE FI-PCCJ-ROW-KEY-N      TO DET-LN-INPROWKEY
613913         PERFORM 5700M-WRITE-ERROR
613914*
613915       WHEN +100
613916         CONTINUE
613917       WHEN OTHER
613918          SET ERROR-FOUND TO TRUE
613919          MOVE "V01-VALIDATION1"           TO ERR-PARA
613920          MOVE "E53 VALIDATION ERROR"      TO ERR-MSG-LINE1
613921          GO TO S00-STOP-PROCESS
613922     END-EVALUATE
613923     .
613924 R00-REPLACEMENT-CHAIN-CHECK.
613925*CHECK IF - OLD PART/NEW PART IS A PART OF A REPLACEMENT CHAIN?
613926     INITIALIZE WS-DUMMY
613927                WS-REP-CHAIN-PREV-LVL
613928*OLD PART IS A REPLACING PART IN E53 TABLE? IF YES,ITS A CHAIN
613929     EXEC SQL
613930       SELECT    "Y"
613931       INTO      :WS-DUMMY
613932       FROM       SMMPE53_REP_SVPT_G E53
613933       WHERE      E53.SBASEPRT_REPLCNG_R = :WS-CHG23-BASE
613934       AND        E53.SPRFXPRT_REPLCNG_R = :WS-CHG23-PREFIX
613935       AND        E53.SUFXPRT_REPLCNG_R  = :WS-CHG23-SUFFIX
613936       AND        E53.SPRP_REPL_PRT_REG  LIKE :WS-REGION-EXT
613937     END-EXEC
613938     EVALUATE SQLCODE
613939       WHEN +000
613940         SET PREV-LVL-EXIST    TO TRUE
613941       WHEN -811
613942         SET PREV-LVL-EXIST    TO TRUE
613943       WHEN +100
613944         CONTINUE
613945       WHEN OTHER
613946         SET ERROR-FOUND TO TRUE
613947         MOVE "R00-REPLACEMENT-CHAIN-CHECK" TO ERR-PARA
613948         MOVE "REP-CHAIN CHECK2"            TO ERR-MSG-LINE1
613949         GO TO S00-STOP-PROCESS
613950     END-EVALUATE
613951
613952*NEW PART IS A REPLACED PART IN E53 TABLE? IF YES,ITS A CHAIN
613953     INITIALIZE WS-DUMMY
613954                WS-REP-CHAIN-NEXT-LVL
613955     EXEC SQL
613956       SELECT    "Y"
613957       INTO      :WS-DUMMY
613958       FROM       SMMPE53_REP_SVPT_G E53
613959       WHERE      E53.SBASEPRT_NBR       = :WS-CHG23-REPL-BASE
613960       AND        E53.SPRFXPRT_PREFIX_R  =
613961                                         :WS-CHG23-REPL-PREFIX
613962       AND        E53.SUFXPRT_SUFFIX_NBR =
613963                                         :WS-CHG23-REPL-SUFFIX
613964       AND        E53.SPRP_REPL_PRT_REG  LIKE
613965                                      :WS-REGION-EXT
613966     END-EXEC
613967     EVALUATE SQLCODE
613968       WHEN +000
613969         SET NEXT-LVL-EXIST    TO TRUE
613970       WHEN -811
613971         SET NEXT-LVL-EXIST    TO TRUE
613972       WHEN +100
613973         CONTINUE
613974       WHEN OTHER
613975         SET ERROR-FOUND TO TRUE
613976         MOVE "R00-REPLACEMENT-CHAIN-CHECK" TO ERR-PARA
613977         MOVE "REP-CHAIN CHECK1"            TO ERR-MSG-LINE1
613978         GO TO S00-STOP-PROCESS
613979     END-EVALUATE
613980
613981     INITIALIZE WS-REP-CHAIN-FLAG
613982
613983     IF WS-REP-CHAIN-PREV-LVL = ' ' AND
613984        WS-REP-CHAIN-NEXT-LVL = 'Y'
613985        SET FIRST-IN-REP-CHAIN TO TRUE
613986*       DISPLAY "FIRST IN REPLACEMENT CHAIN"
613987     END-IF
613988     IF WS-REP-CHAIN-PREV-LVL = 'Y' AND
613989        WS-REP-CHAIN-NEXT-LVL = 'Y'
613990        SET MID-IN-REP-CHAIN TO TRUE
613991*       DISPLAY "MIDDLE IN REPLACEMENT CHAIN"
613992     END-IF
613993     IF WS-REP-CHAIN-PREV-LVL = 'Y' AND
613994        WS-REP-CHAIN-NEXT-LVL = ' '
613995        SET LAST-IN-REP-CHAIN  TO TRUE
613996*       DISPLAY "LAST IN REPLACEMENT CHAIN"
613997     END-IF
613998     IF WS-REP-CHAIN-PREV-LVL = ' ' AND
613999        WS-REP-CHAIN-NEXT-LVL = ' '
614000        SET NOT-IN-REP-CHAIN   TO TRUE
614001*       DISPLAY "NOT IN REPLACEMENT CHAIN"
614002     END-IF
614003     .
614004
614005 RF0-REPL-CHAIN-CHECK-INP-FILE.
614006     INITIALIZE WS-REP-CHAIN-PREV-LVL-F
614007*OLD PART IS A REPLACING PART IN INP FILE ARRAY? IF YES,ITS CHAIN
614008     SET WS-IN TO 1
614009     SEARCH WS-INP-FILE-ARRAY VARYING WS-IN
614010       AT END
614011         CONTINUE
614012       WHEN IN-CHG23-REPL-BASE(WS-IN)   = WS-CHG23-BASE   AND
614013            IN-CHG23-REPL-PREFIX(WS-IN) = WS-CHG23-PREFIX AND
614014            IN-CHG23-REPL-SUFFIX(WS-IN) = WS-CHG23-SUFFIX
614015         SET PREV-LVL-EXIST-F  TO TRUE
614016     END-SEARCH
614017
614018*NEW PART IS A REPLACED PART IN INP FILE?  IF YES,ITS A CHAIN
614019     INITIALIZE WS-REP-CHAIN-NEXT-LVL
614020     SET WS-IN TO 1
614021     SEARCH WS-INP-FILE-ARRAY VARYING WS-IN
614022       AT END
614023         CONTINUE
614024       WHEN IN-CHG23-BASE(WS-IN)   = WS-CHG23-REPL-BASE AND
614025            IN-CHG23-PREFIX(WS-IN) = WS-CHG23-REPL-PREFIX AND
614026            IN-CHG23-SUFFIX(WS-IN) = WS-CHG23-REPL-SUFFIX
614027         SET NEXT-LVL-EXIST-F  TO TRUE
614028     END-SEARCH
614029
614030     INITIALIZE WS-REP-CHAIN-FLAG-F
614031
614032     IF WS-REP-CHAIN-PREV-LVL-F = ' ' AND
614033        WS-REP-CHAIN-NEXT-LVL-F = 'Y'
614034        SET FIRST-IN-REP-CHAIN-F TO TRUE
614035*       DISPLAY "FIRST IN REPLACEMENT CHAIN - FILE"
614036     END-IF
614037     IF WS-REP-CHAIN-PREV-LVL = 'Y' AND
614038        WS-REP-CHAIN-NEXT-LVL = 'Y'
614039        SET MID-IN-REP-CHAIN-F TO TRUE
614040*       DISPLAY "MIDDLE IN REPLACEMENT CHAIN - FILE"
614041     END-IF
614042     IF WS-REP-CHAIN-PREV-LVL-F = 'Y' AND
614043        WS-REP-CHAIN-NEXT-LVL-F = ' '
614044        SET LAST-IN-REP-CHAIN-F  TO TRUE
614045*       DISPLAY "LAST IN REPLACEMENT CHAIN - FILE"
614046     END-IF
614047     IF WS-REP-CHAIN-PREV-LVL-F = ' ' AND
614048        WS-REP-CHAIN-NEXT-LVL-F = ' '
614049        SET NOT-IN-REP-CHAIN-F   TO TRUE
614050*       DISPLAY "NOT IN REPLACEMENT CHAIN - FILE"
614051     END-IF
614052     .
614053
614054 R01-REPLACEMENT-TYPE-CHECK.
614055     INITIALIZE WS-ROW-COUNT-OLD-PART
614056     EXEC SQL
614057       SELECT    COUNT(*)
614058       INTO      :WS-ROW-COUNT-OLD-PART
614059       FROM       SMMPE53_REP_SVPT_G E53
614060       WHERE      E53.SBASEPRT_NBR       = :WS-CHG23-BASE
614061       AND        E53.SPRFXPRT_PREFIX_R  = :WS-CHG23-PREFIX
614062       AND        E53.SPRFXPRT_PREFIX_R  = :WS-CHG23-SUFFIX
614063       AND        E53.SPRP_REPL_PRT_REG  LIKE :WS-REGION-EXT
614064     END-EXEC
614065     EVALUATE SQLCODE
614066       WHEN +000
614067         CONTINUE
614068       WHEN OTHER
614069         SET ERROR-FOUND TO TRUE
614070         MOVE "R01-REPLACEMENT-TYPE-CHECK" TO ERR-PARA
614071         MOVE "ROW-COUNT-OLD-PART CHK"     TO ERR-MSG-LINE1
614072         GO TO S00-STOP-PROCESS
614073     END-EVALUATE
614074
614075     INITIALIZE WS-ROW-COUNT-NEW-PART
614076     EXEC SQL
614077       SELECT    COUNT(*)
614078       INTO      :WS-ROW-COUNT-NEW-PART
614079       FROM       SMMPE53_REP_SVPT_G E53
614080       WHERE      E53.SBASEPRT_REPLCNG_R = :WS-CHG23-REPL-BASE
614081       AND        E53.SPRFXPRT_REPLCNG_R = :WS-CHG23-REPL-PREFIX
614082       AND        E53.SUFXPRT_REPLCNG_R  = :WS-CHG23-REPL-SUFFIX
614083       AND        E53.SPRP_REPL_PRT_REG  LIKE :WS-REGION-EXT
614084     END-EXEC
614085     EVALUATE SQLCODE
614086       WHEN +000
614087         CONTINUE
614088       WHEN OTHER
614089         SET ERROR-FOUND TO TRUE
614090         MOVE "R01-REPLACEMENT-TYPE-CHECK" TO ERR-PARA
614091         MOVE "ROW-COUNT-NEW-PART CHK"     TO ERR-MSG-LINE1
614092         GO TO S00-STOP-PROCESS
614093     END-EVALUATE
614094
614095     IF WS-ROW-COUNT-OLD-PART = 0 AND WS-ROW-COUNT-NEW-PART = 0
614096        CONTINUE
614097*       DISPLAY 'REPLACEMENT TYPE = 1:1'
614098     END-IF
614099
614100     IF WS-ROW-COUNT-OLD-PART > 0 AND WS-ROW-COUNT-NEW-PART = 0
614101        CONTINUE
614102*       DISPLAY 'REPLACEMENT TYPE = 1:N'
614103     END-IF
614104
614105     IF WS-ROW-COUNT-NEW-PART > 0 AND WS-ROW-COUNT-OLD-PART = 0
614106        CONTINUE
614107*       DISPLAY 'REPLACEMENT TYPE = N:1'
614108     END-IF
614109
614110     IF WS-ROW-COUNT-OLD-PART > 0 AND WS-ROW-COUNT-NEW-PART > 0
614111        CONTINUE
614112*       DISPLAY 'REPLACEMENT TYPE = N:N'
614113     END-IF
614114     .
614115
614116 P10-GET-LINKED-EPNS-COUNT-OLDP.
614117     INITIALIZE WS-LINKED-EPNS-COUNT
614118                WS-MAX-USAGES
614119     EXEC SQL
614120       SELECT     COUNT(*)
614121       INTO      :WS-LINKED-EPNS-COUNT
614122       FROM       SMMPE12_SENG_EQL   E12
614123       WHERE      E12.SBASEPRT_NBR       = :WS-CHG23-BASE
614124       AND        E12.SPRFXPRT_PREFIX_R  = :WS-CHG23-PREFIX
614125       AND        E12.SUFXPRT_SUFFIX_NBR = :WS-CHG23-SUFFIX
614126      END-EXEC
614127     EVALUATE SQLCODE
614128        WHEN +000
614129*MAX USAGES FOR 1 EPN (PROD D22) = 18110 (AS OF MAY-2024) ~19000
614130*ASSUMING 5 FINAL ASSEMBLY PER EPN
614131*US6670580 CHANGES BEGIN
614132*       COMPUTE WS-MAX-USAGES = 19000 * WS-LINKED-EPNS-COUNT * 5
614133             IF WS-LINKED-EPNS-COUNT > 0
614134        COMPUTE WS-MAX-USAGES = 19000 * WS-LINKED-EPNS-COUNT * 5
614135             ELSE
614136        COMPUTE WS-MAX-USAGES = 19000 * 1 * 5
614137             END-IF
614138*US6670580 CHANGES END
614139
614140        WHEN OTHER
614141             SET ERROR-FOUND TO TRUE
614142             MOVE "P10-G"                          TO ERR-PARA
614143             MOVE "OLDP LINKED EPN COUNT ERR"   TO ERR-MSG-LINE1
614144             GO TO S00-STOP-PROCESS
614145        END-EVALUATE
614146*US6512461 CHANGES BEGIN
614147*BELOW INITIALIZATIONS HAPPEN FOR RACH READ.
614148*INITIALIZE THE 3 STATIC ARRAYS COMPLETELY.
614149     INITIALIZE WS-AR1-TABLE
614150                WS-AR2-TABLE
614151                WS-TABLE2
614152*INITIALIZE THE DYNAMIC ARRAY BASED ON MAX USAGES COMPLETELY.
614153     SET WS-SUB TO 1
614154     PERFORM VARYING WS-SUB FROM 1 BY 1
614155       UNTIL (WS-SUB = WS-MAX-USAGES)
614156
614157       INITIALIZE             WS-USAGE-ARRAY(WS-SUB)
614158
614159     END-PERFORM
614160*US6512461 CHANGES END
614161     .
614162
614163 P20-GET-EPNS-AND-LOAD-USG-OLDP.
614164
614165*SET ARRAY START VALUE
614166     SET WS-SUB TO 1
614167     MOVE 1 TO WS-SUB-COUNT
614168
614169     EXEC SQL
614170       OPEN LINKED-EPN-CSR1
614171     END-EXEC
614172     EVALUATE SQLCODE
614173        WHEN +000
614174             CONTINUE
614175        WHEN OTHER
614176             SET ERROR-FOUND TO TRUE
614177             MOVE "P20-G"                          TO ERR-PARA
614178             MOVE "LINKED-EPN-CSR1 OPEN ERROR"  TO ERR-MSG-LINE1
614179             GO TO S00-STOP-PROCESS
614180     END-EVALUATE
614181*
614182     INITIALIZE SQLCODE
614183     PERFORM UNTIL SQLCODE = +100
614184       INITIALIZE CSR-OLD-EPN
614185                  CSR-OLD-ENGP-EIO-C
614186                  CSR-OLD-ENGP-SEQ-R
614187                  SBASEPRT-NBR       OF SMMPE12
614188                  SPRFXPRT-PREFIX-R  OF SMMPE12
614189                  SUFXPRT-SUFFIX-NBR OF SMMPE12
614190                  ENGP-ENGNRG-PART-R OF SMMPE12
614191                  ENGP-EIO-C         OF SMMPE12
614192                  ENGP-SEQ-R         OF SMMPE12
614193                  SEEQ-EFFECT-IN-Y   OF SMMPE12
614194       EXEC SQL
614195         FETCH LINKED-EPN-CSR1
614196         INTO      :SMMPE12.SBASEPRT-NBR
614197                  ,:SMMPE12.SPRFXPRT-PREFIX-R
614198                  ,:SMMPE12.SUFXPRT-SUFFIX-NBR
614199                  ,:SMMPE12.ENGP-ENGNRG-PART-R
614200                  ,:SMMPE12.ENGP-EIO-C
614201                  ,:SMMPE12.ENGP-SEQ-R
614202                  ,:SMMPE12.SEEQ-EFFECT-IN-Y
614203       END-EXEC
614204       EVALUATE SQLCODE
614205          WHEN +000
614206
614207               MOVE ENGP-ENGNRG-PART-R OF SMMPE12
614208                                       TO CSR-OLD-EPN
614209               MOVE ENGP-EIO-C         OF SMMPE12
614210                                       TO CSR-OLD-ENGP-EIO-C
614211               MOVE ENGP-SEQ-R         OF SMMPE12
614212                                       TO CSR-OLD-ENGP-SEQ-R
614213
614214               PERFORM P21-GET-USAGES-AND-LOAD-ARRAY
614215               PERFORM P22-GET-FIN-ASM-USAGES
614216          WHEN +100
614217               CONTINUE
614218          WHEN OTHER
614219               SET ERROR-FOUND TO TRUE
614220               MOVE "P20-G"                          TO ERR-PARA
614221               MOVE "LINKED-EPN-CSR1 FETCH ERROR" TO ERR-MSG-LINE1
614222               GO TO S00-STOP-PROCESS
614223       END-EVALUATE
614224     END-PERFORM
614225*
614226     EXEC SQL
614227       CLOSE LINKED-EPN-CSR1
614228     END-EXEC
614229     EVALUATE SQLCODE
614230        WHEN +000
614231             CONTINUE
614232        WHEN OTHER
614233             SET ERROR-FOUND TO TRUE
614234             MOVE "P20-G"                          TO ERR-PARA
614235             MOVE "LINKED-EPN-CSR1 CLOSE ERROR" TO ERR-MSG-LINE1
614236             GO TO S00-STOP-PROCESS
614237     END-EVALUATE
614238     .
614239
614240 P21-GET-USAGES-AND-LOAD-ARRAY.
614241     EXEC SQL
614242       OPEN GET-USAGES-CSR
614243     END-EXEC
614244     EVALUATE SQLCODE
614245        WHEN +000
614246             CONTINUE
614247        WHEN OTHER
614248             SET ERROR-FOUND TO TRUE
614249             MOVE "P21-G"                         TO ERR-PARA
614250             MOVE "GET-USAGES-CSR OPEN ERROR" TO ERR-MSG-LINE1
614251             GO TO S00-STOP-PROCESS
614252     END-EVALUATE
614253
614254     INITIALIZE SQLCODE
614255     PERFORM UNTIL ((SQLCODE = +100) OR
614256                    (WS-SUB-COUNT = WS-MAX-USAGES) OR
614257                    (WS-SUB-COUNT = 750000))
614258       INITIALIZE ENGP-ENGNRG-PART-R OF SMMPD22
614259                  EIO-ORIGIN-C       OF SMMPD22
614260                  ENGP-SEQ-R         OF SMMPD22
614261                  FUNC-KEY           OF SMMPD22
614262                  VEHTYPE-CODE       OF SMMPD22
614263                  PTEIO-ORIGIN-C     OF SMMPD22
614264                  EVL-VEHICLE-LINE-C OF SMMPD22
614265                  PFTRC-COMBINATN-C  OF SMMPD22
614266                  MFTRC-COMBINATN-C  OF SMMPD22
614267                  REGINT-C           OF SMMPD22
614268                  EVA-PER-USAGE-Q    OF SMMPD22
614269                  EFFIOP-EFF-IN-C    OF SMMPD22
614270                  EVA-USG-ACTV-STS-F OF SMMPD22
614271       EXEC SQL
614272         FETCH GET-USAGES-CSR
614273         INTO      :SMMPD22.ENGP-ENGNRG-PART-R
614274                  ,:SMMPD22.EIO-ORIGIN-C
614275                  ,:SMMPD22.ENGP-SEQ-R
614276                  ,:SMMPD22.FUNC-KEY
614277                  ,:SMMPD22.VEHTYPE-CODE
614278                  ,:SMMPD22.PTEIO-ORIGIN-C
614279                  ,:SMMPD22.EVL-VEHICLE-LINE-C
614280                  ,:SMMPD22.PFTRC-COMBINATN-C
614281                  ,:SMMPD22.MFTRC-COMBINATN-C
614282                  ,:SMMPD22.REGINT-C
614283                  ,:SMMPD22.EVA-PER-USAGE-Q
614284                  ,:SMMPD22.EFFIOP-EFF-IN-C
614285                  ,:SMMPD22.EVA-USG-ACTV-STS-F
614286       END-EXEC
614287       EVALUATE SQLCODE
614288          WHEN +000
614289               ADD 1 TO WS-XRST-D22-READ
614290*ARRAY LOAD
614291*
614292               MOVE ENGP-ENGNRG-PART-R OF SMMPD22
614293                            TO WS-ENGP-ENGNRG-PART-R(WS-SUB)
614294               MOVE EIO-ORIGIN-C       OF SMMPD22
614295                            TO WS-EIO-ORIGIN-C(WS-SUB)
614296               MOVE ENGP-SEQ-R         OF SMMPD22
614297                            TO WS-ENGP-SEQ-R(WS-SUB)
614298               MOVE FUNC-KEY           OF SMMPD22
614299                            TO WS-FUNC-KEY(WS-SUB)
614300               MOVE VEHTYPE-CODE       OF SMMPD22
614301                            TO WS-VEHTYPE-CODE(WS-SUB)
614302               MOVE PTEIO-ORIGIN-C     OF SMMPD22
614303                            TO WS-PTEIO-ORIGIN-C(WS-SUB)
614304               MOVE EVL-VEHICLE-LINE-C OF SMMPD22
614305                            TO WS-EVL-VEHICLE-LINE-C(WS-SUB)
614306               MOVE PFTRC-COMBINATN-C  OF SMMPD22
614307                            TO WS-PFTRC-COMBINATN-C(WS-SUB)
614308               MOVE MFTRC-COMBINATN-C  OF SMMPD22
614309                            TO WS-MFTRC-COMBINATN-C(WS-SUB)
614310               MOVE REGINT-C           OF SMMPD22
614311                            TO WS-REGINT-C(WS-SUB)
614312               MOVE EVA-PER-USAGE-Q    OF SMMPD22
614313                            TO WS-EVA-PER-USAGE-Q(WS-SUB)
614314               MOVE EFFIOP-EFF-IN-C    OF SMMPD22
614315                            TO WS-EFFIOP-EFF-IN-C(WS-SUB)
614316               MOVE EVA-USG-ACTV-STS-F OF SMMPD22
614317                            TO WS-EVA-USG-ACTV-STS-F(WS-SUB)
614318
614319*
614320               SET WS-SUB UP BY 1
614321               ADD 1 TO WS-SUB-COUNT
614322*
614323               IF WS-SUB-COUNT = WS-MAX-USAGES OR
614324                  WS-SUB-COUNT = 750000
614325                  SET WS-USAGE-ARRAY-OVERFLOW TO TRUE
614326
614327                  STRING "REC #-"          DELIMITED BY SIZE
614328                         WS-INFILE-RECORDS DELIMITED BY SIZE
614329                  INTO   ERR-MSG-LINE2
614330                  END-STRING
614331
614332                  ADD +1 TO WS-ERROR-CNT
614333                  MOVE MSG-USAGE-OVERFLOW     TO DET-LN-ERROR-MSG
614334                  MOVE ERR-MSG-LINE2          TO DET-LN-RECINFO
614335                  MOVE FI-PCCJ-ROW-KEY-N      TO DET-LN-INPROWKEY
614336                  PERFORM 5700M-WRITE-ERROR
614337               END-IF
614338*
614339          WHEN +100
614340               CONTINUE
614341          WHEN OTHER
614342               SET ERROR-FOUND TO TRUE
614343               MOVE "P21-G"                         TO ERR-PARA
614344               MOVE "GET-USAGES-CSR FETCH ERROR" TO ERR-MSG-LINE1
614345               GO TO S00-STOP-PROCESS
614346       END-EVALUATE
614347     END-PERFORM
614348*
614349     EXEC SQL
614350       CLOSE GET-USAGES-CSR
614351     END-EXEC
614352     EVALUATE SQLCODE
614353        WHEN +000
614354             CONTINUE
614355        WHEN OTHER
614356             SET ERROR-FOUND TO TRUE
614357             MOVE "P21-G"                         TO ERR-PARA
614358             MOVE "GET-USAGES-CSR CLOSE ERROR" TO ERR-MSG-LINE1
614359             GO TO S00-STOP-PROCESS
614360     END-EVALUATE
614361     .
614362
614363 P22-GET-FIN-ASM-USAGES.
614364     EXEC SQL
614365       OPEN CSR_FINAL_ASSEMBLY
614366     END-EXEC
614367     EVALUATE SQLCODE
614368        WHEN +000
614369             CONTINUE
614370        WHEN OTHER
614371             SET ERROR-FOUND TO TRUE
614372             MOVE "P22-GET-FIN-ASM-USAGES"        TO ERR-PARA
614373             MOVE "GET-FINASM CSR OPEN ERROR" TO ERR-MSG-LINE1
614374             GO TO S00-STOP-PROCESS
614375     END-EVALUATE
614376
614377     INITIALIZE SQLCODE
614378     PERFORM UNTIL SQLCODE = +100
614379       INITIALIZE SMMPD26
614380       EXEC SQL
614381         FETCH CSR_FINAL_ASSEMBLY
614382         INTO      :SMMPD26.FINASC-ENG-PART-R
614383                  ,:SMMPD26.FINASC-ORIGIN-C
614384                  ,:SMMPD26.FINASC-SEQ-R
614385                  ,:SMMPD26.EPNTSR-EFF-IN-Y-CMPNT
614386                  ,:SMMPD26.EPNTSR-EFF-OUT-Y-CMPNT
614387       END-EXEC
614388       EVALUATE SQLCODE
614389          WHEN +000
614390               ADD 1 TO WS-XRST-D26-READ
614391               INITIALIZE CSR-OLD-EPN
614392                          CSR-OLD-ENGP-EIO-C
614393                          CSR-OLD-ENGP-SEQ-R
614394               MOVE FINASC-ENG-PART-R OF SMMPD26
614395                            TO CSR-OLD-EPN
614396               MOVE FINASC-ORIGIN-C   OF SMMPD26
614397                            TO CSR-OLD-ENGP-EIO-C
614398               MOVE FINASC-SEQ-R      OF SMMPD26
614399                            TO CSR-OLD-ENGP-SEQ-R
614400               PERFORM P21-GET-USAGES-AND-LOAD-ARRAY
614401          WHEN +100
614402               CONTINUE
614403          WHEN OTHER
614404               SET ERROR-FOUND TO TRUE
614405               MOVE "P22-GET-FIN-ASM-USAGES"        TO ERR-PARA
614406               MOVE "GET-USAGES-CSR FETCH ERROR" TO ERR-MSG-LINE1
614407               GO TO S00-STOP-PROCESS
614408       END-EVALUATE
614409     END-PERFORM
614410*
614411     EXEC SQL
614412       CLOSE CSR_FINAL_ASSEMBLY
614413     END-EXEC
614414     EVALUATE SQLCODE
614415        WHEN +000
614416             CONTINUE
614417        WHEN OTHER
614418             SET ERROR-FOUND TO TRUE
614419             MOVE "P22-GET-FIN-ASM-USAGES"        TO ERR-PARA
614420             MOVE "GET-FINASM CSR CLOSE ERROR" TO ERR-MSG-LINE1
614421             GO TO S00-STOP-PROCESS
614422     END-EVALUATE
614423     .
614424
614425 P30-GET-EPNS-AND-DEL-NUAD-NEWP.
614426
614427     EXEC SQL
614428       OPEN LINKED-EPN-CSR2
614429     END-EXEC
614430     EVALUATE SQLCODE
614431        WHEN +000
614432             CONTINUE
614433        WHEN OTHER
614434             SET ERROR-FOUND TO TRUE
614435             MOVE "P30-GET-EPNS-AND-DEL-NUAD-NEWP" TO ERR-PARA
614436             MOVE "LINKED-EPN-CSR2 OPEN ERROR" TO ERR-MSG-LINE1
614437             GO TO S00-STOP-PROCESS
614438     END-EVALUATE
614439*
614440     INITIALIZE SQLCODE
614441     PERFORM UNTIL SQLCODE = +100
614442       INITIALIZE CSR-NEW-EPN
614443                  CSR-NEW-ENGP-EIO-C
614444                  CSR-NEW-ENGP-SEQ-R
614445                  SBASEPRT-NBR       OF SMMPE12
614446                  SPRFXPRT-PREFIX-R  OF SMMPE12
614447                  SUFXPRT-SUFFIX-NBR OF SMMPE12
614448                  ENGP-ENGNRG-PART-R OF SMMPE12
614449                  ENGP-EIO-C         OF SMMPE12
614450                  ENGP-SEQ-R         OF SMMPE12
614451                  SEEQ-EFFECT-IN-Y   OF SMMPE12
614452       EXEC SQL
614453         FETCH LINKED-EPN-CSR2
614454         INTO      :SMMPE12.SBASEPRT-NBR
614455                  ,:SMMPE12.SPRFXPRT-PREFIX-R
614456                  ,:SMMPE12.SUFXPRT-SUFFIX-NBR
614457                  ,:SMMPE12.ENGP-ENGNRG-PART-R
614458                  ,:SMMPE12.ENGP-EIO-C
614459                  ,:SMMPE12.ENGP-SEQ-R
614460                  ,:SMMPE12.SEEQ-EFFECT-IN-Y
614461       END-EXEC
614462       EVALUATE SQLCODE
614463          WHEN +000
614464
614465               MOVE ENGP-ENGNRG-PART-R OF SMMPE12
614466                                       TO CSR-NEW-EPN
614467               MOVE ENGP-EIO-C         OF SMMPE12
614468                                       TO CSR-NEW-ENGP-EIO-C
614469               MOVE ENGP-SEQ-R         OF SMMPE12
614470                                       TO CSR-NEW-ENGP-SEQ-R
614471
614472               PERFORM P31-USING-ARRAY-DEL-NUAD-NEWP
614473          WHEN +100
614474               CONTINUE
614475          WHEN OTHER
614476               SET ERROR-FOUND TO TRUE
614477               MOVE "P30-GET-EPNS-AND-DEL-NUAD-NEWP" TO ERR-PARA
614478               MOVE "LINKED-EPN-CSR2 FETCH ERROR" TO ERR-MSG-LINE1
614479               GO TO S00-STOP-PROCESS
614480       END-EVALUATE
614481     END-PERFORM
614482*
614483     EXEC SQL
614484       CLOSE LINKED-EPN-CSR2
614485     END-EXEC
614486     EVALUATE SQLCODE
614487        WHEN +000
614488             CONTINUE
614489        WHEN OTHER
614490             SET ERROR-FOUND TO TRUE
614491             MOVE "P30-GET-EPNS-AND-DEL-NUAD-NEWP" TO ERR-PARA
614492             MOVE "LINKED-EPN-CSR2 CLOSE ERROR" TO ERR-MSG-LINE1
614493             GO TO S00-STOP-PROCESS
614494     END-EVALUATE
614495     .
614496
614497 P31-USING-ARRAY-DEL-NUAD-NEWP.
614498*
614499     INITIALIZE DL-ENGP-ENGNRG-PART-R
614500                DL-EIO-ORIGIN-C
614501                DL-ENGP-SEQ-R
614502
614503     MOVE CSR-NEW-EPN        TO DL-ENGP-ENGNRG-PART-R
614504     MOVE CSR-NEW-ENGP-EIO-C TO DL-EIO-ORIGIN-C
614505     MOVE CSR-NEW-ENGP-SEQ-R TO DL-ENGP-SEQ-R
614506*
614507     SET WS-SUB TO 1
614508     PERFORM VARYING WS-SUB
614509       FROM 1 BY 1
614510       UNTIL ((WS-ENGP-ENGNRG-PART-R(WS-SUB) = SPACES) AND
614511              (WS-EIO-ORIGIN-C(WS-SUB)       = SPACES) AND
614512              (WS-ENGP-SEQ-R(WS-SUB)         = ZEROES))
614513       INITIALIZE DL-FUNC-KEY
614514                  DL-VEHTYPE-CODE
614515                  DL-PTEIO-ORIGIN-C
614516                  DL-EVL-VEHICLE-LINE-C
614517                  DL-PFTRC-COMBINATN-C
614518                  DL-MFTRC-COMBINATN-C
614519                  DL-REGINT-C
614520                  DL-EVA-PER-USAGE-Q
614521                  DL-EFFIOP-EFF-IN-C
614522                  DL-EVA-USG-ACTV-STS-F
614523*
614524       MOVE WS-FUNC-KEY(WS-SUB)
614525                    TO DL-FUNC-KEY
614526*
614527       MOVE 'NUAD'  TO  DL-FUNC-KEY(1:4)
614528*
614529       MOVE WS-VEHTYPE-CODE(WS-SUB)
614530                    TO DL-VEHTYPE-CODE
614531       MOVE WS-PTEIO-ORIGIN-C(WS-SUB)
614532                    TO DL-PTEIO-ORIGIN-C
614533       MOVE WS-EVL-VEHICLE-LINE-C(WS-SUB)
614534                    TO DL-EVL-VEHICLE-LINE-C
614535       MOVE WS-PFTRC-COMBINATN-C(WS-SUB)
614536                    TO DL-PFTRC-COMBINATN-C
614537       MOVE WS-MFTRC-COMBINATN-C(WS-SUB)
614538                    TO DL-MFTRC-COMBINATN-C
614539       MOVE WS-REGINT-C(WS-SUB)
614540                    TO DL-REGINT-C
614541       MOVE WS-EVA-PER-USAGE-Q(WS-SUB)
614542                    TO DL-EVA-PER-USAGE-Q
614543       MOVE WS-EFFIOP-EFF-IN-C(WS-SUB)
614544                    TO DL-EFFIOP-EFF-IN-C
614545       MOVE WS-EVA-USG-ACTV-STS-F(WS-SUB)
614546                    TO DL-EVA-USG-ACTV-STS-F
614547*
614548       EXEC SQL
614549         DELETE FROM SMMPD22_ENG_VL_APP D22
614550         WHERE  D22.ENGP_ENGNRG_PART_R = :DL-ENGP-ENGNRG-PART-R
614551         AND    D22.EIO_ORIGIN_C       = :DL-EIO-ORIGIN-C
614552         AND    D22.ENGP_SEQ_R         = :DL-ENGP-SEQ-R
614553         AND    D22.FUNC_KEY           = :DL-FUNC-KEY
614554         AND    D22.VEHTYPE_CODE       = :DL-VEHTYPE-CODE
614555         AND    D22.PTEIO_ORIGIN_C     = :DL-PTEIO-ORIGIN-C
614556         AND    D22.EVL_VEHICLE_LINE_C = :DL-EVL-VEHICLE-LINE-C
614557         AND    D22.PFTRC_COMBINATN_C  = :DL-PFTRC-COMBINATN-C
614558         AND    D22.MFTRC_COMBINATN_C  = :DL-MFTRC-COMBINATN-C
614559         AND    D22.REGINT_C           = :DL-REGINT-C
614560         AND    D22.EVA_PER_USAGE_Q    = :DL-EVA-PER-USAGE-Q
614561         AND    D22.EFFIOP_EFF_IN_C    = :DL-EFFIOP-EFF-IN-C
614562         AND    D22.EVA_USG_ACTV_STS_F = :DL-EVA-USG-ACTV-STS-F
614563       END-EXEC
614564       EVALUATE SQLCODE
614565          WHEN +000
614566*DEL-DISPLAY CHANGES BEGIN
614567               DISPLAY DEL-NUAD-VARS
614568*DEL-DISPLAY CHANGES END
614569               ADD 1 TO WS-XRST-D22-DELETED
614570               PERFORM P33-INSERT-INTO-E29-FOR-DEL
614571*
614572               IF LEVEL-1-ON OR LEVEL-2-ON OR LEVEL-X-ON
614573                  MOVE DEL-NUAD-VARS TO WS-USAGE-ARRAY2(WS-SUB22)
614574                  SET WS-SUB22 UP BY 1
614575               END-IF
614576*
614577          WHEN -811
614578*-811 NOT POSSIBLE SINCE WE ARE USING UNIQUE PRIM KEY COLS
614579               CONTINUE
614580          WHEN +100
614581               CONTINUE
614582          WHEN OTHER
614583               SET ERROR-FOUND TO TRUE
614584               MOVE "P31-USING-ARRAY-DEL-NUAD-NEWP" TO ERR-PARA
614585               MOVE "NUAD USAGE DELETE ERROR" TO ERR-MSG-LINE1
614586               GO TO S00-STOP-PROCESS
614587       END-EVALUATE
614588     END-PERFORM
614589     .
614590
614591 P33-INSERT-INTO-E29-FOR-DEL.
614592     INITIALIZE LINKAGE-PARAMETERS
614593     INITIALIZE CHG-JOURNAL-PARMS
614594     MOVE LIT-MMPD-ENG-VL-APP-TBL-N
614595                               TO CHG-JOURNAL-TABLE-NAME
614596     MOVE SPACES               TO CHG-JOURNAL-ATTRIBUTE-NAME
614597     MOVE DEL-NUAD-VARS        TO CHG-JOURNAL-ROW-KEY
614598     MOVE LIT-D                TO CHG-JOURNAL-ACTION-CODE
614599     MOVE SPACES               TO CHG-JOURNAL-OLD-DATA-CHAR
614600     MOVE SPACES               TO CHG-JOURNAL-NEW-DATA-CHAR
614601     PERFORM 4990M-ISRT-CHANGE-JOURNAL
614602     .
614603
614604 S00-STOP-PROCESS.
614605        MOVE ERR-PARA                  TO HE-PARAGRAPH
614606*LINE1 TO MSG2 SINCE MSG1 VALUE OVERRIDED IN SETUP-ABEND PARA
614607        MOVE ERR-MSG-LINE1             TO HE-MSG2
614608        MOVE ERR-MSG-LINE2             TO HE-MSG1
614609        PERFORM 9998M-SETUP-DB2-ABEND
614610     .
614620*NUAD END
