000100***************************************************************** 00000100
000200*                   IDENTIFICATION DIVISION                     * 00000200
000300***************************************************************** 00000300
000400 IDENTIFICATION DIVISION.                                         00000400
000500 PROGRAM-ID.   PA0067PY.                                          00000500
000600                                                                  00000600
000700 AUTHOR.                                                          00000700
000800                                                                  00000800
000900 DATE-WRITTEN.  MAR 2016.                                         00000900
001000                                                                  00001000
001100 DATE-COMPILED.                                                   00001100
001200                                                                  00001200
001300 INSTALLATION.      FORD MOTOR COMPANY.                           00001300
001400*                                                                 00001400
001500 COPY HHCPYRGT.                                                   00001500
001600      EJECT                                                       00001600
001700*                                                                 00001700
001800*REMARKS.                                                         00001800
001900***************************************************************** 00001900
002000*                                                               * 00002000
002100*   PROGRAM NAME:      PA0067PY                                 * 00002100
002200*   PROGRAM TYPE:      BMP                                      * 00002200
002300*       PSB NAME:      PA0067PY                                 * 00002300
002400*      DBMS USED:      IMS AND DB2                              * 00002400
002500*       LANGUAGE:      COBOL                                    * 00002500
002600*                                                               * 00002600
002700*   SHORT DESCRIPTION:  MAINTENANCE OF SMMPD60 TABLE FOR THE    * 00002700
002800*                       CHANGES OF SMMPD68                      * 00002800
002900*                                                               * 00002900
003000*    LONG DESCRIPTION:                                          * 00003000
003100* ------------------------------------------------------------- * 00003100
003200* 1) READ THE ADD/DELETE/CHANGE CJ FOR D68 TABLE.               * 00003200
003300* ------------------------------------------------------------- * 00003300
003400*                                                               * 00003400
003500***** SEE APPLICATION PROGRAMMER INSTRUCTIONS BELOW *****       * 00003500
003600*                                                               * 00003600
003700*                                                               * 00003700
003800***************************************************************** 00003800
003900***************************************************************** 00003900
004000*                BMP SHELL REVISION LOG                         * 00004000
004100***************************************************************** 00004100
004200*                                                                 00004200
004300*   DATE   |      | VERSION|                                    | 00004300
004400* MM/DD/YY | INIT |   NO   |           DESCRIPTION              | 00004400
004500*----------+------+--------+------------------------------------+ 00004500
004600* 06/05/91 | CLB  | 01.00  | COVERT TO 'APPLICATION SERVICES'   | 00004600
004700*          |      |        |   - HS2PBRTI ==> BRT INIT          | 00004700
004800*          |      |        |   - HS2PSECP ==> SECURITY PARMS    | 00004800
004900*          |      |        |   - HS2PDATE ==> DATE ROUTINE      | 00004900
005000*          |      |        |   - HS2PCHKD ==> CHECK DATA        | 00005000
005100* 04/01/92 | CLB  |  1.00  | ADDED COPYRIGHT INFORMATION        | 00005100
005200****************************************************************| 00005200
005300     EJECT                                                        00005300
005400***************************************************************** 00005400
005500*            APPLICATION PROGRAM REVISION LOG                   * 00005500
005600***************************************************************** 00005600
005700*                                                                 00005700
005800*   DATE   |      | CHANGE |                                    | 00005800
005900* MM/DD/YY | INIT | MOD NO |           DESCRIPTION              | 00005900
006000*----------+------+--------+------------------------------------+ 00006000
006100* 14/03/16 |DHEEPA| 010185 | INITIAL VERSION                    | 00006100
006200*          |      |        |                                    | 00006200
006300***************************************************************** 00006300
006400* 04/10/19 |PRAJKU| 018121 | PROJECT: USAGE BY PLANT            | 00006400
006500*          |    15|        | CHANGE: CHANGE MADE TO CREATE      | 00006500
006600*          |      |        | CHANGE JOURNAL WHILE UPDATING      | 00006600
006700*          |      |        | D60 TABLE FOR STATUS FIELD UPDATE  | 00006700
006800*          |      |        | IN THE PARA 5200M                  | 00006800
006900*          |      |        |                                    | 00006900
007000*          |      |        | THE CHANGE IS TAGGED WITH "018121" | 00007000
007100*          |      |        |                                    | 00007100
007200* 02/07/20 |PAYYAN|R1282190| PROJECT: USAGE BY PLANT            | 00007200
007300*          |    NA|        | CR4.3 - D60 NEW LOAD LOGIC CHANGE  | 00007300
007400*          |      |        |       - ADD IN-S4P CD TO CJ KEY    | 00007400
007500*          |      |        |                                    | 00007400
007501* 26/05/20 |VHEMA |U1617878| PROJECT: USAGE BY PLANT            | 00007200
007502*          |      |        | CR4.3 - CHANGES MADE IN RUBBER     | 00007300
007503*          |      |        |         CONDITION OF ADD AND CHANGE| 00007400
007504*          |      |        |         CJS OF MMEA TO HAVE PDO    | 00007400
007505*          |      |        |         RECORDS ACTIVE             | 00007400
007506* 13/08/20 |SELVA |018121  | PROJECT: USAGE BY PLANT            | 00007200
007507*          |      |        | BUG FIX. REDUCED THE MAIN D60      | 00007300
007508*          |      |        |CURSORS FROM 4 NOS TO 2 NOS, ONE FOR| 00007400
007509*          |      |        |END DATE & ONE FOR START DATE. D60  | 00007400
007510*          |      |        |REC STATUS IS DETERMINED USING MMEA | 00007400
007511*          |      |        |DATES AND PSFA DATES RUBBER BAND    | 00007400
007512*          |      |        |CONFITION. CHANGES TAGGED WITH FIX1.| 00007400
007600***************************************************************** 00007500
007610* 06/17/22 |MOHAN |3708170 |SMMPE29_CHG_JORNAL  ORDER BY
007620*          |      |        |P_LAST_UPDATE_S
007630* 06/18/22 |MOHAN |3708170 |SMMPE29_CHG_JORNAL CODE MODIFICATION
007640* 06/20/22 |MOHAN |3708170 |CRITERIA ADDED IN
007650*          |      |        |SMMPE29_CHG_JORNAL
007700     EJECT                                                        00007600
007800***************************************************************** 00007700
007900*                                                               * 00007800
008000*    APPLICATION PROGRAMMER INSTRUCTIONS                        * 00007900
008100*                                                               * 00008000
008200*                                                               * 00008100
008300*  IDENTIFICATION DIVISION                                      * 00008200
008400*                                                               * 00008300
008500*    1.  CHANGE THE PROGRAM-ID TO THE NAME OF YOUR PROGRAM.     * 00008400
008600*                                                               * 00008500
008700*    2.  UPDATE THE PROGRAM REMARKS TO REFLECT THE PROGRAM,     * 00008600
008800*        PROGRAM TYPE, PSB-NAME, AND DBMS USED.                 * 00008700
008900*                                                               * 00008800
009000*    3.  UPDATE THE REVISION LOG TO REFLECT THE CHANGES YOU     * 00008900
009100*        ARE NOW MAKING.                                        * 00009000
009200*                                                               * 00009100
009300*                                                               * 00009200
009400*  DATA DIVISION                                                * 00009300
009500*                                                               * 00009400
009600*    1. REFERRING TO COMMENTS IN THE SECTION "VARIABLES WHICH   * 00009500
009700*       MUST BE SET BY THE APPLICATION PROGRAMMER", UPDATE THE  * 00009600
009800*       REQUIRED ENTRIES.                                       * 00009700
009900*                                                               * 00009800
010000*    2. IN THE LINKAGE SECTION, ADD ANY ADDITIONAL PCB-S THAT   * 00009900
010100*       ARE REQUIRED IN THE INDICATED PLACE.                    * 00010000
010200*                                                               * 00010100
010300*                                                               * 00010200
010400*  PROCEDURE DIVISION                                           * 00010300
010500*                                                               * 00010400
010600*    1. IF ADDITIONAL PCB-S ARE REQUIRED, UPDATE THE "ENTER"    * 00010500
010700*       STATEMENT.                                              * 00010600
010800*                                                               * 00010700
010900*                                                               * 00010800
011000*                                                               * 00010900
011100***************************************************************** 00011000
011200     EJECT                                                        00011100
011300***************************************************************** 00011200
011400*                                                               * 00011300
011500* "COPY" STATEMENTS INCLUDED IN BATCH REQUEST SHELL.            * 00011400
011600*                                                               * 00011500
011700*      BRTQSSA    - BR&T QUALIFIED SSA                          * 00011600
011800*      CHKDATA    - STORAGE FOR CHKDATA SUBROUTINE              * 00011700
011900*      COMMIMS    - COMMON IMS COMMANDS AND STATUS CODES        * 00011800
012000*      COMMDB2    - COMMON DB2 CALL TEXT DESCRIPTIONS           * 00011900
012100*      DATEPARM   - STORAGE FOR HDATERTN SUBROUTINE             * 00012000
012200*      HWSECPRM   - STORAGE FOR SECURITY PARMS SUBROUTINE       * 00012100
012300*      HARDCPY2   - STORAGE FOR HARD COPY MESSAGES              * 00012200
012400*      TBLIOWS    - STORAGE FOR HTBLIO SUBROUTINE               * 00012300
012500*      WSAAAL     - STORAGE FOR TABLE AAAL                      * 00012400
012600*      MAILISRT   - STORAGE FOR HMAIISRT SUBROUTINE             * 00012500
012700*      STMPPPCB   - LINKAGE SECTION PCB'S                       * 00012600
012800*      HPCBGSAM   - LINKAGE SECTION GSAM PCB'S                  * 00012700
012900*      BRTINPRM   - BATCH RQST AND TRACKING PARAMETERS          * 00012800
013000*      HWS0010I   - BASIC CHKP/XRST DATA AREA                   * 00012900
013100*      HWS0020I   - WORKING-STORAGE USED BY THE SHELL           * 00013000
013200*      HWS0050I   - STORAGE USED BY TABLE IO SETUP              * 00013100
013300*      NWS0060I   - CHECKPOINT FREQUENCY FILE RECORD LAYOUT     * 00013200
013400*      HWS0070I   - LITERALS USED BY HTBLIO CALLS               * 00013300
013500*      HWS0080I   - GSAM IMS FUNCTION CALLS                     * 00013400
013600*      HWS0990I   - DESCRIPTION OF PARAGRAPH NUMBERING SCHEME   * 00013500
013700*      HBP0000I   - 0000H-CONTROL-PROGRAM                       * 00013600
013800*      HBP0100I   - 0100H-PROGRAM-INIT                          * 00013700
013900*      HBP0200I   - 0200H-MAIN-PROCESS                          * 00013800
014000*      HBP0300I   - 0300H-OBTAIN-REQUEST-PARMS                  * 00013900
014100*      HBP0400I   - 0400H-END-OF-JOB                            * 00014000
014200*      HBP0600I   - 0600H-CALL-SECP-PARM                        * 00014100
014300*      HBP0700I   - 0700H-CALL-TABLE-IO                         * 00014200
014400*      HBP1000I   - 1000H-PROCESS-CHKP-FREQ-FILE                * 00014300
014500*                    (INCLUDING START OF 1010A-XRST-CALL)       * 00014400
014600*      HBP1100I   - 1100H-SHELL-SPECIFIC-INIT                   * 00014500
014700*      HBP2000I   - 2000H-SHELL-RESTART-INIT                    * 00014600
014800*      HBP3000I   - 3000H-PROCESS-REQUESTS                      * 00014700
014900*      HBP3300I   - 3300H-PROCESS-CHKP                          * 00014800
015000*      HBP3500I   - 3500H-PROCESS                               * 00014900
015100*      HBP6100I   - 6100H-DO-CHKP                               * 00015000
015200*      HBP6120I   - 6120A-CHKP-CALL (BEGINNING)                 * 00015100
015300*      HBP7000I   - 7000H-OBTAIN-BATCH-REQUESTS                 * 00015200
015400*      HBP7010I   - 7010H-OBTAIN-NEXT-BRT-BATCH                 * 00015300
015500*      HBP7700I   - 7700H-UPDATE-STATUS-COMPLETE                * 00015400
015600*      HBP8000I   - 8000H-FILL-REQUEST-TABLE                    * 00015500
015700*      HBP8020I   - 8020H-FETCH-REQUEST-OCCURRENCE              * 00015600
015800*      HBP8030I   - 8030H-HANDLE-HBRTINIT-STATUS                * 00015700
015900*      HBP8060I   - 8060H-GET-NEXT-REQUEST                      * 00015800
016000*      HBP8100I   - 8100H-INSERT-MAILBOX-MESSAGE                * 00015900
016100*      HBP8110I   - 8110H-FMT-PMI-PFKEY-SEGS                    * 00016000
016200*      ABENDBAT   - 9990H-ABNORMAL-END-OF-JOB                   * 00016100
016300*                                                               * 00016200
016400***************************************************************** 00016300
016500*                                                               * 00016400
016600     EJECT                                                        00016500
016700 ENVIRONMENT DIVISION.                                            00016600
016800 CONFIGURATION SECTION.                                           00016700
016900 OBJECT-COMPUTER. IBM-370.                                        00016800
017000 SOURCE-COMPUTER. IBM-370.                                        00016900
017100*SOURCE-COMPUTER. IBM-370 WITH DEBUGGING MODE.                    00017000
017200                                                                  00017100
017300 INPUT-OUTPUT SECTION.                                            00017200
017400 FILE-CONTROL.                                                    00017300
017500     SELECT CHKP-FREQUENCY-FILE                                   00017400
017600                     ASSIGN TO UT-S-CHKPXRST.                     00017500
017700 SKIP2                                                            00017600
017800***************************************************************** 00017700
017900*                     DATA DIVISION                             * 00017800
018000***************************************************************** 00017900
018100*                                                                 00018000
018200 DATA DIVISION.                                                   00018100
018300 FILE SECTION.                                                    00018200
018400 FD  CHKP-FREQUENCY-FILE                                          00018300
018500     RECORDING MODE F                                             00018400
018600     LABEL RECORDS ARE STANDARD                                   00018500
018700     BLOCK CONTAINS 0 RECORDS.                                    00018600
018800 01  CHKP-FREQUENCY-RECORD          PIC X(80).                    00018700
018900                                                                  00018800
019000 EJECT                                                            00018900
019100 WORKING-STORAGE SECTION.                                         00019000
019200 77  PAN-VALET PICTURE X(24) VALUE "013PA0067PY  11/19/15".       00019100
019300                                                                  00019200
019400 01  WS-LITERAL                     PIC X(32)  VALUE              00019300
019500         "WORKING STORAGE BEGINS HERE".                           00019400
019600                                                                  00019500
019700     COPY  HWS0060I.                                              00019600
019800***************************************************************** 00019700
019900*    05  WS-CFR-FOR-APPLICATION-USE PIC X(31).                  * 00019800
020000*    MAY BE REDEFINED HERE AS YOU LIKE.                         * 00019900
020100***************************************************************** 00020000
020200     05  WS-FPSD-REQ-CHKP-FIELDS REDEFINES                        00020100
020300                        WS-CFR-FOR-APPLICATION-USE.               00020200
020400         10  TEST-ABEND-SWITCH      PIC X(01).                    00020300
020500             88  ABEND-PROGRAM      VALUE "%".                    00020400
020600         10  ABEND-CHKP             PIC 9(09).                    00020500
020700         10  FILLER                 PIC X(21).                    00020600
020800                                                                  00020700
020900***************************************************************** 00020800
021000*  BATCH MESSAGE PROGRAM RESTART AREA                           * 00020900
021100*                                                               * 00021000
021200* THIS COPY MEMBER DEFINES THE RESTART AREA. THIS AREA IS USED  * 00021100
021300* IN "XRST" AND "CHKP" CALLS TO SAVE THE VALUES OF WORKING-     * 00021200
021400* STORAGE VARIABLES. THE AREA "WS-APPL-SPECIFIC-XRST-DATA" IS   * 00021300
021500* TO BE USED TO STORE APPLICATION-SPECIFIC DATA. THIS DATA MUST * 00021400
021600* BE SAVED WHEN A CHECKPOINT IS TAKEN, AND RESTORED WHEN AN     * 00021500
021700* IMS OR INTERNAL RESTART IS DONE.  NOTE THAT THERE IS A        * 00021600
021800* MAXIMUM LENGTH TO THIS AREA.                                  * 00021700
021900*                                                               * 00021800
022000* YOU MAY SAVE OTHER AREAS IN YOUR PROGRAM BY ADDING THEM TO    * 00021900
022100* THE XRST CALL IN PARA. 1010A AND THE CHKP CALL IN PARA.       * 00022000
022200* 6120A.  BUT SAVE (AND RESTORE) FROM (AND TO) COPIES OF        * 00022100
022300* THE DESIRED DATA, NOT THE "ORIGINALS."   WHEN A RESTART       * 00022200
022400* IS DONE, YOU OVERLAY THE "ORIGINALS" WITH THE "COPIES".       * 00022300
022500* ON IMS RESTARTS, IMS RESTORES THE SAVED DATA FOR YOU.  IF     * 00022400
022600* THE RESTART IS AN INTERNAL ONE (I.E., RECOVERY FROM A DEAD-   * 00022500
022700* LOCK), THE COPIES ARE THE ONLY SOURCES OF SAVED DATA.         * 00022600
022800*                                                               * 00022700
022900***************************************************************** 00022800
023000*                                                                 00022900
023100     COPY  HWS0010I.                                              00023000
023200***************************************************************** 00023100
023300*                                                               * 00023200
023400* THIS IS THE APPLICATION-SPECIFIC RESTART AREA.                * 00023300
023500*                                                               * 00023400
023600* TO DEFINE APPLICATION-SPECIFIC DATA, REPLACE THE FILLER BELOW * 00023500
023700* WITH THE LAYOUT OF THE RESTART DATA.  IT ALL FOLLOWS THIS     * 00023600
023800* HEADING:                                                      * 00023700
023900*                                                               * 00023800
024000*  05  WS-APPL-SPECIFIC-XRST-DATA.                              * 00023900
024100*                                                               * 00024000
024200* THE RESTART AREA SHOULD INCLUDE ANY DATA YOU NEED TO RECOVER  * 00024100
024300* FROM AN IMS RESTART OR A DEADLOCK.  CANDIDATES FOR INCLUSION  * 00024200
024400* WOULD BE:                                                     * 00024300
024500*                                                               * 00024400
024600*       SUBSCRIPTS     DB2 ROW KEY DATA                         * 00024500
024700*       TOTALS         IMS/VS SEGMENT KEY DATA                  * 00024600
024800*       SWITCHES                                                * 00024700
024900*       COUNTERS                                                * 00024800
025000*       DATA FOR RESUMING THE PROCESSING OF REQUESTS            * 00024900
025100*                                                               * 00025000
025200* NOTE THAT THESE ARE "SAVED" COPIES OF VARIABLES, AND ARE TO   * 00025100
025300* BE USED ONLY TO SAVE VALUES DURING CHECKPOINT.  THE "WORKING" * 00025200
025400* VARIABLES SHOULD BE MOVED HERE WHEN THE CHECKPOINT IS TAKEN   * 00025300
025500* AND COPIED BACK FROM HERE WHEN A RESTART IS DONE.             * 00025400
025600*                                                               * 00025500
025700***************************************************************** 00025600
025800*                                                                 00025700
025900         10  WS-XRST-SAVE-AREA                    PIC X(98).      00025800
026000         10  WS-XRST-CHKP-CNT                     PIC 9(04) COMP. 00025900
026100         10  FILLER                               PIC X(3400).    00026000
026200                                                                  00026100
026300     EJECT                                                        00026200
026400     COPY  HWS0020I.                                              00026300
026500                                                                  00026400
026600***************************************************************** 00026500
026700* THIS FIELD IS USED TO DETERMINE THE TYPE OF ERROR TO PROCESS. * 00026600
026800* THE PROGRAMMER IS RESPONSIBLE FOR SETTING THE APPROPRIATE     * 00026700
026900* VALUE WHEN A FATAL ERROR CONDITION IS DETECTED                * 00026800
027000***************************************************************** 00026900
027100                                                                  00027000
027200 01  WS-ABEND-ERROR-TYPE            PIC X(03) VALUE SPACES.       00027100
027300     88  WS-ABEND-IMS-ERROR                   VALUE "IMS".        00027200
027400     88  WS-ABEND-SQL-ERROR                   VALUE "SQL".        00027300
027500     88  WS-ABEND-NON-DBMS-ERROR              VALUE "   ".        00027400
027600                                                                  00027500
027700     EJECT                                                        00027600
027800***************************************************************** 00027700
027900*                                                               * 00027800
028000* APPLICATION-SPECIFIC WORKING STORAGE                          * 00027900
028100*                                                               * 00028000
028200*                                                               * 00028100
028300*    THE APPLICATION PROGRAMMER SHOULD INCLUDE HERE ANY         * 00028200
028400*    WORKING STORAGE PARTICULAR TO THE APPLICATION. EXAMPLES    * 00028300
028500*    MIGHT BE:                                                  * 00028400
028600*                                                               * 00028500
028700*      IF THE PROGRAM IS A NON-RESPONSE MPP, INCLUDE THE LAYOUT * 00028600
028800*        OF THE INPUT MESSAGE.                                  * 00028700
028900*                                                               * 00028800
029000*      LAYOUTS OF DATA BASE SEGMENTS.                           * 00028900
029100*                                                               * 00029000
029200*      DECLARATIONS OF HOST VARIABLES.                          * 00029100
029300*                                                               * 00029200
029400*      DB2 TABLE DEFINITIONS.                                   * 00029300
029500*                                                               * 00029400
029600***************************************************************** 00029500
029700                                                                  00029600
029800 01  WS-APPL-REQUIRED-STUFF.                                      00029700
029900                                                                  00029800
030000***************************************************************** 00029900
030100* THE VALUE OF "PROGRAM-NAME" SHOULD BE SET TO THAT FOUND IN THE* 00030000
030200* PROGRAM-ID IN THE IDENTIFICATION DIVISION.                    * 00030100
030300***************************************************************** 00030200
030400                                                                  00030300
030500     05  PROGRAM-NAME               PIC X(08) VALUE "PA0067PY".   00030400
030600                                                                  00030500
030700***************************************************************** 00030600
030800* THE VALUE OF "SW-BATCH-RQST-CNTL-PARM" MUST BE SET TO "R" IF  * 00030700
030900* USING BR&T ONLY, "N" IF NOT USING BR&T.  THE PROGRAM WILL     * 00030800
031000* DEFAULT TO PROCESSING NON BATCH REQUEST.                      * 00030900
031100***************************************************************** 00031000
031200                                                                  00031100
031300     05  SW-BATCH-RQST-CNTL-PARM    PIC X(01) VALUE "N".          00031200
031400         88  BATCH-RQST-TABLE-USED            VALUE "R".          00031300
031500         88  BATCH-PARM-NOT-USED              VALUE "N".          00031400
031600                                                                  00031500
031700***************************************************************** 00031600
031800* THE VALUE OF "SW-PROGRAM-RESTARTABLE" INDICATES WHETHER THIS  * 00031700
031900* PROGRAM MAY BE RESUMED FROM AN IMS CHECKPOINT OR MUST BE      * 00031800
032000* RERUN FROM THE BEGINNING IF IT ABENDS.  IT AFFECTS THE TIME   * 00031900
032100* AT WHICH BRT REQUESTS ARE MARKED COMPLETE, AND WHETHER A BRT  * 00032000
032200* REQUEST IS MARKED EXECUTING, AND WHETHER AN IMS RESTART IS    * 00032100
032300* ACCEPTED.                                                     * 00032200
032400***************************************************************** 00032300
032500                                                                  00032400
032600     05  SW-PROGRAM-IS-RESTARTABLE  PIC X(01) VALUE "Y".          00032500
032700         88  PROGRAM-IS-RESTARTABLE           VALUE "Y".          00032600
032800         88  PROGRAM-IS-RERUNNABLE            VALUE "N".          00032700
032900                                                                  00032800
033000***************************************************************** 00032900
033100* IF YOU PREFER THAT THE PROGRAM READ A DRIVING RECORD IMMED-   * 00033000
033200* IATELY AFTER GETTING EACH BATCH OF REQUESTS, AND CHECKPOINT-  * 00033100
033300* ING BEFORE THE DRIVING RECORD IS PROCESSED, SET SW-PRIMING-   * 00033200
033400* READ-REQUESTED TO "Y".  (A PRIMING READ IS USEFUL WHEN THE    * 00033300
033500* DRIVING RECORDS ARE THE ONLY CONTROL ON THE MAIN PROCESS--    * 00033400
033600* E.G., A SEQUENTIAL FILE.)  A BREAK IN THE DRIVING RECORDS     * 00033500
033700* MAY BE CONSIDERED THE END OF A "REQUEST," AND PARAS. 3100A    * 00033600
033800* AND 3400A ARE AVAILABLE TO PROCESS SUCH BREAKS.               * 00033700
033900* IF YOU PREFER THAT THE PROGRAM CHECKPOINT AFTER A DRIVING     * 00033800
034000* RECORD IS PROCESSED, LEAVE SW-PRIMING-READ-REQUESTED SET      * 00033900
034100* TO "N".  THIS IS USUALLY DONE WHEN THE DRIVING RECORDS        * 00034000
034200* ARE SELECTED BASED ON, FOR EXAMPLE, A BRT REQUEST.            * 00034100
034300******************************************************************00034200
034400                                                                  00034300
034500     05  SW-PRIMING-READ-REQUESTED  PIC X(01) VALUE "N".          00034400
034600         88  PRIMING-READ-REQUESTED           VALUE "Y".          00034500
034700         88  NOT-PRIMING-READ-REQUESTED       VALUE "N".          00034600
034800                                                                  00034700
034900     EJECT                                                        00034800
035000***************************************************************** 00034900
035100* THE FIELD "WS-LEN-LONGEST-IO-AREA" SHOULD NOT BE CHANGED,     * 00035000
035200* UNLESS THE APPLICATION PROGRAMMER USES AN IO-AREA FOR IMS/VS  * 00035100
035300* CALLS WHICH IS LARGER THAN  2200  BYTES.IF SO, SET THE FIELD  * 00035200
035400* TO A NUMBER AT LEAST AS LARGE AS THE LARGEST IO-AREA.         * 00035300
035500***************************************************************** 00035400
035600                                                                  00035500
035700     05  WS-LEN-LONGEST-IO-AREA     PIC S9(8) VALUE +2200 COMP.   00035600
035800                                                                  00035700
035900     EJECT                                                        00035800
036000****************************************************************  00035900
036100* THE FOLLOWING DATA ELEMENT IS USED BY THE SHELL TO CONTROL   *  00036000
036200* CHECKPOINT PROCESSING. IT COMES FROM THE CHECKPOINT          *  00036100
036300* FREQUENCY FILE.  WHEN EXCEEDED BY THE CHECKPOINT COUNTER,    *  00036200
036400* A CHECKPOINT IS TAKEN.                                       *  00036300
036500****************************************************************  00036400
036600                                                                  00036500
036700     05  WS-CHKP-LIMIT              PIC S9(8) VALUE +500 COMP.    00036600
036800                                                                  00036700
036900***************************************************************** 00036800
037000* THE FOLLOWING DATA ELEMENT REFLECTS THE NUMBER OF TIMES THE   * 00036900
037100* PROGRAMMER WILL ALLOW THE PROGRAM TO RECOVER FROM DEADLOCK    * 00037000
037200* BEFORE ABENDING.  THIS VALUE IS SUPPLIED IN THE CHECKPOINT    * 00037100
037300* FREQUENCY FILE.                                               * 00037200
037400***************************************************************** 00037300
037500                                                                  00037400
037600     05  WS-INTERNAL-RESTART-MAX    PIC S9(4) VALUE +5 COMP.      00037500
037700                                                                  00037600
037800****************************************************************  00037700
037900* "WS-NUMBER-OF-RQST-TYPES" SHOULD BE SET TO THE NUMBER OF     *  00037800
038000* DIFFERENT TYPES OF REQUESTS WHICH THE PROGRAM MAY PROCESS.   *  00037900
038100* IT HAS A MAXIMUM VALUE OF  3.                                *  00038000
038200****************************************************************  00038100
038300                                                                  00038200
038400     05  WS-NUMBER-OF-RQST-TYPES    PIC S9(4) VALUE +1 COMP.      00038300
038500                                                                  00038400
038600****************************************************************  00038500
038700* "WS-NUMBER-OF-RQST-OCCURRENCES" SHOULD BE SET TO THE MAXIMUM *  00038600
038800* NUMBER OF REQUESTS OF ANY TYPE WHICH MAY BE PROCESSED AT THE *  00038700
038900* SAME TIME. IT HAS A MAXIMUM VALUE OF  8.                     *  00038800
039000****************************************************************  00038900
039100                                                                  00039000
039200     05  WS-NUMBER-OF-RQST-OCCURRENCES                            00039100
039300                                    PIC S9(4) VALUE +1 COMP.      00039200
039400                                                                  00039300
039500***************************************************************** 00039400
039600* THE FOLLOWING TABLE LISTS THE NAMES OF THE REQUESTS WHICH THE * 00039500
039700* PROGRAM PROCESSES. THE PROGRAMMER SHOULD UPDATE THE TABLE TO  * 00039600
039800* REFLECT THE CORRECT REQUEST NAMES, AND SHOULD ALSO UPDATE THE * 00039700
039900* FOLLOWING "OCCURS" STATEMENT WITH THE CORRECT NUMBER OF TABLE * 00039800
040000* ENTRIES.                                                      * 00039900
040100***************************************************************** 00040000
040200                                                                  00040100
040300     05  WS-A-RQST-ENTRIES.                                       00040200
040400         10  WS-REQUEST-1           PIC X(08) VALUE "XXXXXXXX".   00040300
040500         10  FILLER                 PIC X(01) VALUE "F".          00040400
040600         10  WS-REQUEST-2           PIC X(08) VALUE "YYYYYYYY".   00040500
040700         10  FILLER                 PIC X(01) VALUE "F".          00040600
040800         10  WS-REQUEST-3           PIC X(08) VALUE "ZZZZZZZZ".   00040700
040900         10  FILLER                 PIC X(01) VALUE "F".          00040800
041000*****                                                             00040900
041100     05  WS-H-RQST-PROCESS-STATUS-TABLE                           00041000
041200              REDEFINES  WS-A-RQST-ENTRIES.                       00041100
041300         10  WS-H-RQST-OCCURS       OCCURS  1  TIMES.             00041200
041400             15  WS-RQST-PROCESS-ID     PIC X(08).                00041300
041500             15  WS-RQST-PROCESSED-SW   PIC X(01).                00041400
041600     EJECT                                                        00041500
041700 01  FILLER                               PIC X(14)               00041600
041800                                          VALUE "BEGIN PACMMPQL". 00041700
041900                                                                  00041800
042000 COPY PACMMPQL.                                                   00041900
042100                                                                  00042000
042200     EJECT                                                        00042100
042300 01  FILLER                               PIC X(14)               00042200
042400                                          VALUE "BEGIN PACMMPFR". 00042300
042500                                                                  00042400
042600 COPY PACMMPFR.                                                   00042500
042700                                                                  00042600
042800     EJECT                                                        00042700
042900 01  FILLER                               PIC X(14)               00042800
043000                                          VALUE "BEGIN PACMMPFS". 00042900
043100                                                                  00043000
043200 COPY PACMMPFS.                                                   00043100
043300                                                                  00043200
043400     EJECT                                                        00043300
043500 01  FILLER                               PIC X(14)               00043400
043600                                          VALUE "BEGIN PACMMPFW". 00043500
043700                                                                  00043600
043800 COPY PACMMPFW.                                                   00043700
043900                                                                  00043800
044000     EJECT                                                        00043900
044100 01  FILLER                               PIC X(14)               00044000
044200                                          VALUE "BEGIN PACMMPFT". 00044100
044300                                                                  00044200
044400 COPY PACMMPFT.                                                   00044300
044500                                                                  00044400
044600     EJECT                                                        00044500
044700 01  FILLER                               PIC X(14)               00044600
044800                                          VALUE "BEGIN PACMMPKD". 00044700
044900                                                                  00044800
045000 COPY PACMMPKD.                                                   00044900
045100                                                                  00045000
045200     EJECT                                                        00045100
045300***************************************************************** 00045200
045400* CHANGE JOURNAL                                                * 00045300
045500***************************************************************** 00045400
045600                                                                  00045500
045700 COPY PACMMPPX.                                                   00045600
045800                                                                  00045700
045900 EJECT                                                            00045800
046000***************************************************************** 00045900
046100*                                                               * 00046000
046200*  REQUEST RECORD TABLE                                         * 00046100
046300*                                                               * 00046200
046400* NOTE: PROGRAMMER IS RESPONSIBLE FOR ENSURING THAT THIS DATA   * 00046300
046500*       IS SAVED WITH A CHECKPOINT IF THE PROGRAM IS RESTART-   * 00046400
046600*       ABLE.                                                   * 00046500
046700*                                                               * 00046600
046800*       ADJUST THE NUMBER OF OCCURRENCES, AND THE ARRAY'S       * 00046700
046900*       LENGTH IN WS-RQST-RECORD-TABLE-LEN, ACCORDING TO        * 00046800
047000*       THE NUMBER OF REQUEST TYPES AND NUMBER OF REQUESTS      * 00046900
047100*       PER BATCH THAT YOUR PROGRAM WILL HANDLE.                * 00047000
047200*                                                               * 00047100
047300***************************************************************** 00047200
047400*                                                                 00047300
047500 01  WS-RQST-RECORD-TABLE-LENGTH          PIC S9(9) COMP          00047400
047600                                          VALUE +1000.            00047500
047700 01  WS-RQST-RECORD-TABLE.                                        00047600
047800     05  WS-RQST-RECORD-TYPES             OCCURS  1  TIMES.       00047700
047900         10  WS-RQST-RECORD-OCCURS        OCCURS  1  TIMES.       00047800
048000             15  WS-RQST-RECORD-AREA.                             00047900
048100                 20  WS-RQST-REC-KEY.                             00048000
048200                     25  WS-RQST-REC-ID    PIC X(08).             00048100
048300                     25  WS-RQST-REC-DATE  PIC 9(08).             00048200
048400                     25  WS-RQST-REC-TIME  PIC 9(08).             00048300
048500                 20  FILLER                PIC X(976).            00048400
048600                                                                  00048500
048700     COPY  BRTQSSA.                                               00048600
048800                                                                  00048700
048900***************************************************************** 00048800
049000*                                                               * 00048900
049100*  COMPLETED REQUEST TABLE                                      * 00049000
049200*  THIS ARRAY CONTAINS THE KEYS OF BRT REQUESTS WAITING TO      * 00049100
049300*  BE MARKED COMPLETE.  RESTARTABLE PROGRAMS MUST SAVE IT       * 00049200
049400*  WHEN A CHECKPOINT IS TAKEN.                                  * 00049300
049500*  YOU MAY CHANGE THE VALUES AND NUMBER OF OCCURRENCES HERE.    * 00049400
049600*                                                               * 00049500
049700***************************************************************** 00049600
049800*                                                                 00049700
049900 01  WS-COMPLETED-RQST-TABLE.                                     00049800
050000     05  WS-COMPLETED-RQST           OCCURS 250 TIMES             00049900
050100                                     INDEXED BY WS-CR-IDX.        00050000
050200         10  WS-COMPLETED-RQST-TYPE  PIC X(08).                   00050100
050300         10  WS-COMPLETED-RQST-DATE  PIC X(08).                   00050200
050400         10  WS-COMPLETED-RQST-TIME  PIC X(06).                   00050300
050500         10  WS-COMPLETED-RQST-SEQ   PIC X(02).                   00050400
050600     05  WS-COMPLETED-RQST-FLOOR     PIC X(08)                    00050500
050700                                     VALUE HIGH-VALUES.           00050600
050800                                                                  00050700
050900 01  WS-RQST-TABLE-CONTROLS.                                      00050800
051000     05  WS-COMPLETED-RQST-LIMIT     PIC S9(3) COMP-3             00050900
051100                                     VALUE +250.                  00051000
051200     05  WS-COMPLETED-RQST-LENGTH    PIC S9(5) COMP               00051100
051300                                     VALUE +6000.                 00051200
051400     EJECT                                                        00051300
051500 01  FILLER                     PIC X(22)                         00051400
051600                                VALUE "BEGIN MISC PROGRAM WS".    00051500
051700                                                                  00051600
051800 01  WS-MISCELLANEOUS-FIELDS.                                     00051700
051900     05  WS-APPL-SAVE-AREA.                                       00051800
052000         10 WS-GSAM-ISRT-CNT          PIC  9(09) COMP.            00051900
052100         10 WS-SMMPE29-SEL-CNT        PIC  9(09) COMP.            00052000
052200         10 WS-SMMPE29-DLET-CNT       PIC  9(09) COMP.            00052100
052300         10 WS-SMMPD68-SEL-CNT        PIC  9(09) COMP.            00052200
052400         10 WS-SMMPD59-ISRT-CNT       PIC  9(09) COMP.            00052300
052500         10 WS-SMMPD55-ISRT-CNT       PIC  9(09) COMP.            00052400
052600         10 WS-SMMPD55-SEL-CNT        PIC  9(09) COMP.            00052500
052700         10 WS-SMMPD55-UPDT-CNT       PIC  9(09) COMP.            00052600
052800         10 WS-SMMPD60-ISRT-CNT       PIC  9(09) COMP.            00052700
052900         10 WS-SMMPD60-UPDT-CNT       PIC  9(09) COMP.            00052800
053000         10 WS-SMMPD81-SEL-CNT        PIC  9(09) COMP.            00052900
053100         10 WS-SMMPD81-DEL-CNT       PIC  9(09) COMP.             00053000
053200         10 WS-CURRENT-DATE           PIC  X(10).                 00053100
053300         10 WS-ISO-DATE               PIC  X(10).                 00053200
053400         10 WS-CURRENT-TIME           PIC  X(08).                 00053300
053500         10 FILLER                    PIC  X(24).                 00053400
053600     05  WS-APPL-MISC-AREA.                                       00053500
053700         10 WS-D68-INDEX.                                         00053600
053800            15 WS-D68-VEHTYPE         PIC  X(01).                 00053700
053900            15 WS-D68-PTEIO-ORIGIN    PIC  X(04).                 00053800
054000            15 WS-D68-VEHICLE-LINE    PIC  X(02).                 00053900
054100            15 WS-D68-VAMY-MDLYR      PIC  S9(4) COMP.            00054000
054200            15 WS-D68-REGINT-C        PIC  X(01).                 00054100
054300                                                                  00054200
054400         10 WS-D81-INDEX.                                         00054300
054500            15 WS-D81-ENGNRG-PART-R   PIC X(30).                  00054400
054600            15 WS-D81-EIO-ORIGIN-C    PIC X(4).                   00054500
054700            15 WS-D81-ENGP-SEQ-R      PIC S9(4) USAGE COMP.       00054600
054800            15 WS-D81-MKINT-CNTRY     PIC X(5).                   00054700
054900                                                                  00054800
055000         10 WS-SPACES                 PIC  X(01) VALUE " ".       00054900
055100         10 WS-D68-PROD-END-Y         PIC  X(10).                 00055000
055200         10 WS-D68-PROD-START-Y       PIC  X(10).                 00055100
055201*FIX1 STARTS
055202         10 WS-MMEA-START-DT          PIC  X(10).                 00055100
055203         10 WS-MMEA-END-DT            PIC  X(10).                 00055100
055204*FIX1 ENDS
055300         10 WS-TEMP-REC-STAT          PIC  X(01) VALUE "F".       00055200
055400         10 WS-NUM-MDLYR              PIC  9(04) VALUE ZERO.      00055300
055500         10 WS-EXISTS                 PIC X(01) VALUE SPACES.     00055400
055600                                                                  00055500
055700 01 WS-WORKING-VAR.                                               00055600
055800    05 WS-MNR-FEATR-CD              PIC X(05) VALUE SPACES.       00055700
055900    05 WS-MNRFTR-CD                 PIC X(05) VALUE SPACES.       00055800
056000    05 WS-PRM-FEATR-CD              PIC X(02) VALUE SPACES.       00055900
056100    05 WS-PRM-SRC-CD                PIC X(01) VALUE SPACES.       00056000
056200    05 WS-PRM-VAL-CD                PIC X(02) VALUE SPACES.       00056100
056300    05 WS-MNR-SRC-CD                PIC X(01) VALUE SPACES.       00056200
056400    05 WS-NGTV-TRTRY                PIC X(05) VALUE SPACES.       00056300
056500    05 WS-EFF-C                     PIC X(16) VALUE SPACES.       00056400
056600    05 WS-VALID-FIELD-C.                                          00056500
056700       10 WS-D55-PROD-TYPE          PIC X(01) VALUE SPACES.       00056600
056800       10 WS-D55-VEH-LINE           PIC X(02) VALUE SPACES.       00056700
056900       10 FILLER                    PIC X(01) VALUE SPACES.       00056800
057000       10 WS-D55-MODEL-YEAR         PIC 9(04) VALUE ZEROES.       00056900
057100       10 FILLER                    PIC X(01) VALUE SPACES.       00057000
057200       10 WS-D55-REGION             PIC X(01) VALUE SPACES.       00057100
057300    05 WS-VALID-DESC-X.                                           00057200
057400       10 WS-D55-START-DATE         PIC X(10) VALUE SPACES.       00057300
057500       10 FILLER                    PIC X(01) VALUE SPACES.       00057400
057600       10 WS-D55-END-DATE           PIC X(10) VALUE SPACES.       00057500
057700       10 FILLER                    PIC X(01) VALUE SPACES.       00057600
057800       10 WS-D55-ORIGIN             PIC X(04) VALUE SPACES.       00057700
057900                                                                  00057800
058000    05 WS-VALID-DESC-X-UPD.                                       00057900
058100       10 WS-D55-START-DATE-UPD     PIC X(10) VALUE SPACES.       00058000
058200       10 FILLER                    PIC X(01) VALUE SPACES.       00058100
058300       10 WS-D55-END-DATE-UPD       PIC X(10) VALUE SPACES.       00058200
058400       10 FILLER                    PIC X(01) VALUE SPACES.       00058300
058500       10 WS-D55-ORIGIN-UPD         PIC X(04) VALUE SPACES.       00058400
058600                                                                  00058500
058700 01 WS-D60-INDEX.                                                 00058600
058800    05 WS-VHTY-CODE                PIC X(1).                      00058700
058900    05 WS-IO-ORIGIN-C              PIC X(4).                      00058800
059000    05 WS-VL-CODE                  PIC X(2).                      00058900
059100    05 WS-MDLYR                    PIC S9(4) USAGE COMP.          00059000
059200    05 WS-TERR-C                   PIC X(5).                      00059100
059300    05 WS-FTR-C                    PIC X(2).                      00059200
059400    05 WS-PRIFTRSRC-C              PIC X(1).                      00059300
059500    05 WS-FTR-VAL-C                PIC X(2).                      00059400
059600    05 WS-MNRFTR-C                 PIC X(5).                      00059500
059700    05 WS-MNRFTRSRC-C              PIC X(1).                      00059600
059800** START R1282190
059900*   05 WS-EFFPNTIN-Y               PIC X(10).                     00059700
060000    05 WS-EFFPNTIN-C               PIC X(16).                     00059700
060100** END   R1282190
060200                                                                  00059800
060300 01  WS-SWITCHES.                                                 00059900
060400     05  OK-TO-PROCESS-SW             PIC  X(01).                 00060000
060500         88  OK-TO-PROCESS                       VALUE "Y".       00060100
060600         88  NOT-OK-TO-PROCESS                   VALUE "N".       00060200
060700     05  END-OF-SRVC-PART-CSR-SW      PIC  X(01).                 00060300
060800         88  NOT-END-OF-SRVC-PART-CSR            VALUE "N".       00060400
060900         88  END-OF-SRVC-PART-CSR                VALUE "Y".       00060500
061000     05  END-OF-PDC-CSR-SW            PIC  X(01).                 00060600
061100         88  NOT-END-OF-PDC-CSR                  VALUE "N".       00060700
061200         88  END-OF-PDC-CSR                      VALUE "Y".       00060800
061300     05  END-MAIN-CURSOR-SW           PIC X(01)  VALUE "N".       00060900
061400         88  END-MAIN-CURSOR                     VALUE "Y".       00061000
061500         88  NOT-END-MAIN-CURSOR                 VALUE "N".       00061100
061600    05   WS-END-OF-SMMPD60-CSR-SW     PIC X(1)   VALUE "N".       00061200
061700         88  END-OF-D60-CSR                      VALUE "Y".       00061300
061800         88  NOT-END-OF-D60-CSR                  VALUE "N".       00061400
061900    05   WS-END-OF-SMMPD81-CSR-SW     PIC X(1)   VALUE "N".       00061500
062000         88  END-OF-D81-CSR                      VALUE "Y".       00061600
062100         88  NOT-END-OF-D81-CSR                  VALUE "N".       00061700
062200    05 WS-ERROR-IND                 PIC X(01) VALUE 'N'.          00061800
062300       88 WS-88-NO-ERROR                  VALUE 'N'.              00061900
062400       88 WS-88-ERROR                     VALUE 'Y'.              00062000
062500    05 WS-D59ROW-IND                PIC X(01) VALUE 'N'.          00062100
062600       88 WS-88-D59ROW-FOUND              VALUE  'Y'.             00062200
062700       88 WS-88-D59ROW-NOT-FOUND          VALUE  'N'.             00062300
062800                                                                  00062400
062900                                                                  00062500
063000 01  WS-AUDIT-RECORD-TOTAL.                                       00062600
063100     05 WS-MMP-CHAR-CNTL              PIC  X(01).                 00062700
063200     05 WS-AUDIT-RECORD               PIC  X(80) VALUE SPACES.    00062800
063300                                                                  00062900
063400 01  WS-LITERAL-FIELDS.                                           00063000
063500     05  LIT-PARAGRAPH-3900M          PIC  X(05) VALUE "3900M".   00063100
063600     05  LIT-PARAGRAPH-3950M          PIC  X(05) VALUE "3950M".   00063200
063700     05  LIT-PARAGRAPH-4000M          PIC  X(05) VALUE "4000M".   00063300
063800     05  LIT-PARAGRAPH-4100M          PIC  X(05) VALUE "4100M".   00063400
063900     05  LIT-PARAGRAPH-4200M          PIC  X(05) VALUE "4200M".   00063500
064000     05  LIT-PARAGRAPH-4210M          PIC  X(05) VALUE "4210M".   00063600
064100     05  LIT-PARAGRAPH-4220M          PIC  X(05) VALUE "4220M".   00063700
064200     05  LIT-PARAGRAPH-4230M          PIC  X(05) VALUE "4230M".   00063800
064300     05  LIT-PARAGRAPH-4300M          PIC  X(05) VALUE "4300M".   00063900
064400     05  LIT-PARAGRAPH-4310M          PIC  X(05) VALUE "4310M".   00064000
064500     05  LIT-PARAGRAPH-4320M          PIC  X(05) VALUE "4320M".   00064100
064600     05  LIT-PARAGRAPH-4330M          PIC  X(05) VALUE "4330M".   00064200
064700     05  LIT-PARAGRAPH-4400M          PIC  X(05) VALUE "4400M".   00064300
064800     05  LIT-PARAGRAPH-4410M          PIC  X(05) VALUE "4410M".   00064400
064900     05  LIT-PARAGRAPH-4420M          PIC  X(05) VALUE "4420M".   00064500
065000     05  LIT-PARAGRAPH-4430M          PIC  X(05) VALUE "4430M".   00064600
065100     05  LIT-PARAGRAPH-4510M          PIC  X(05) VALUE "4510M".   00064700
065200     05  LIT-PARAGRAPH-4520M          PIC  X(05) VALUE "4520M".   00064800
065300     05  LIT-PARAGRAPH-4530M          PIC  X(05) VALUE "4530M".   00064900
065400     05  LIT-PARAGRAPH-4610M          PIC  X(05) VALUE "4610M".   00065000
065500     05  LIT-PARAGRAPH-4620M          PIC  X(05) VALUE "4620M".   00065100
065600     05  LIT-PARAGRAPH-4630M          PIC  X(05) VALUE "4630M".   00065200
065700     05  LIT-PARAGRAPH-4710M          PIC  X(05) VALUE "4710M".   00065300
065800     05  LIT-PARAGRAPH-4720M          PIC  X(05) VALUE "4720M".   00065400
065900     05  LIT-PARAGRAPH-4730M          PIC  X(05) VALUE "4730M".   00065500
066000     05  LIT-PARAGRAPH-4800M          PIC  X(05) VALUE "4800M".   00065600
066100     05  LIT-PARAGRAPH-4820M          PIC  X(05) VALUE "4820M".   00065700
066200     05  LIT-PARAGRAPH-4840M          PIC  X(05) VALUE "4840M".   00065800
066300     05  LIT-PARAGRAPH-5000M          PIC  X(05) VALUE "5000M".   00065900
066400     05  LIT-PARAGRAPH-5100M          PIC  X(05) VALUE "5100M".   00066000
066500     05  LIT-PARAGRAPH-5150M          PIC  X(05) VALUE "5150M".   00066100
066600     05  LIT-PARAGRAPH-5190M          PIC  X(05) VALUE "5190M".   00066200
066700     05  LIT-PARAGRAPH-5200M          PIC  X(05) VALUE "5200M".   00066300
066800     05  LIT-PARAGRAPH-5210M          PIC  X(05) VALUE "5210M".   00066400
066900     05  LIT-PARAGRAPH-5250M          PIC  X(05) VALUE "5250M".   00066500
067000     05  LIT-PARAGRAPH-5290M          PIC  X(05) VALUE "5290M".   00066600
067100     05  LIT-PARAGRAPH-5300M          PIC  X(05) VALUE "5300M".   00066700
067200     05  LIT-PARAGRAPH-5310M          PIC  X(05) VALUE "5310M".   00066800
067300     05  LIT-PARAGRAPH-5320M          PIC  X(05) VALUE "5320M".   00066900
067400     05  LIT-PARAGRAPH-5340M          PIC  X(05) VALUE "5340M".   00067000
067500     05  LIT-PARAGRAPH-5350M          PIC  X(05) VALUE "5350M".   00067100
067600     05  LIT-PARAGRAPH-5380M          PIC  X(05) VALUE "5380M".   00067200
067700     05  LIT-PARAGRAPH-5390M          PIC  X(05) VALUE "5390M".   00067300
067800     05  LIT-PARAGRAPH-5512M          PIC  X(05) VALUE "5512M".   00067400
067900     05  LIT-PARAGRAPH-5520M          PIC  X(05) VALUE "5520M".   00067500
068000     05  LIT-PARAGRAPH-5610M          PIC  X(05) VALUE "5610M".   00067600
068100     05  LIT-PARAGRAPH-5620M          PIC  X(05) VALUE "5620M".   00067700
068200     05  LIT-PARAGRAPH-5630M          PIC  X(05) VALUE "5630M".   00067800
068300     05  LIT-PARAGRAPH-5640M          PIC  X(05) VALUE "5640M".   00067900
068310     05  LIT-PARAGRAPH-8300M          PIC  X(05) VALUE "8300M".   00067900
068400     05  LIT-PARAGRAPH-8500M          PIC  X(05) VALUE "8500M".   00068000
068500     05  LIT-PARAGRAPH-8510M          PIC  X(05) VALUE "8510M".   00068100
068600     05  LIT-PARAGRAPH-8520M          PIC  X(05) VALUE "8520M".   00068200
068700     05  LIT-GSAM1                    PIC  X(21) VALUE            00068300
068800         "AUDIT FILE      ".                                      00068400
068900     05  LIT-GSAM2                    PIC  X(25) VALUE            00068500
069000         "CHANGE JOURNAL STRIP FILE".                             00068600
069100     05  LIT-BAD-DATERTN-CALL         PIC  X(70) VALUE            00068700
069200         "DATE ROUTINE CALL RETURNED A INVALID DATE ROUTINE CODE".00068800
069300     05  LIT-INVALID-OPEN-CALL        PIC  X(70) VALUE            00068900
069400         "INVALID OPEN CALL".                                     00069000
069500     05  LIT-INVALID-FETCH-CALL       PIC  X(70) VALUE            00069100
069600         "INVALID FETCH CALL".                                    00069200
069700     05  LIT-INVALID-SELECT-CALL      PIC  X(70) VALUE            00069300
069800         "INVALID SELECT CALL".                                   00069400
069900     05  LIT-INVALID-CLOSE-CALL       PIC  X(70) VALUE            00069500
070000         "INVALID CLOSE CALL".                                    00069600
070100     05  LIT-BAD-ISRT-STATUS          PIC  X(70) VALUE            00069700
070200         "INSERT CALL RETURNED A BAD STATUS CODE".                00069800
070300     05  LIT-BAD-GN-STATUS            PIC  X(70) VALUE            00069900
070400         "GN CALL RETURNED A BAD STATUS CODE    ".                00070000
070500     05  LIT-PA0067PY                 PIC  X(08) VALUE "PA0067PY".00070100
070600     05  LIT-GB                       PIC  X(02) VALUE 'GB'.      00070200
070700     05  LIT-DE                       PIC  X(02) VALUE 'DE'.      00070300
070800     05  LIT-ES                       PIC  X(02) VALUE 'ES'.      00070400
070900     05  LIT-WERS                     PIC  X(04) VALUE 'WERS'.    00070500
071000     05  LIT-HIGHDATE                PIC X(10) VALUE '9999-12-31'.00070600
071100     05  LIT-A                        PIC  X(01) VALUE 'A'.       00070700
071200     05  LIT-I                        PIC  X(01) VALUE 'I'.       00070800
071210     05  LIT-P                        PIC  X(01) VALUE 'P'.       00070800
071300     05  LIT-C                        PIC  X(01) VALUE 'C'.       00070900
071400     05  LIT-D                        PIC  X(01) VALUE 'D'.       00071000
071500     05  LIT-E                        PIC  X(01) VALUE 'E'.       00071100
071600     05  LIT-F                        PIC  X(01) VALUE 'F'.       00071200
071700     05  LIT-N                        PIC  X(01) VALUE 'N'.       00071300
071800     05  LIT-S                        PIC  X(01) VALUE 'S'.       00071400
071900     05  LIT-Y                        PIC  X(01) VALUE 'Y'.       00071500
072000     05  LIT-SLASH                    PIC  X(01) VALUE '/'.       00071600
072100     05  LIT-AAAAA                    PIC  X(05) VALUE 'AAAAA'.   00071700
072200     05  LIT-EEEEE                    PIC  X(05) VALUE 'EEEEE'.   00071800
072300     05  LIT-NNNNN                    PIC  X(05) VALUE 'NNNNN'.   00071900
072400     05  LIT-SSSSS                    PIC  X(05) VALUE 'SSSSS'.   00072000
072500     05  WS-PGM-CHKP.                                             00072100
072600         10  WS-CHKP-UNIQUE-ID        PIC X(04) VALUE "67PY".     00072200
072700         10  WS-CHKP-ID-CTR           PIC 9(04) VALUE ZEROS.      00072300
072800     EJECT                                                        00072400
072900***************************************************************** 00072500
073000*     THE FOLLOWING AREA IS PASSED TO SEVERAL SUBROUTINES       * 00072600
073100*     FOR ABEND PROCESSING.                                     * 00072700
073200***************************************************************** 00072800
073300*                                                                 00072900
073400 01 FILLER                            PIC  X(19)                  00073000
073500                                     VALUE "BEGIN HARDCOPY-AREA". 00073100
073600     COPY  HARDCPY2.                                              00073200
073700     EJECT                                                        00073300
073800***************************************************************** 00073400
073900*     BRT INIT CALL AREA                                        * 00073500
074000*     THE FOLLOWING COPYBOOK CONTAINS THE CALL AREA PASSED TO   * 00073600
074100*     THE BATCH REQUEST INITIATION SUBROUTINE.                  * 00073700
074200***************************************************************** 00073800
074300*                                                                 00073900
074400     COPY  BRTINPRM.                                              00074000
074500     EJECT                                                        00074100
074600***************************************************************** 00074200
074700*     SEC PARM CALL AREA                                        * 00074300
074800*     THE FOLLOWING COPYBOOK CONTAINS THE CALL AREA PASSED TO   * 00074400
074900*     THE SECURITY PARM SUBROUTINE.                             * 00074500
075000***************************************************************** 00074600
075100*                                                                 00074700
075200     COPY  HWSECPRM.                                              00074800
075300     EJECT                                                        00074900
075400***************************************************************** 00075000
075500*     AAAL TABL ID AREA                                         * 00075100
075600*     THE FOLLOWING COPYBOOK CONTAINS THE CALL AREA PASSED FROM * 00075200
075700*     THE TABE IO SUBROUTINE FOR GLOBAL PARMS TABLE             * 00075300
075800***************************************************************** 00075400
075900*                                                                 00075500
076000     COPY  WSAAAL.                                                00075600
076100     EJECT                                                        00075700
076200***************************************************************** 00075800
076300*                                                               * 00075900
076400*     MAILISRT AREA                                             * 00076000
076500*                                                               * 00076100
076600***************************************************************** 00076200
076700*     THE FOLLOWING FIELD SHOULD BE MOVED TO WS-MB-MESSAGE-TYPE   00076300
076800*     WHEN SENDING A MAILBOX ABEND MESSAGE.  YOU MAY DELETE IT    00076400
076900*     IF NOT USING MAILISRT.                                      00076500
077000*                                                                 00076600
077100 01  WS-ABEND-MSG-TYPE              PIC X(04)  VALUE "    ".      00076700
077200*                                                                 00076800
077300*     THE FOLLOWING COPYBOOK CONTAINS THE CALL AREA PASSED TO     00076900
077400*     THE MAILISRT SUBROUTINE IN ORDER TO WRITE A MESSAGE TO      00077000
077500*     MAILBOX DATABASE.  YOU MAY DELETE IT IF YOU DO NOT          00077100
077600*     USE MAILISRT.                                               00077200
077700*                                                                 00077300
077800     COPY  MAILISRT.                                              00077400
077900     EJECT                                                        00077500
078000***************************************************************** 00077600
078100* AREA FOR HCHKDATA ROUTINE.  MAY BE DELETED IF CHKDATA IS      * 00077700
078200* NOT USED.                                                     * 00077800
078300***************************************************************** 00077900
078400*                                                                 00078000
078500     COPY  CHKDATA.                                               00078100
078600     EJECT                                                        00078200
078700***************************************************************** 00078300
078800* AREA FOR HDATERTN ROUTINE.  MAY BE DELETED IF HDATERTN IS     * 00078400
078900* NOT USED.                                                     * 00078500
079000***************************************************************** 00078600
079100*                                                                 00078700
079200     COPY  DATEPARM.                                              00078800
079300     EJECT                                                        00078900
079400***************************************************************** 00079000
079500*              COMMON IMS REFERENCES                            * 00079100
079600***************************************************************** 00079200
079700*                                                                 00079300
079800     COPY  COMMIMS.                                               00079400
079900                                                                  00079500
080000***************************************************************** 00079600
080100*              COMMON GSAM FUNCTION CALLS                       * 00079700
080200***************************************************************** 00079800
080300*                                                                 00079900
080400     COPY  HWS0080I.                                              00080000
080500     EJECT                                                        00080100
080600***************************************************************** 00080200
080700*              COMMON DB2 REFERENCES                            * 00080300
080800***************************************************************** 00080400
080900*                                                                 00080500
081000     COPY  COMMDB2.                                               00080600
081100     EJECT                                                        00080700
081200     05 DB2-FOREIGN-KEY-VIOLATE PIC S9(09) COMP VALUE   -530.     00080800
081300***************************************************************** 00080900
081400* COPYBOOKS FOR HTBLIO                                          * 00081000
081500*     USED IN DETERMINING:  LANGUAGE CODE, TIME ZONE AND DATE   * 00081100
081600*                   FORMAT; LTERMS TO RECEIVE ABORT MESSAGES;   * 00081200
081700***************************************************************** 00081300
081800*                                                                 00081400
081900     COPY   TBLIOWS.                                              00081500
082000     EJECT                                                        00081600
082100***************************************************************** 00081700
082200*    COPYBOOKS HWS0070 AND HWS0050 CONTAIN LITERNALS REFERENCED * 00081800
082300*    BY HTBLIO CALLS IN THE PROCEDURE DIVISION.                 * 00081900
082400***************************************************************** 00082000
082500*                                                                 00082100
082600     COPY   HWS0070I.                                             00082200
082700     COPY   HWS0050I.                                             00082300
082800     EJECT                                                        00082400
082900                                                                  00082500
083000***************************************************************** 00082600
083100* SQL COMMUNICATIONS AREA                                       * 00082700
083200***************************************************************** 00082800
083300 01  FILLER                               PIC X(14)               00082900
083400                                          VALUE "BEGIN SQLCA  ".  00083000
083500     EXEC SQL                                                     00083100
083600         INCLUDE SQLCA                                            00083200
083700     END-EXEC.                                                    00083300
083800                                                                  00083400
083900     EJECT                                                        00083500
084000 01  FILLER                               PIC X(14)               00083600
084100                                          VALUE "BEGIN SMMPE29 ". 00083700
084200     EXEC SQL                                                     00083800
084300         INCLUDE SMMPE29                                          00083900
084400     END-EXEC.                                                    00084000
084500     EJECT                                                        00084100
084600 01  FILLER                               PIC X(14)               00084200
084700                                          VALUE "BEGIN SMMPD55 ". 00084300
084800     EXEC SQL                                                     00084400
084900         INCLUDE SMMPD55                                          00084500
085000     END-EXEC.                                                    00084600
085100     EJECT                                                        00084700
085200 01  FILLER                               PIC X(14)               00084800
085300                                          VALUE "BEGIN SMMPD59 ". 00084900
085400     EXEC SQL                                                     00085000
085500         INCLUDE SMMPD59                                          00085100
085600     END-EXEC.                                                    00085200
085700     EJECT                                                        00085300
085800 01  FILLER                               PIC X(14)               00085400
085900                                          VALUE "BEGIN SMMPD60 ". 00085500
086000     EXEC SQL                                                     00085600
086100         INCLUDE SMMPD60                                          00085700
086200     END-EXEC.                                                    00085800
086300     EJECT                                                        00085900
086400 01  FILLER                               PIC X(14)               00086000
086500                                          VALUE "BEGIN SMMPD68 ". 00086100
086600     EXEC SQL                                                     00086200
086700         INCLUDE SMMPD68                                          00086300
086800     END-EXEC.                                                    00086400
086900     EJECT                                                        00086500
087000 01  FILLER                               PIC X(14)               00086600
087100                                          VALUE "BEGIN SMMPD94 ". 00086700
087200     EXEC SQL                                                     00086800
087300         INCLUDE SMMPD94                                          00086900
087400     END-EXEC.                                                    00087000
087500     EJECT                                                        00087100
087600 01  FILLER                               PIC X(14)               00087200
087700                                          VALUE "BEGIN SMMPD81 ". 00087300
087800     EXEC SQL                                                     00087400
087900         INCLUDE SMMPD81                                          00087500
088000     END-EXEC.                                                    00087600
088100     EJECT                                                        00087700
088200 01  FILLER                               PIC X(14)               00087800
088300                                          VALUE "BEGIN SIBM    ". 00087900
088400     EXEC SQL                                                     00088000
088500         INCLUDE SIBM                                             00088100
088600     END-EXEC.                                                    00088200
088700     EJECT                                                        00088300
088800******************************************************************00088400
088900*  SELECT SMMPE29_CHG_JORNAL BY PGM-ID, TBL-N AND ACTN-C          00088500
089000******************************************************************00088600
089100     EXEC SQL                                                     00088700
089200      DECLARE  CHG-JRNL-CSR CURSOR WITH HOLD FOR                  00088800
089300                                                                  00088900
089400       SELECT  PCER_PGM_ID_R                                      00089000
089500              ,PCER_TBL_N                                         00089100
089600              ,PCER_ATTR_N                                        00089200
089700              ,PCCJ_ROW_KEY_N                                     00089300
089800              ,PCER_ACTN_C                                        00089400
089900              ,PCCJ_OLD_ATTR_D                                    00089500
090000              ,PCCJ_NEW_ATTR_D                                    00089600
090100              ,PCCJ_UPDT_S                                        00089700
090200              ,PCCJ_UPDT_PGM_ID_R                                 00089800
090300              ,P_LAST_UPDATE_S                                    00089900
090400              ,P_LAST_UPDATE_C                                    00090000
090500         FROM SMMPE29_CHG_JORNAL                                  00090100
090600        WHERE PCER_PGM_ID_R          = :LIT-PA0067PY              00090200
090610*******US3708170****START
090620        ORDER BY P_LAST_UPDATE_S
090621        WITH UR
090630*******US3708170****END
090700     END-EXEC.                                                    00090300
090800     EJECT                                                        00090400
090900                                                                  00090500
091000     EXEC SQL                                                     00090600
091100      DECLARE  D60-SEL-CSR CURSOR WITH HOLD FOR                   00090700
091200       SELECT  DISTINCT D60.VEHTYPE_CODE                          00090800
091300               ,D60.PTEIO_ORIGIN_C                                00090900
091400               ,D60.EVL_VEHICLE_LINE_C                            00091000
091500               ,MMPD60_TERR_C                                     00091100
091600               ,MMPD60_FTR_C                                      00091200
091700               ,MMPD60_PRIFTRSRC_C                                00091300
091800               ,MMPD60_FTR_VAL_C                                  00091400
091900               ,MMPD60_MNRFTR_C                                   00091500
092000               ,MMPD60_MNRFTRSRC_C                                00091600
092100               ,MMPD60_EFFPNTIN_Y                                 00091700
092200               ,MMPD60_XCLUD_LST_F                                00091800
092300               ,MMPD60_REMARK_DS_X                                00091900
092400               ,MMPD60_EFFPNTIN_C                                 00092000
092500               ,MMPD60_EFFPNTOUT_Y                                00092100
092600               ,MMPD60_EFFPNTOUT_C                                00092200
092700               ,MMPD60_REC_STAT_C                                 00092300
092800         FROM  SMMPD68_ENG_PT_MY   D68,                           00092400
092900               SMMPD60_TERTRY_FTR  D60,                           00092500
093000               SMMPD94_CNTRY_XREF  D94                            00092600
093100         WHERE D68.VEHTYPE_CODE        =  D60.VEHTYPE_CODE        00092700
093200          AND  D68.PTEIO_ORIGIN_C      =  D60.PTEIO_ORIGIN_C      00092800
093300          AND  D68.EVL_VEHICLE_LINE_C  =  D60.EVL_VEHICLE_LINE_C  00092900
093400          AND  D68.REGINT_C            =  D94.LEAD_REGION         00093000
093500          AND  D60.MMPD60_TERR_C       =  D94.MNRFTR_C            00093100
093600          AND  D60.MMPD60_EFFPNTOUT_Y >= :SMMPD68.VAMY-PROD-STRT-Y00093200
093700          AND  D60.MMPD60_EFFPNTIN_Y  <= :SMMPD68.VAMY-PROD-END-Y 00093300
093800          AND  D68.VEHTYPE_CODE        = :SMMPD68.VEHTYPE-CODE    00093400
093900          AND  D68.PTEIO_ORIGIN_C      = :SMMPD68.PTEIO-ORIGIN-C  00093500
094000          AND  D68.EVL_VEHICLE_LINE_C  =                          00093600
094100                                :SMMPD68.EVL-VEHICLE-LINE-C       00093700
094200          AND D68.REGINT_C             = :SMMPD68.REGINT-C        00093800
094300          AND  D60.MMPD59_MDLYR_Y      = :WS-MDLYR                00093900
094400     END-EXEC.                                                    00094000
094500     EJECT                                                        00094100
094600                                                                  00094200
094700     EXEC SQL                                                     00094300
094800      DECLARE  D60-CSR-DELCJ CURSOR WITH HOLD FOR                 00094400
094900       SELECT  DISTINCT D60.VEHTYPE_CODE                          00094500
095000               ,D60.PTEIO_ORIGIN_C                                00094600
095100               ,D60.EVL_VEHICLE_LINE_C                            00094700
095200               ,D60.MMPD59_MDLYR_Y                                00094800
095300               ,MMPD60_TERR_C                                     00094900
095400               ,MMPD60_FTR_C                                      00095000
095500               ,MMPD60_PRIFTRSRC_C                                00095100
095600               ,MMPD60_FTR_VAL_C                                  00095200
095700               ,MMPD60_MNRFTR_C                                   00095300
095800               ,MMPD60_MNRFTRSRC_C                                00095400
095900               ,MMPD60_EFFPNTIN_Y                                 00095500
096000               ,MMPD60_XCLUD_LST_F                                00095600
096100               ,MMPD60_REMARK_DS_X                                00095700
096200               ,MMPD60_EFFPNTIN_C                                 00095800
096300               ,MMPD60_EFFPNTOUT_Y                                00095900
096400               ,MMPD60_EFFPNTOUT_C                                00096000
096500               ,MMPD60_REC_STAT_C                                 00096100
096600         FROM  SMMPD60_TERTRY_FTR  D60,                           00096200
096700               SMMPD94_CNTRY_XREF  D94                            00096300
096800         WHERE D60.VEHTYPE_CODE        = :WS-D68-VEHTYPE          00096400
096900          AND  D60.PTEIO_ORIGIN_C      = :WS-D68-PTEIO-ORIGIN     00096500
097000          AND  D60.EVL_VEHICLE_LINE_C  = :WS-D68-VEHICLE-LINE     00096600
097100          AND  D60.MMPD59_MDLYR_Y      = :WS-MDLYR                00096700
097200          AND  D60.MMPD60_REC_STAT_C   IN ("A","P")               00096800
097300          AND  D60.MMPD60_TERR_C       =  D94.MNRFTR_C            00096900
097400          AND  D94.LEAD_REGION         = :WS-D68-REGINT-C         00097000
097500          FOR UPDATE OF MMPD60_REC_STAT_C                         00097100
097600                       ,MMPD60_LAST_UPD_S                         00097200
097700                       ,MMPD60_LAST_UPD_C                         00097300
097800     END-EXEC.                                                    00097400
097900     EJECT                                                        00097500
098000                                                                  00097600
098010*FIX1 STARTS
098100****** WHEN NEW END DATE IS LESS THAN D68 OLD END DATE ******     00097700
098200     EXEC SQL                                                     00097800
098300      DECLARE  D60-CSR-CHGEND CURSOR WITH HOLD FOR                00097900
098400       SELECT  DISTINCT D60.VEHTYPE_CODE                          00098000
098500               ,D60.PTEIO_ORIGIN_C                                00098100
098600               ,D60.EVL_VEHICLE_LINE_C                            00098200
098700               ,MMPD60_TERR_C                                     00098300
098800               ,MMPD60_FTR_C                                      00098400
098900               ,MMPD60_PRIFTRSRC_C                                00098500
099000               ,MMPD60_FTR_VAL_C                                  00098600
099100               ,MMPD60_MNRFTR_C                                   00098700
099200               ,MMPD60_MNRFTRSRC_C                                00098800
099300               ,MMPD60_EFFPNTIN_Y                                 00098900
099400               ,MMPD60_XCLUD_LST_F                                00099000
099500               ,MMPD60_REMARK_DS_X                                00099100
099600               ,MMPD60_EFFPNTIN_C                                 00099200
099700               ,MMPD60_EFFPNTOUT_Y                                00099300
099800               ,MMPD60_EFFPNTOUT_C                                00099400
099900               ,MMPD60_REC_STAT_C                                 00099500
100000         FROM  SMMPD60_TERTRY_FTR  D60,                           00099600
100100               SMMPD94_CNTRY_XREF  D94                            00099700
100200         WHERE D60.VEHTYPE_CODE        = :WS-D68-VEHTYPE          00099800
100300          AND  D60.PTEIO_ORIGIN_C      = :WS-D68-PTEIO-ORIGIN     00099900
100400          AND  D60.EVL_VEHICLE_LINE_C  = :WS-D68-VEHICLE-LINE     00100000
100500          AND  D60.MMPD60_TERR_C       =  D94.MNRFTR_C            00100100
100600          AND  D94.LEAD_REGION         = :WS-D68-REGINT-C         00100200
100700          AND  D60.MMPD59_MDLYR_Y      = :WS-MDLYR                00100300
100800          AND  D60.MMPD60_EFFPNTOUT_Y >= :SMMPD68.VAMY-PROD-STRT-Y00100400
100900          AND  D60.MMPD60_EFFPNTIN_Y  <= :WS-MMEA-END-DT          00100500
101100     END-EXEC.                                                    00100700
101200     EJECT                                                        00100800
101300                                                                  00100900
101400****** WHEN NEW END DATE IS GREATER THAN D68 OLD END DATE ******  00101000
101500*    EXEC SQL                                                     00101100
101600*     DECLARE  D60-CSR-CHGCJ2 CURSOR WITH HOLD FOR                00101200
101700*      SELECT  DISTINCT D60.VEHTYPE_CODE                          00101300
101800*              ,D60.PTEIO_ORIGIN_C                                00101400
101900*              ,D60.EVL_VEHICLE_LINE_C                            00101500
102000*              ,MMPD60_TERR_C                                     00101600
102100*              ,MMPD60_FTR_C                                      00101700
102200*              ,MMPD60_PRIFTRSRC_C                                00101800
102300*              ,MMPD60_FTR_VAL_C                                  00101900
102400*              ,MMPD60_MNRFTR_C                                   00102000
102500*              ,MMPD60_MNRFTRSRC_C                                00102100
102600*              ,MMPD60_EFFPNTIN_Y                                 00102200
102700*              ,MMPD60_XCLUD_LST_F                                00102300
102800*              ,MMPD60_REMARK_DS_X                                00102400
102900*              ,MMPD60_EFFPNTIN_C                                 00102500
103000*              ,MMPD60_EFFPNTOUT_Y                                00102600
103100*              ,MMPD60_EFFPNTOUT_C                                00102700
103200*              ,MMPD60_REC_STAT_C                                 00102800
103300*        FROM  SMMPD60_TERTRY_FTR  D60,                           00102900
103400*              SMMPD94_CNTRY_XREF  D94                            00103000
103500*        WHERE D60.VEHTYPE_CODE        = :WS-D68-VEHTYPE          00103100
103600*         AND  D60.PTEIO_ORIGIN_C      = :WS-D68-PTEIO-ORIGIN     00103200
103700*         AND  D60.EVL_VEHICLE_LINE_C  = :WS-D68-VEHICLE-LINE     00103300
103800*         AND  D60.MMPD60_TERR_C       =  D94.MNRFTR_C            00103400
103900*         AND  D94.LEAD_REGION         = :WS-D68-REGINT-C         00103500
104000*         AND  D60.MMPD59_MDLYR_Y      = :WS-MDLYR                00103600
104100*         AND  D60.MMPD60_EFFPNTOUT_Y >= :SMMPD68.VAMY-PROD-STRT-Y00103700
104200*         AND  D60.MMPD60_EFFPNTIN_Y  <= :SMMPD68.VAMY-PROD-END-Y 00103800
104300*         AND  D60.MMPD60_EFFPNTIN_Y  >= :WS-D68-PROD-END-Y       00103900
104400*         AND  D60.MMPD60_REC_STAT_C   IN ("I","F")               00104000
104500*    END-EXEC.                                                    00104100
104600*    EJECT                                                        00104200
104700****** WHEN NEW START DATE IS LESS THAN D68 OLD START DATE ****** 00104300
104800*    EXEC SQL                                                     00104400
104900*     DECLARE  D60-CSR-CHGCJ3 CURSOR WITH HOLD FOR                00104500
105000*      SELECT  DISTINCT D60.VEHTYPE_CODE                          00104600
105100*              ,D60.PTEIO_ORIGIN_C                                00104700
105200*              ,D60.EVL_VEHICLE_LINE_C                            00104800
105300*              ,MMPD60_TERR_C                                     00104900
105400*              ,MMPD60_FTR_C                                      00105000
105500*              ,MMPD60_PRIFTRSRC_C                                00105100
105600*              ,MMPD60_FTR_VAL_C                                  00105200
105700*              ,MMPD60_MNRFTR_C                                   00105300
105800*              ,MMPD60_MNRFTRSRC_C                                00105400
105900*              ,MMPD60_EFFPNTIN_Y                                 00105500
106000*              ,MMPD60_XCLUD_LST_F                                00105600
106100*              ,MMPD60_REMARK_DS_X                                00105700
106200*              ,MMPD60_EFFPNTIN_C                                 00105800
106300*              ,MMPD60_EFFPNTOUT_Y                                00105900
106400*              ,MMPD60_EFFPNTOUT_C                                00106000
106500*              ,MMPD60_REC_STAT_C                                 00106100
106600*        FROM  SMMPD60_TERTRY_FTR  D60,                           00106200
106700*              SMMPD94_CNTRY_XREF  D94                            00106300
106800*        WHERE D60.VEHTYPE_CODE        = :WS-D68-VEHTYPE          00106400
106900*         AND  D60.PTEIO_ORIGIN_C      = :WS-D68-PTEIO-ORIGIN     00106500
107000*         AND  D60.EVL_VEHICLE_LINE_C  = :WS-D68-VEHICLE-LINE     00106600
107100*         AND  D60.MMPD60_TERR_C       =  D94.MNRFTR_C            00106700
107200*         AND  D94.LEAD_REGION         = :WS-D68-REGINT-C         00106800
107300*         AND  D60.MMPD59_MDLYR_Y      = :WS-MDLYR                00106900
107400*         AND  D60.MMPD60_EFFPNTOUT_Y >= :SMMPD68.VAMY-PROD-STRT-Y00107000
107500*         AND  D60.MMPD60_EFFPNTOUT_Y <= :WS-D68-PROD-START-Y     00107100
107600*         AND  D60.MMPD60_EFFPNTIN_Y  <= :SMMPD68.VAMY-PROD-END-Y 00107200
107700*         AND  D60.MMPD60_REC_STAT_C   IN ("I","F")               00107300
107800*    END-EXEC.                                                    00107400
107900*    EJECT                                                        00107500
108000                                                                  00107600
108100**** WHEN NEW START DATE IS GREATER THAN D68 OLD START DATE ****  00107700
108200     EXEC SQL                                                     00107800
108300      DECLARE  D60-CSR-CHGST CURSOR WITH HOLD FOR                 00107900
108400       SELECT  DISTINCT D60.VEHTYPE_CODE                          00108000
108500               ,D60.PTEIO_ORIGIN_C                                00108100
108600               ,D60.EVL_VEHICLE_LINE_C                            00108200
108700               ,MMPD60_TERR_C                                     00108300
108800               ,MMPD60_FTR_C                                      00108400
108900               ,MMPD60_PRIFTRSRC_C                                00108500
109000               ,MMPD60_FTR_VAL_C                                  00108600
109100               ,MMPD60_MNRFTR_C                                   00108700
109200               ,MMPD60_MNRFTRSRC_C                                00108800
109300               ,MMPD60_EFFPNTIN_Y                                 00108900
109400               ,MMPD60_XCLUD_LST_F                                00109000
109500               ,MMPD60_REMARK_DS_X                                00109100
109600               ,MMPD60_EFFPNTIN_C                                 00109200
109700               ,MMPD60_EFFPNTOUT_Y                                00109300
109800               ,MMPD60_EFFPNTOUT_C                                00109400
109900               ,MMPD60_REC_STAT_C                                 00109500
110000         FROM  SMMPD60_TERTRY_FTR  D60,                           00109600
110100               SMMPD94_CNTRY_XREF  D94                            00109700
110200         WHERE D60.VEHTYPE_CODE        = :WS-D68-VEHTYPE          00109800
110300          AND  D60.PTEIO_ORIGIN_C      = :WS-D68-PTEIO-ORIGIN     00109900
110400          AND  D60.EVL_VEHICLE_LINE_C  = :WS-D68-VEHICLE-LINE     00110000
110500          AND  D60.MMPD60_TERR_C       =  D94.MNRFTR_C            00110100
110600          AND  D94.LEAD_REGION         = :WS-D68-REGINT-C         00110200
110700          AND  D60.MMPD59_MDLYR_Y      = :WS-MDLYR                00110300
110800          AND  D60.MMPD60_EFFPNTOUT_Y >= :WS-MMEA-START-DT        00110400
110900          AND  D60.MMPD60_EFFPNTIN_Y  <= :SMMPD68.VAMY-PROD-END-Y 00110500
111100     END-EXEC.                                                    00110700
111110*FIX1 ENDS
111200*    EXEC SQL                                                     00110800
111300*     DECLARE  D81-DEL-CSR    CURSOR WITH HOLD FOR                00110900
111400*        SELECT ENGP_ENGNRG_PART_R                                00111000
111500*              ,EIO_ORIGIN_C                                      00111100
111600*              ,ENGP_SEQ_R                                        00111200
111700*              ,MKINT_CNTRY_FTR_C                                 00111300
111800*              ,VEHTYPE_CODE                                      00111400
111900*              ,PTEIO_ORIGIN_C                                    00111500
112000*              ,EVL_VEHICLE_LINE_C                                00111600
112100*              ,MKINT_MD_SE_FTR_C                                 00111700
112200*              ,VAMY_MDLYR_R                                      00111800
112300*              ,D81.P_LAST_UPDATE_S                               00111900
112400*              ,D81.P_LAST_UPDATE_C                               00112000
112500*        FROM SMMPD81_MKT_INTNT   D81,                            00112100
112600*             SMMPD94_CNTRY_XREF  D94                             00112200
112700*        WHERE D81.MKINT_CNTRY_FTR_C =  D94.MNRFTR_C              00112300
112800*          AND VEHTYPE_CODE          = :WS-D68-VEHTYPE            00112400
112900*          AND PTEIO_ORIGIN_C        = :WS-D68-PTEIO-ORIGIN       00112500
113000*          AND EVL_VEHICLE_LINE_C    = :WS-D68-VEHICLE-LINE       00112600
113100*          AND VAMY_MDLYR_R          = :WS-MDLYR                  00112700
113200*          AND D94.LEAD_REGION       = :WS-D68-REGINT-C           00112800
113300*    END-EXEC.                                                    00112900
113400     EJECT                                                        00113000
113500 LINKAGE SECTION.                                                 00113100
113600***************************************************************** 00113200
113700*                   LINKAGE SECTION                             * 00113300
113800***************************************************************** 00113400
113900*                                                                 00113500
114000     COPY  STMPPPCB.                                              00113600
114100                                                                  00113700
114200 01  PCB-BATCH-RQST.                                              00113800
114300     05  PCB-BRT-DBDNAME            PIC X(8).                     00113900
114400     05  PCB-BRT-SEG-LEVEL          PIC X(2).                     00114000
114500     05  PCB-BRT-STATUS-CODE        PIC X(2).                     00114100
114600     05  PCB-BRT-PROC-OPTIONS       PIC X(4).                     00114200
114700     05  PCB-BRT-DLI-RES            PIC X(4).                     00114300
114800     05  PCB-BRT-SEG-NAME-FB        PIC X(8).                     00114400
114900     05  PCB-BRT-LENGTH-FD-KEY      PIC X(4).                     00114500
115000     05  PCB-BRT-NUMB-SENS-SEGS     PIC X(4).                     00114600
115100     05  PCB-BRT-FB-KEY             PIC X(24).                    00114700
115200                                                                  00114800
115300     COPY  HPCBGSAM.                                              00114900
115400***                                  ***                          00115000
115500*** ADDITIONAL PROGRAM PCB-S GO HERE ***                          00115100
115600***                                  ***                          00115200
115700     EJECT                                                        00115300
115800                                                                  00115400
115900     COPY  HWS0990I.                                              00115500
116000     EJECT                                                        00115600
116100                                                                  00115700
116200 PROCEDURE DIVISION.                                              00115800
116300                                                                  00115900
116400     ENTRY  "DLITCBL"  USING  IO-PCB                              00116000
116500                              ALT1-PCB                            00116100
116600                              ALT2-PCB                            00116200
116700                              ALT3-PCB                            00116300
116800                              PCB-HTABLES-GO                      00116400
116900                              PCB-HTABLES-UPDT                    00116500
117000                              PCB-HSECURITY                       00116600
117100                              PCB-HMAILBOX                        00116700
117200                              PCB-BATCH-RQST                      00116800
117300                              GS-IN-PCB1                          00116900
117400                              GS-OUT-PCB1                         00117000
117500                              GS-OUT-PCB2                         00117100
117600                              GS-OUT-PCB3.                        00117200
117700                                                                  00117300
117800     COPY  HBP0000I.                                              00117400
117900     EJECT                                                        00117500
118000     COPY  HBP0100I.                                              00117600
118100     EJECT                                                        00117700
118200     COPY  HBP0200I.                                              00117800
118300     EJECT                                                        00117900
118400     COPY  HBP0300I.                                              00118000
118500     EJECT                                                        00118100
118600     COPY  HBP0400I.                                              00118200
118700     EJECT                                                        00118300
118800     COPY  HBP0600I.                                              00118400
118900     EJECT                                                        00118500
119000     COPY  HBP0700I.                                              00118600
119100     EJECT                                                        00118700
119200     COPY  HBP1000I.                                              00118800
119300***************************************************************** 00118900
119400*                                                               * 00119000
119500*    THE IMS RESTART CALL BEGINS IN THE COPYBOOK ABOVE.  ADD    * 00119100
119600*    HERE ANY AREAS YOU SAVED WITH A CHKP IN PARAGRAPH 6120A.   * 00119200
119700*    DELETE THE REFERENCES TO AREAS YOU DON'T NEED RESTORED.    * 00119300
119800*                                                               * 00119400
119900***************************************************************** 00119500
120000*                                                                 00119600
120100                             WS-RQST-RECORD-TABLE-LENGTH          00119700
120200                             WS-RQST-RECORD-TABLE                 00119800
120300                             WS-COMPLETED-RQST-LENGTH             00119900
120400                             WS-COMPLETED-RQST-TABLE              00120000
120500******                                                            00120100
120600******                       YOUR CHKP SAVE AREA(S) HERE.         00120200
120700******                       YOU MAY DELETE THE BATCH CONTROL     00120300
120800******                       AREA AND/OR BATCH REQUEST AREA       00120400
120900******                       IF UNNECESSARY, AND THERE MAY        00120500
121000******                       BE AS MANY AS SEVEN AREAS IN ALL.    00120600
121100******                       (COPYBOOK HBP1000I USES ONE.)        00120700
121200******                                                            00120800
121300******           THE FOLLOWING LINE CONTAINS THE REQUIRED PERIOD  00120900
121400             .                                                    00121000
121500 1010A-EXIT.                                                      00121100
121600     EXIT.                                                        00121200
121700     EJECT                                                        00121300
121800     COPY  HBP1100I.                                              00121400
121900                                                                  00121500
122000     EJECT                                                        00121600
122100*===============================================================* 00121700
122200*                    1200A-APPL-SPECIFIC-INIT                   * 00121800
122300*---------------------------------------------------------------* 00121900
122400*    PERFORMED BY :  0100H-PROGRAM-INIT                         * 00122000
122500*===============================================================* 00122100
122600 1200A-APPL-SPECIFIC-INIT.                                        00122200
122700***************************************************************** 00122300
122800*                                                               * 00122400
122900*  THIS PARAGRAPH IS USED TO PERFORM ANY APPLICATION-SPECIFIC   * 00122500
123000*  GENERAL INITIALIZATION.                                      * 00122600
123100*                                                               * 00122700
123200***************************************************************** 00122800
123300*                                                                 00122900
123400***                                                               00123000
123500*** OPEN ANY OS/VS FILES USED (BMP ONLY)                          00123100
123600***                                                               00123200
123700*** ISSUE "OPEN" DL/I CALLS FOR ANY GSAM DATA BASES (BMP ONLY)    00123300
123800***                                                               00123400
123900*** IF MAILBOX IS TO BE USED, INITIALIZE FIELDS HERE.             00123500
124000***                                                               00123600
124100                                                                  00123700
124200     INITIALIZE        WS-MISCELLANEOUS-FIELDS                    00123800
124300                       WS-AUDIT-RECORD-TOTAL                      00123900
124400                       SMMPE29                                    00124000
124500                       SMMPD60                                    00124100
124600                       SMMPD68                                    00124200
124700                       SMMPD94                                    00124300
124800                                                                  00124400
124900     SET NOT-END-MAIN-CURSOR     TO TRUE                          00124500
125000                                                                  00124600
125100     PERFORM 5310M-OPEN-GSAM-AUDIT-FILE                           00124700
125200        THRU 5310M-EXIT                                           00124800
125300                                                                  00124900
125400     PERFORM 5320M-OPEN-GSAM-D81BKUP-FILE                         00125000
125500        THRU 5320M-EXIT                                           00125100
125600                                                                  00125200
125700     PERFORM 5100M-OPEN-CHG-JRNL-CURSOR                           00125300
125800        THRU 5100M-EXIT                                           00125400
125900                                                                  00125500
126000     IF  INTERNAL-RESTART                                         00125600
126100         CONTINUE                                                 00125700
126200     ELSE                                                         00125800
126300         PERFORM 3900M-GET-CURRENT-DATE-TIME                      00125900
126400         PERFORM 3950M-GET-ISO-DATE                               00126000
126500     END-IF                                                       00126100
126600     .                                                            00126200
126700 1200A-EXIT.                                                      00126300
126800     EXIT.                                                        00126400
126900     EJECT                                                        00126500
127000     COPY  HBP2000I.                                              00126600
127100                                                                  00126700
127200     EJECT                                                        00126800
127300*===============================================================* 00126900
127400*                    2100A-APPL-RESTART-INIT                    * 00127000
127500*---------------------------------------------------------------* 00127100
127600*    PERFORMED BY :  0100H-PROGRAM-INIT                         * 00127200
127700*===============================================================* 00127300
127800 2100A-APPL-RESTART-INIT.                                         00127400
127900***************************************************************** 00127500
128000*                                                               * 00127600
128100*  THIS PARAGRAPH SHOULD PERFORM ANY APPLICATION-SPECIFIC       * 00127700
128200*  INITIALIZATION TO BE DONE ON PROGRAM RESTART; E.G.,          * 00127800
128300*  REPOSITIONING IMS DATA BASES AND/OR REOPENING THE DRIVING    * 00127900
128400*  CURSOR, OR RESTORING SAVED DATA AREAS FROM THE COPIES MADE   * 00128000
128500*  AT THE TIME OF THE LAST CHECKPOINT.                          * 00128100
128600*                                                               * 00128200
128700***************************************************************** 00128300
128800*                                                                 00128400
128900***                                                               00128500
129000***  ONE POSSIBLE METHOD IS TO ISSUE A "GU" CALL USING THE        00128600
129100***  CONCATENATED KEY STORED IN THE KEY FEEDBACK AREA AT          00128700
129200***  RESTART TIME.                                                00128800
129300***                                                               00128900
129400***  GSAM DATA BASES ARE AUTOMATICALLY RE-POSITIONED BY           00129000
129500***  IMS/VS.                                                      00129100
129600***                                                               00129200
129700     INITIALIZE        SMMPE29                                    00129300
129800                       SMMPD60                                    00129400
129900                       SMMPD68                                    00129500
130000                       SMMPD94                                    00129600
130100                                                                  00129700
130200     MOVE WS-XRST-SAVE-AREA         TO WS-APPL-SAVE-AREA          00129800
130300                                                                  00129900
130400     PERFORM 5100M-OPEN-CHG-JRNL-CURSOR                           00130000
130500        THRU 5100M-EXIT                                           00130100
130600                                                                  00130200
130700     .                                                            00130300
130800 2100A-EXIT.                                                      00130400
130900     EXIT.                                                        00130500
131000     EJECT                                                        00130600
131100     COPY  HBP3000I.                                              00130700
131200                                                                  00130800
131300     EJECT                                                        00130900
131400*===============================================================* 00131000
131500*                    3100A-BEGIN-PROCESS                        * 00131100
131600*---------------------------------------------------------------* 00131200
131700*    PERFORMED BY :  3000H-PROCESS-REQUESTS                     * 00131300
131800*===============================================================* 00131400
131900 3100A-BEGIN-PROCESS.                                             00131500
132000***                                                               00131600
132100*** PERFORM ANY NECESSARY HOUSEKEEPING PRIOR TO PROCESSING        00131700
132200*** A REQUEST.                                                    00131800
132300***                                                               00131900
132400****                                                              00132000
132500**** THE FOLLOWING CODE MUST BE THE LAST LINE OF THIS PARAGRAPH   00132100
132600**** TO ALLOW THE SHELL TO PROCESS A VALID UNIT OF WORK.          00132200
132700****                                                              00132300
132800     SET NOT-REQUEST-COMPLETE TO TRUE                             00132400
132900     .                                                            00132500
133000 3100A-EXIT.                                                      00132600
133100     EXIT.                                                        00132700
133200                                                                  00132800
133300     EJECT                                                        00132900
133400     COPY  HBP3300I.                                              00133000
133500                                                                  00133100
133600     EJECT                                                        00133200
133700*===============================================================* 00133300
133800*                    3400A-END-PROCESS                          * 00133400
133900*---------------------------------------------------------------* 00133500
134000*    PERFORMED BY :  3000H-PROCESS-REQUESTS                     * 00133600
134100*===============================================================* 00133700
134200 3400A-END-PROCESS.                                               00133800
134300***                                                               00133900
134400*** PERFORM ANY NECESSARY WRAP-UP AFTER PROCESSING A REQUEST.     00134000
134500*** ANY NECESSARY END-OF-BATCH PROCESSING CAN ALSO BE DONE HERE.  00134100
134600*** NO-MORE-REQUESTS-TO-PROCESS IS SET IF THE BATCH IS ENDED.     00134200
134700***                                                               00134300
134800     MOVE SPACES                       TO WS-MMP-CHAR-CNTL        00134400
134900     MOVE 1                            TO WS-MMP-HEAD1-PAGE       00134500
135000     MOVE WS-CURRENT-DATE(6:2)         TO WS-MMP-HEAD1-DATE(1:2)  00134600
135100     MOVE WS-CURRENT-DATE(9:2)         TO WS-MMP-HEAD1-DATE(4:2)  00134700
135200     MOVE WS-CURRENT-DATE(1:4)         TO WS-MMP-HEAD1-DATE(7:4)  00134800
135300     MOVE LIT-SLASH                    TO WS-MMP-HEAD1-DATE(3:1)  00134900
135400                                          WS-MMP-HEAD1-DATE(6:1)  00135000
135500     MOVE WS-MMP-STD-HEADING1          TO WS-AUDIT-RECORD         00135100
135600     PERFORM 5340M-INSERT-AUDIT-TOTALS                            00135200
135700                                                                  00135300
135800     MOVE PROGRAM-NAME                 TO WS-MMP-HEAD2-PGM        00135400
135900     MOVE "001"                        TO WS-MMP-HEAD2-PGM-VER    00135500
136000     MOVE WS-CURRENT-TIME              TO WS-MMP-HEAD2-TIME       00135600
136100     MOVE WS-MMP-STD-HEADING2          TO WS-AUDIT-RECORD         00135700
136200     PERFORM 5340M-INSERT-AUDIT-TOTALS                            00135800
136300                                                                  00135900
136400     MOVE WS-MMP-STD-BTCH-HEAD1        TO WS-AUDIT-RECORD         00136000
136500     PERFORM 5340M-INSERT-AUDIT-TOTALS                            00136100
136600                                                                  00136200
136700     PERFORM 5340M-INSERT-AUDIT-TOTALS                            00136300
136800                                                                  00136400
136900     MOVE WS-MMP-STD-BTCH-HEAD2        TO WS-AUDIT-RECORD         00136500
137000     PERFORM 5340M-INSERT-AUDIT-TOTALS                            00136600
137100                                                                  00136700
137200     MOVE WS-MMP-STD-BTCH-HEAD3        TO WS-AUDIT-RECORD         00136800
137300     PERFORM 5340M-INSERT-AUDIT-TOTALS                            00136900
137400                                                                  00137000
137500     MOVE LIT-MMPD-TERTRY-FEATURE-N    TO WS-MMP-BTCH-FILE-NAME   00137100
137600     MOVE WS-SMMPD60-ISRT-CNT          TO WS-MMP-BTCH-WRITTEN-CNT 00137200
137700     MOVE ZEROS                        TO WS-MMP-BTCH-READ-CNT    00137300
137800     MOVE WS-SMMPD60-UPDT-CNT          TO WS-MMP-BTCH-UPDATED-CNT 00137400
137900     MOVE ZEROS                        TO WS-MMP-BTCH-DELETED-CNT 00137500
138000     MOVE WS-MMP-STD-BTCH-DETAIL1      TO WS-AUDIT-RECORD         00137600
138100     PERFORM 5340M-INSERT-AUDIT-TOTALS                            00137700
138200                                                                  00137800
138300     MOVE LIT-MMP-CHG-JORNAL-TBL-N     TO WS-MMP-BTCH-FILE-NAME   00137900
138400     MOVE WS-SMMPE29-SEL-CNT           TO WS-MMP-BTCH-READ-CNT    00138000
138500     MOVE ZEROS                        TO WS-MMP-BTCH-WRITTEN-CNT 00138100
138600                                          WS-MMP-BTCH-UPDATED-CNT 00138200
138700     MOVE WS-SMMPE29-DLET-CNT          TO WS-MMP-BTCH-DELETED-CNT 00138300
138800     MOVE WS-MMP-STD-BTCH-DETAIL1      TO WS-AUDIT-RECORD         00138400
138900     PERFORM 5340M-INSERT-AUDIT-TOTALS                            00138500
139000                                                                  00138600
139100     MOVE LIT-MMPD-WERS-PTVL-INFO-N    TO WS-MMP-BTCH-FILE-NAME   00138700
139200     MOVE WS-SMMPD59-ISRT-CNT          TO WS-MMP-BTCH-WRITTEN-CNT 00138800
139300     MOVE ZEROS                        TO WS-MMP-BTCH-READ-CNT    00138900
139400     MOVE ZEROS                        TO WS-MMP-BTCH-UPDATED-CNT 00139000
139500     MOVE ZEROS                        TO WS-MMP-BTCH-DELETED-CNT 00139100
139600     MOVE WS-MMP-STD-BTCH-DETAIL1      TO WS-AUDIT-RECORD         00139200
139700     PERFORM 5340M-INSERT-AUDIT-TOTALS                            00139300
139800                                                                  00139400
139900     MOVE LIT-MMPD-MKT-INTNT-TBL-N     TO WS-MMP-BTCH-FILE-NAME   00139500
140000     MOVE WS-SMMPD81-SEL-CNT           TO WS-MMP-BTCH-READ-CNT    00139600
140100     MOVE ZEROS                        TO WS-MMP-BTCH-WRITTEN-CNT 00139700
140200     MOVE ZEROS                        TO WS-MMP-BTCH-UPDATED-CNT 00139800
140300     MOVE WS-SMMPD81-DEL-CNT           TO WS-MMP-BTCH-DELETED-CNT 00139900
140400     MOVE WS-MMP-STD-BTCH-DETAIL1      TO WS-AUDIT-RECORD         00140000
140500     PERFORM 5340M-INSERT-AUDIT-TOTALS                            00140100
140600                                                                  00140200
140700     MOVE LIT-MMPD-VALIDATION-TBL-N    TO WS-MMP-BTCH-FILE-NAME   00140300
140800     MOVE WS-SMMPD55-ISRT-CNT          TO WS-MMP-BTCH-WRITTEN-CNT 00140400
140900     MOVE WS-SMMPD55-SEL-CNT           TO WS-MMP-BTCH-READ-CNT    00140500
141000     MOVE WS-SMMPD55-UPDT-CNT          TO WS-MMP-BTCH-UPDATED-CNT 00140600
141100     MOVE ZEROS                        TO WS-MMP-BTCH-DELETED-CNT 00140700
141200     MOVE WS-MMP-STD-BTCH-DETAIL1      TO WS-AUDIT-RECORD         00140800
141300     PERFORM 5340M-INSERT-AUDIT-TOTALS                            00140900
141400                                                                  00141000
141500     .                                                            00141100
141600 3400A-EXIT.                                                      00141200
141700     EXIT.                                                        00141300
141800                                                                  00141400
141900     EJECT                                                        00141500
142000     COPY  HBP3500I.                                              00141600
142100     EJECT                                                        00141700
142200*===============================================================* 00141800
142300*                    3600A-PROCESS-BATCH-UOW                    * 00141900
142400*---------------------------------------------------------------* 00142000
142500*    PERFORMED BY :  3500H-PROCESS                              * 00142100
142600*===============================================================* 00142200
142700 3600A-PROCESS-BATCH-UOW.                                         00142300
142800***************************************************************** 00142400
142900*                                                               * 00142500
143000*  THIS PARAGRAPH SHOULD DRIVE THE PROCESSING OF A UNIT OF      * 00142600
143100*  WORK. SPECIAL CONSIDERATION:                                 * 00142700
143200*                                                               * 00142800
143300*       THE CODE MUST ALLOW FOR DEADLOCK SITUATIONS. THIS IS    * 00142900
143400*       WHEN THE PROGRAM HAS "LOCKED" A RESOURCE THAT ANOTHER   * 00143000
143500*       PROGRAM NEEDS, AND VICE VERSA. THIS WILL BE SIGNALED    * 00143100
143600*       BY THE FOLLOWING:                                       * 00143200
143700*                                                               * 00143300
143800*           DB2:        SQLCODE = -911                          * 00143400
143900*                                                               * 00143500
144000*       WHEN THIS CONDITION OCCURS, THE PROGRAMMER              * 00143600
144100*       IS RESPONSIBLE FOR PERFORMIMG 6500A-DETECT-             * 00143700
144200*       INTERNAL-RESTART.                                       * 00143800
144300*                                                               * 00143900
144400*       IMS WILL NOT RETURN A STATUS OF FD (DEADLOCK). INSTEAD  * 00144000
144500*       IT WILL WAIT TO GET CONTROL OF THE RESOURCES IT NEEDS.  * 00144100
144600*       IF IT SHOULD TIME OUT, A SYSTEM ABEND IS PERFORMED AND  * 00144200
144700*       CONTROL IS NOT PASSED BACK TO YOUR PROGRAM.             * 00144300
144800*                                                               * 00144400
144900***************************************************************** 00144500
145000*                                                                 00144600
145100*** DELETE CHANGE JOURNAL RECORDS AFTER PROCESSING.               00144700
145200                                                                  00144800
145300     INITIALIZE WS-VALID-FIELD-C                                  00144900
145400                WS-VALID-DESC-X                                   00145000
145500                SMMPD55                                           00145100
145600     SET OK-TO-PROCESS               TO TRUE                      00145200
145700     MOVE PCCJ-ROW-KEY-N OF SMMPE29  TO WS-D68-INDEX              00145300
145800     MOVE WS-D68-VAMY-MDLYR          TO WS-MDLYR                  00145400
145900                                                                  00145500
146000     IF WS-D68-PTEIO-ORIGIN = LIT-WERS                            00145600
146100     IF INTERNAL-RESTART                                          00145700
146200        CONTINUE                                                  00145800
146300     ELSE                                                         00145900
146400        EVALUATE PCER-ACTN-C                                      00146000
146500           WHEN LIT-A                                             00146100
146600                PERFORM 4100M-D68-SEL-EFFDT                       00146200
146700                   THRU 4100M-EXIT                                00146300
146800                IF INTERNAL-RESTART                               00146400
146900                   CONTINUE                                       00146500
147000                ELSE                                              00146600
147100                  IF OK-TO-PROCESS                                00146700
147200                    PERFORM 4200M-PROCESS-D68CJADD                00146800
147300                      THRU 4200M-EXIT                             00146900
147400                  END-IF                                          00147000
147500                END-IF                                            00147100
147600           WHEN LIT-D                                             00147200
147700                PERFORM 4300M-PROCESS-D68CJDEL                    00147300
147800                   THRU 4300M-EXIT                                00147400
147900*USAGE BY PLANT CHANGE STARTS                                     00147500
148000*               IF INTERNAL-RESTART                               00147600
148100*                  CONTINUE                                       00147700
148200*               ELSE                                              00147800
148300*                  PERFORM 5600M-DEL-D81                          00147900
148400*                     THRU 5600M-EXIT                             00148000
148500*               END-IF                                            00148100
148600*USAGE BY PLANT CHANGE ENDS                                       00148200
148700           WHEN LIT-C                                             00148300
148800                IF PCER-ATTR-N = LIT-VAMY-PROD-END-Y-ATTR-N       00148400
148900                   MOVE PCCJ-OLD-ATTR-D TO WS-D68-PROD-END-Y      00148500
149000                   PERFORM 4100M-D68-SEL-EFFDT                    00148600
149100                      THRU 4100M-EXIT                             00148700
149200                   IF INTERNAL-RESTART                            00148800
149300                      CONTINUE                                    00148900
149400                   ELSE                                           00149000
149500                     IF OK-TO-PROCESS                             00149100
149600                       IF PCCJ-OLD-ATTR-D > PCCJ-NEW-ATTR-D       00149200
149700*FIX1 STARTS
149701                          MOVE PCCJ-OLD-ATTR-D TO WS-MMEA-END-DT
149702                          PERFORM 4400M-PROCESS-D68CJENDT         00149300
149703*FIX1 ENDS
149800                             THRU 4400M-EXIT                      00149400
149900                          MOVE PCCJ-OLD-ATTR-D                    00149500
150000                                  TO WS-D55-END-DATE              00149600
150100                       ELSE                                       00149700
150200*FIX1 STARTS
150201                          MOVE PCCJ-NEW-ATTR-D TO WS-MMEA-END-DT
150202                          PERFORM 4400M-PROCESS-D68CJENDT         00149800
150300                             THRU 4400M-EXIT                      00149900
150310*FIX1 ENDS
150400                          MOVE PCCJ-NEW-ATTR-D                    00150000
150500                                  TO WS-D55-END-DATE              00150100
150600                       END-IF                                     00150200
150700                       MOVE VAMY-PROD-STRT-Y OF SMMPD68           00150300
150800                                  TO WS-D55-START-DATE            00150400
150900                       PERFORM 4800M-INSERT-SMMPD55               00150500
151000                          THRU 4800M-EXIT                         00150600
151100                     END-IF                                       00150700
151200                   END-IF                                         00150800
151300                END-IF                                            00150900
151400                IF PCER-ATTR-N = LIT-VAMY-PROD-STRT-Y-ATTR-N      00151000
151500                   MOVE PCCJ-OLD-ATTR-D TO WS-D68-PROD-START-Y    00151100
151600                   PERFORM 4100M-D68-SEL-EFFDT                    00151200
151700                      THRU 4100M-EXIT                             00151300
151800                   IF INTERNAL-RESTART                            00151400
151900                      CONTINUE                                    00151500
152000                   ELSE                                           00151600
152100                     IF OK-TO-PROCESS                             00151700
152200                       IF PCCJ-OLD-ATTR-D > PCCJ-NEW-ATTR-D       00151800
152300*FIX1 STARTS
152301                          MOVE PCCJ-NEW-ATTR-D TO WS-MMEA-START-DT
152302                          PERFORM 4600M-PROCESS-D68CJSTDT         00151900
152303*FIX1 ENDS
152400                             THRU 4600M-EXIT                      00152000
152500                          MOVE PCCJ-NEW-ATTR-D                    00152100
152600                                  TO WS-D55-START-DATE            00152200
152700                       ELSE                                       00152300
152800*FIX1 STARTS
152801                          MOVE PCCJ-OLD-ATTR-D TO WS-MMEA-START-DT
152802                          PERFORM 4600M-PROCESS-D68CJSTDT         00152400
152900                             THRU 4600M-EXIT                      00152500
152910*FIX1 ENDS
153000                          MOVE PCCJ-OLD-ATTR-D                    00152600
153100                                  TO WS-D55-START-DATE            00152700
153200                       END-IF                                     00152800
153300                       MOVE VAMY-PROD-END-Y  OF SMMPD68           00152900
153400                                  TO WS-D55-END-DATE              00153000
153500                       PERFORM 4800M-INSERT-SMMPD55               00153100
153600                          THRU 4800M-EXIT                         00153200
153700                     END-IF                                       00153300
153800                   END-IF                                         00153400
153900                END-IF                                            00153500
154000        END-EVALUATE                                              00153600
154100     END-IF                                                       00153700
154200                                                                  00153800
154300     END-IF                                                       00153900
154400*********US3708170*******START                                    00154000
154500     IF INTERNAL-RESTART                                          00154100
154600        CONTINUE                                                  00154200
154700     ELSE                                                         00154300
154800        PERFORM 4000M-DELETE-SMMPE29                              00154400
154900           THRU 4000M-EXIT                                        00154500
155000     END-IF                                                       00154600
155010*******US3708170****END
155100     .                                                            00154700
155200 3600A-EXIT.                                                      00154800
155300     EXIT.                                                        00154900
155400     EJECT                                                        00155000
155500*===============================================================* 00155100
155600*                    3600A-PROCESS-BATCH-UOW                    * 00155200
155700*---------------------------------------------------------------* 00155300
155800*    PERFORMED BY :  0400H-END-OF-JOB                           * 00155400
155900*===============================================================* 00155500
156000 3800A-APPL-END-OF-JOB.                                           00155600
156100***************************************************************** 00155700
156200*                                                               * 00155800
156300*     THIS PARAGRAPH IS PERFORMED AS PART OF END-OF-JOB         * 00155900
156400*     PROCESSING.  CLOSE ALL FILES, GSAM OR OTHER.              * 00156000
156500*                                                               * 00156100
156600***************************************************************** 00156200
156700*                                                                 00156300
156800     PERFORM 5380M-CLOSE-GSAM-AUDIT-FILE                          00156400
156900        THRU 5380M-EXIT                                           00156500
157000     PERFORM 5390M-CLOSE-GSAM-D81BKUP-FILE                        00156600
157100        THRU 5390M-EXIT                                           00156700
157200     .                                                            00156800
157300 3800A-EXIT.                                                      00156900
157400     EXIT.                                                        00157000
157500     EJECT                                                        00157100
157600*===============================================================* 00157200
157700*                    3900M-GET-CURRENT-DATE-TIME                * 00157300
157800*---------------------------------------------------------------* 00157400
157900*    PERFORMED BY :  0100H-PROGRAM-INIT                         * 00157500
158000*                    1200A-APPL-SPECIFIC-INIT                   * 00157600
158100*                    2100A-APPL-RESTART-INIT                    * 00157700
158200*===============================================================* 00157800
158300 3900M-GET-CURRENT-DATE-TIME.                                     00157900
158400                                                                  00158000
158500     EXEC SQL                                                     00158100
158600          SELECT CURRENT DATE,                                    00158200
158700                 CURRENT TIME                                     00158300
158800          INTO  :WS-CURRENT-DATE,                                 00158400
158900                :WS-CURRENT-TIME                                  00158500
159000          FROM   SIBM_STUPID                                      00158600
159100     END-EXEC                                                     00158700
159200                                                                  00158800
159300     EVALUATE SQLCODE                  ALSO SQLWARN0              00158900
159400                                                                  00159000
159500         WHEN DB2-SUCCESSFUL-RETURN    ALSO ANY                   00159100
159600             CONTINUE                                             00159200
159700                                                                  00159300
159800         WHEN DB2-DEADLOCK             ALSO ANY                   00159400
159900             PERFORM 6500A-DETECT-INTERNAL-RESTART                00159500
160000                                                                  00159600
160100         WHEN OTHER                                               00159700
160200             SET WS-ABEND-SQL-ERROR        TO TRUE                00159800
160300             MOVE LIT-PARAGRAPH-3900M      TO HE-PARAGRAPH        00159900
160400             MOVE DB2-SELECT-CALL          TO HE-SQL-FUNCTION     00160000
160500             MOVE SQLCODE                  TO HE-SQL-RETURN-CODE  00160100
160600             MOVE SQLWARN0                 TO HE-SQL-WARNING      00160200
160700             PERFORM 5400M-CALL-DSNTIAR                           00160300
160800             MOVE SQLERRMC                 TO HE-SQL-ERROR-MESSAGE00160400
160900             MOVE LIT-BAD-DATERTN-CALL     TO HE-MSG1             00160500
161000             MOVE LIT-MMP-IBM-STUPID-TBL-N TO HE-DB2-TABLE1       00160600
161100             PERFORM 9990H-ABNORMAL-END-OF-JOB                    00160700
161200                                                                  00160800
161300     END-EVALUATE                                                 00160900
161400     .                                                            00161000
161500 3900M-EXIT.                                                      00161100
161600     EXIT.                                                        00161200
161700     EJECT                                                        00161300
161800*===============================================================* 00161400
161900*                    3950M-GET-ISO-DATE                         * 00161500
162000*---------------------------------------------------------------* 00161600
162100*    PERFORMED BY :  0100H-PROGRAM-INIT                         * 00161700
162200*                    1200A-APPL-SPECIFIC-INIT                   * 00161800
162300*                    2100A-APPL-RESTART-INIT                    * 00161900
162400*===============================================================* 00162000
162500 3950M-GET-ISO-DATE.                                              00162100
162600                                                                  00162200
162700                                                                  00162300
162800 COPY PACMMPFA.                                                   00162400
162900                                                                  00162500
163000                                                                  00162600
163100      EVALUATE SQLCODE ALSO SQLWARN0                              00162700
163200          WHEN DB2-SUCCESSFUL-RETURN  ALSO SPACES                 00162800
163300               CONTINUE                                           00162900
163400          WHEN DB2-DEADLOCK ALSO ANY                              00163000
163500               PERFORM 6500A-DETECT-INTERNAL-RESTART              00163100
163600          WHEN OTHER                                              00163200
163700               SET WS-ABEND-SQL-ERROR        TO TRUE              00163300
163800               MOVE LIT-PARAGRAPH-3950M      TO HE-PARAGRAPH      00163400
163900               MOVE DB2-SELECT-CALL          TO HE-SQL-FUNCTION   00163500
164000               MOVE SQLCODE                  TO HE-SQL-RETURN-CODE00163600
164100               MOVE SQLWARN0                 TO HE-SQL-WARNING    00163700
164200               PERFORM 5400M-CALL-DSNTIAR                         00163800
164300               MOVE SQLERRMC               TO HE-SQL-ERROR-MESSAGE00163900
164400               MOVE LIT-BAD-DATERTN-CALL     TO HE-MSG1           00164000
164500               MOVE LIT-MMP-IBM-STUPID-TBL-N TO HE-DB2-TABLE1     00164100
164600               PERFORM 9990H-ABNORMAL-END-OF-JOB                  00164200
164700      END-EVALUATE                                                00164300
164800     .                                                            00164400
164900 3950M-EXIT.                                                      00164500
165000     EXIT.                                                        00164600
165100     EJECT                                                        00164700
165200*===============================================================* 00164800
165300*                    4000M-DELETE-SMMPE29                       * 00164900
165400*---------------------------------------------------------------* 00165000
165500*    PERFORMED BY :  3600A-PROCESS-BATCH-UOW                    * 00165100
165600*===============================================================* 00165200
165700 4000M-DELETE-SMMPE29.                                            00165300
165800                                                                  00165400
165900     EXEC SQL                                                     00165500
166000          DELETE                                                  00165600
166100          FROM  SMMPE29_CHG_JORNAL                                00165700
166110*******US3708170****START
166200*         WHERE CURRENT OF CHG-JRNL-CSR                           00165800
166210          WHERE  PCER_PGM_ID_R   = :SMMPE29.PCER-PGM-ID-R
166220          AND    PCER_TBL_N      = :SMMPE29.PCER-TBL-N
166230          AND    PCER_ATTR_N     = :SMMPE29.PCER-ATTR-N
166240          AND    PCCJ_ROW_KEY_N  = :SMMPE29.PCCJ-ROW-KEY-N
166250          AND    PCER_ACTN_C     = :SMMPE29.PCER-ACTN-C
166260          AND    P_LAST_UPDATE_S = :SMMPE29.P-LAST-UPDATE-S
166261*******US3708170****END
166270
166300     END-EXEC                                                     00165900
166400                                                                  00166000
166500     EVALUATE SQLCODE                  ALSO SQLWARN0              00166100
166600                                                                  00166200
166700         WHEN DB2-SUCCESSFUL-RETURN    ALSO ANY                   00166300
166800             ADD +1                 TO WS-SMMPE29-DLET-CNT        00166400
166900                                                                  00166500
167000         WHEN DB2-DEADLOCK             ALSO ANY                   00166600
167100             PERFORM 6500A-DETECT-INTERNAL-RESTART                00166700
167200                                                                  00166800
167300         WHEN OTHER                                               00166900
167400             SET WS-ABEND-SQL-ERROR        TO TRUE                00167000
167500             MOVE LIT-PARAGRAPH-4000M      TO HE-PARAGRAPH        00167100
167600             MOVE DB2-DELETE-CALL          TO HE-SQL-FUNCTION     00167200
167700             MOVE SQLCODE                  TO HE-SQL-RETURN-CODE  00167300
167800             MOVE SQLWARN0                 TO HE-SQL-WARNING      00167400
167900             PERFORM 5400M-CALL-DSNTIAR                           00167500
168000             MOVE SQLERRMC                 TO HE-SQL-ERROR-MESSAGE00167600
168100             STRING                                               00167700
168200                 PCER-PGM-ID-R OF SMMPE29    ","                  00167800
168300                 PCCJ-UPDT-S   OF SMMPE29    ","                  00167900
168400                 PCER-TBL-N    OF SMMPE29    ","                  00168000
168500                 PCER-ATTR-N   OF SMMPE29    ","                  00168100
168600                 DELIMITED BY SIZE       INTO HE-MSG1             00168200
168700             END-STRING                                           00168300
168800             MOVE LIT-MMP-CHG-JORNAL-TBL-N TO HE-DB2-TABLE1       00168400
168900             PERFORM 9990H-ABNORMAL-END-OF-JOB                    00168500
169000                                                                  00168600
169100     END-EVALUATE                                                 00168700
169200     .                                                            00168800
169300 4000M-EXIT.                                                      00168900
169400     EXIT.                                                        00169000
169500     EJECT                                                        00169100
169600*===============================================================* 00169200
169700*                                                               * 00169300
169800*---------------------------------------------------------------* 00169400
169900*    PERFORMED BY :  3600A-PROCESS-BATCH-UOW                    * 00169500
170000*===============================================================* 00169600
170100 4100M-D68-SEL-EFFDT.                                             00169700
170200                                                                  00169800
170300     EXEC SQL                                                     00169900
170400       SELECT  D68.VAMY_PROD_STRT_Y                               00170000
170500              ,D68.VAMY_PROD_END_Y                                00170100
170600         INTO :SMMPD68.VAMY-PROD-STRT-Y                           00170200
170700             ,:SMMPD68.VAMY-PROD-END-Y                            00170300
170800         FROM  SMMPD68_ENG_PT_MY D68                              00170400
170900        WHERE   D68.VEHTYPE_CODE         = :WS-D68-VEHTYPE        00170500
171000          AND   D68.PTEIO_ORIGIN_C       = :WS-D68-PTEIO-ORIGIN   00170600
171100          AND   D68.EVL_VEHICLE_LINE_C   = :WS-D68-VEHICLE-LINE   00170700
171200          AND   D68.VAMY_MDLYR_R         = :WS-MDLYR              00170800
171300          AND   D68.REGINT_C             = :WS-D68-REGINT-C       00170900
171400     END-EXEC.                                                    00171000
171500                                                                  00171100
171600     EVALUATE SQLCODE               ALSO SQLWARN0                 00171200
171700                                                                  00171300
171800         WHEN DB2-SUCCESSFUL-RETURN ALSO ANY                      00171400
171900             ADD +1                        TO WS-SMMPD68-SEL-CNT  00171500
172000             MOVE WS-D68-VEHTYPE       TO VEHTYPE-CODE OF SMMPD68 00171600
172100             MOVE WS-D68-PTEIO-ORIGIN  TO                         00171700
172200                                       PTEIO-ORIGIN-C OF SMMPD68  00171800
172300             MOVE WS-D68-VEHICLE-LINE  TO                         00171900
172400                                 EVL-VEHICLE-LINE-C   OF SMMPD68  00172000
172500             MOVE WS-MDLYR             TO VAMY-MDLYR-R OF SMMPD68 00172100
172600             MOVE WS-D68-REGINT-C      TO REGINT-C     OF SMMPD68 00172200
172700                                                                  00172300
172800         WHEN DB2-NOT-FOUND         ALSO ANY                      00172400
172900             SET NOT-OK-TO-PROCESS         TO TRUE                00172500
173000                                                                  00172600
173100         WHEN DB2-DEADLOCK          ALSO ANY                      00172700
173200             PERFORM 6500A-DETECT-INTERNAL-RESTART                00172800
173300                                                                  00172900
173400         WHEN OTHER                                               00173000
173500             SET WS-ABEND-SQL-ERROR        TO TRUE                00173100
173600             MOVE LIT-PARAGRAPH-4100M       TO HE-PARAGRAPH       00173200
173700             MOVE DB2-SELECT-CALL           TO HE-SQL-FUNCTION    00173300
173800             PERFORM 5400M-CALL-DSNTIAR                           00173400
173900             MOVE SQLERRMC                 TO HE-SQL-ERROR-MESSAGE00173500
174000             MOVE LIT-MMPD-CNTRY-XREF-TBL-N TO HE-DB2-TABLE1      00173600
174100             MOVE WS-MDLYR                  TO WS-NUM-MDLYR       00173700
174200             STRING                                               00173800
174300                 WS-D68-VEHTYPE              ","                  00173900
174400                 WS-D68-VEHICLE-LINE         ","                  00174000
174500                 WS-D68-PTEIO-ORIGIN         ","                  00174100
174600                 WS-NUM-MDLYR                ","                  00174200
174700                 WS-D68-REGINT-C                                  00174300
174800                 DELIMITED BY SIZE INTO HE-MSG1                   00174400
174900             END-STRING                                           00174500
175000             PERFORM 9990H-ABNORMAL-END-OF-JOB                    00174600
175100                                                                  00174700
175200     END-EVALUATE                                                 00174800
175300     .                                                            00174900
175400 4100M-EXIT.                                                      00175000
175500     EXIT.                                                        00175100
175600     EJECT                                                        00175200
175700                                                                  00175300
175800 4200M-PROCESS-D68CJADD.                                          00175400
175900         SET NOT-END-OF-D60-CSR    TO TRUE                        00175500
176000         PERFORM 4210M-OPEN-D60-CURSOR                            00175600
176100         IF INTERNAL-RESTART                                      00175700
176200            CONTINUE                                              00175800
176300         ELSE                                                     00175900
176400            PERFORM 4220M-FETCH-D60-CURSOR                        00176000
176500              UNTIL END-OF-D60-CSR OR INTERNAL-RESTART            00176100
176600         END-IF                                                   00176200
176700                                                                  00176300
176800         IF INTERNAL-RESTART                                      00176400
176900            CONTINUE                                              00176500
177000         ELSE                                                     00176600
177100            PERFORM 4230M-CLOSE-D60-CURSOR                        00176700
177200         END-IF                                                   00176800
177300     .                                                            00176900
177400 4200M-EXIT.                                                      00177000
177500     EXIT.                                                        00177100
177600     EJECT                                                        00177200
177700 4210M-OPEN-D60-CURSOR.                                           00177300
177800     EXEC SQL                                                     00177400
177900         OPEN D60-SEL-CSR                                         00177500
178000     END-EXEC                                                     00177600
178100                                                                  00177700
178200     EVALUATE SQLCODE                      ALSO SQLWARN0          00177800
178300         WHEN DB2-SUCCESSFUL-RETURN        ALSO SPACES            00177900
178400              CONTINUE                                            00178000
178500                                                                  00178100
178600         WHEN DB2-DEADLOCK                 ALSO ANY               00178200
178700              PERFORM 6500A-DETECT-INTERNAL-RESTART               00178300
178800                                                                  00178400
178900         WHEN OTHER                                               00178500
179000              MOVE LIT-PARAGRAPH-4210M        TO HE-PARAGRAPH     00178600
179100              MOVE DB2-OPEN-CURSOR-CALL       TO HE-SQL-FUNCTION  00178700
179200              MOVE LIT-INVALID-OPEN-CALL      TO HE-MSG1          00178800
179300              MOVE LIT-MMPD-TERTRY-FEATURE-N  TO HE-DB2-TABLE1    00178900
179400              MOVE PCCJ-ROW-KEY-N     TO HE-MSG2                  00179000
179500              PERFORM 5999M-SETUP-DB2-ABEND                       00179100
179600     END-EVALUATE                                                 00179200
179700     .                                                            00179300
179800 4210M-EXIT.                                                      00179400
179900     EXIT.                                                        00179500
180000     EJECT                                                        00179600
180100 4220M-FETCH-D60-CURSOR.                                          00179700
180200     EXEC SQL                                                     00179800
180300        FETCH D60-SEL-CSR                                         00179900
180400         INTO :SMMPD60.VEHTYPE-CODE                               00180000
180500             ,:SMMPD60.PTEIO-ORIGIN-C                             00180100
180600             ,:SMMPD60.EVL-VEHICLE-LINE-C                         00180200
180700             ,:SMMPD60.MMPD60-TERR-C                              00180300
180800             ,:SMMPD60.MMPD60-FTR-C                               00180400
180900             ,:SMMPD60.MMPD60-PRIFTRSRC-C                         00180500
181000             ,:SMMPD60.MMPD60-FTR-VAL-C                           00180600
181100             ,:SMMPD60.MMPD60-MNRFTR-C                            00180700
181200             ,:SMMPD60.MMPD60-MNRFTRSRC-C                         00180800
181300             ,:SMMPD60.MMPD60-EFFPNTIN-Y                          00180900
181400             ,:SMMPD60.MMPD60-XCLUD-LST-F                         00181000
181500             ,:SMMPD60.MMPD60-REMARK-DS-X                         00181100
181600             ,:SMMPD60.MMPD60-EFFPNTIN-C                          00181200
181700             ,:SMMPD60.MMPD60-EFFPNTOUT-Y                         00181300
181800             ,:SMMPD60.MMPD60-EFFPNTOUT-C                         00181400
181900             ,:SMMPD60.MMPD60-REC-STAT-C                          00181500
182000     END-EXEC                                                     00181600
182100     EVALUATE SQLCODE                      ALSO SQLWARN0          00181700
182200         WHEN DB2-SUCCESSFUL-RETURN        ALSO SPACES            00181800
182300              MOVE WS-MDLYR          TO MMPD59-MDLYR-Y  OF SMMPD6000181900
182400                                        MMPD59-MDLYR-Y  OF SMMPD5900182000
182500              MOVE MMPD60-REC-STAT-C OF SMMPD60                   00182100
182600                                     TO WS-TEMP-REC-STAT          00182200
182700              MOVE LIT-A             TO                           00182300
182800                                MMPD60-REC-STAT-C OF SMMPD60      00182400
182900              MOVE PROGRAM-NAME      TO                           00182500
183000                                MMPD60-LAST-UPD-C OF SMMPD60      00182600
183100              SET WS-88-D59ROW-NOT-FOUND TO TRUE                  00182700
183200              PERFORM 8500M-SEL-SMMPD59-VL                        00182800
183300                 THRU 8500M-SEL-EXIT                              00182900
183400              IF WS-88-D59ROW-NOT-FOUND AND NOT-INTERNAL-RESTART  00183000
183500                 PERFORM 8500M-POPULATE-SMMPD59                   00183100
183600                    THRU 8500M-EXIT                               00183200
183700              END-IF                                              00183300
183800              IF NOT-INTERNAL-RESTART                             00183400
183900                 PERFORM 5200M-INSERT-SMMPD60                     00183500
184000                    THRU 5200M-INS-EXIT                           00183600
184100              END-IF                                              00183700
184200*             IF NOT-INTERNAL-RESTART                             00183800
184300*                PERFORM 5520M-INSERT-NGTVTC                      00183900
184400*                   THRU 5520M-EXIT                               00184000
184500*             END-IF                                              00184100
184600         WHEN DB2-NOT-FOUND                ALSO ANY               00184200
184700              SET END-OF-D60-CSR TO TRUE                          00184300
184800         WHEN DB2-DEADLOCK                 ALSO ANY               00184400
184900              PERFORM 6500A-DETECT-INTERNAL-RESTART               00184500
185000                                                                  00184600
185100         WHEN OTHER                                               00184700
185200              MOVE LIT-PARAGRAPH-4220M        TO HE-PARAGRAPH     00184800
185300              MOVE DB2-FETCH-CALL             TO HE-SQL-FUNCTION  00184900
185400              MOVE LIT-INVALID-FETCH-CALL     TO HE-MSG1          00185000
185500              MOVE LIT-MMPD-TERTRY-FEATURE-N  TO HE-DB2-TABLE1    00185100
185600              MOVE PCCJ-ROW-KEY-N     TO HE-MSG2                  00185200
185700              PERFORM 5999M-SETUP-DB2-ABEND                       00185300
185800     END-EVALUATE                                                 00185400
185900     .                                                            00185500
186000 4220M-EXIT.                                                      00185600
186100     EXIT.                                                        00185700
186200     EJECT                                                        00185800
186300 4230M-CLOSE-D60-CURSOR.                                          00185900
186400      EXEC SQL                                                    00186000
186500          CLOSE D60-SEL-CSR                                       00186100
186600      END-EXEC                                                    00186200
186700                                                                  00186300
186800      EVALUATE SQLCODE                     ALSO SQLWARN0          00186400
186900          WHEN DB2-SUCCESSFUL-RETURN       ALSO SPACES            00186500
187000               CONTINUE                                           00186600
187100                                                                  00186700
187200          WHEN DB2-DEADLOCK                ALSO ANY               00186800
187300               PERFORM 6500A-DETECT-INTERNAL-RESTART              00186900
187400         WHEN OTHER                                               00187000
187500              MOVE LIT-PARAGRAPH-4230M        TO HE-PARAGRAPH     00187100
187600              MOVE DB2-CLOSE-CURSOR-CALL      TO HE-SQL-FUNCTION  00187200
187700              MOVE LIT-MMPD-TERTRY-FEATURE-N  TO HE-DB2-TABLE1    00187300
187800              MOVE PCCJ-ROW-KEY-N             TO HE-MSG2          00187400
187900              PERFORM 5999M-SETUP-DB2-ABEND                       00187500
188000     END-EVALUATE                                                 00187600
188100                                                                  00187700
188200     .                                                            00187800
188300 4230M-EXIT.                                                      00187900
188400     EXIT.                                                        00188000
188500     EJECT                                                        00188100
188600                                                                  00188200
188700 4300M-PROCESS-D68CJDEL.                                          00188300
188800         SET NOT-END-OF-D60-CSR    TO TRUE                        00188400
188900         PERFORM 4310M-OPEN-D60-CURSOR                            00188500
189000            THRU 4310M-EXIT                                       00188600
189100         IF INTERNAL-RESTART                                      00188700
189200            CONTINUE                                              00188800
189300         ELSE                                                     00188900
189400            PERFORM 4320M-FETCH-D60-CURSOR                        00189000
189500              UNTIL END-OF-D60-CSR OR INTERNAL-RESTART            00189100
189600         END-IF                                                   00189200
189700                                                                  00189300
189800         IF INTERNAL-RESTART                                      00189400
189900            CONTINUE                                              00189500
190000         ELSE                                                     00189600
190100            PERFORM 4330M-CLOSE-D60-CURSOR                        00189700
190200               THRU 4330M-EXIT                                    00189800
190300         END-IF                                                   00189900
190400     .                                                            00190000
190500 4300M-EXIT.                                                      00190100
190600     EXIT.                                                        00190200
190700     EJECT                                                        00190300
190800 4310M-OPEN-D60-CURSOR.                                           00190400
190900     EXEC SQL                                                     00190500
191000         OPEN D60-CSR-DELCJ                                       00190600
191100     END-EXEC                                                     00190700
191200                                                                  00190800
191300     EVALUATE SQLCODE                      ALSO SQLWARN0          00190900
191400         WHEN DB2-SUCCESSFUL-RETURN        ALSO SPACES            00191000
191500              CONTINUE                                            00191100
191600                                                                  00191200
191700         WHEN DB2-DEADLOCK                 ALSO ANY               00191300
191800              PERFORM 6500A-DETECT-INTERNAL-RESTART               00191400
191900                                                                  00191500
192000         WHEN OTHER                                               00191600
192100              MOVE LIT-PARAGRAPH-4310M        TO HE-PARAGRAPH     00191700
192200              MOVE DB2-OPEN-CURSOR-CALL       TO HE-SQL-FUNCTION  00191800
192300              MOVE LIT-MMPD-TERTRY-FEATURE-N  TO HE-DB2-TABLE1    00191900
192400              MOVE PCCJ-ROW-KEY-N             TO HE-MSG1          00192000
192500              PERFORM 5999M-SETUP-DB2-ABEND                       00192100
192600     END-EVALUATE                                                 00192200
192700     .                                                            00192300
192800 4310M-EXIT.                                                      00192400
192900     EXIT.                                                        00192500
193000     EJECT                                                        00192600
193100 4320M-FETCH-D60-CURSOR.                                          00192700
193200     EXEC SQL                                                     00192800
193300        FETCH D60-CSR-DELCJ                                       00192900
193400         INTO :SMMPD60.VEHTYPE-CODE                               00193000
193500             ,:SMMPD60.PTEIO-ORIGIN-C                             00193100
193600             ,:SMMPD60.EVL-VEHICLE-LINE-C                         00193200
193700             ,:SMMPD60.MMPD59-MDLYR-Y                             00193300
193800             ,:SMMPD60.MMPD60-TERR-C                              00193400
193900             ,:SMMPD60.MMPD60-FTR-C                               00193500
194000             ,:SMMPD60.MMPD60-PRIFTRSRC-C                         00193600
194100             ,:SMMPD60.MMPD60-FTR-VAL-C                           00193700
194200             ,:SMMPD60.MMPD60-MNRFTR-C                            00193800
194300             ,:SMMPD60.MMPD60-MNRFTRSRC-C                         00193900
194400             ,:SMMPD60.MMPD60-EFFPNTIN-Y                          00194000
194500             ,:SMMPD60.MMPD60-XCLUD-LST-F                         00194100
194600             ,:SMMPD60.MMPD60-REMARK-DS-X                         00194200
194700             ,:SMMPD60.MMPD60-EFFPNTIN-C                          00194300
194800             ,:SMMPD60.MMPD60-EFFPNTOUT-Y                         00194400
194900             ,:SMMPD60.MMPD60-EFFPNTOUT-C                         00194500
195000             ,:SMMPD60.MMPD60-REC-STAT-C                          00194600
195100     END-EXEC                                                     00194700
195200     EVALUATE SQLCODE                      ALSO SQLWARN0          00194800
195300         WHEN DB2-SUCCESSFUL-RETURN        ALSO SPACES            00194900
195400              MOVE WS-MDLYR TO MMPD59-MDLYR-Y OF SMMPD60          00195000
195500              MOVE MMPD60-REC-STAT-C OF SMMPD60                   00195100
195600                                     TO WS-TEMP-REC-STAT          00195200
195700              MOVE LIT-I             TO                           00195300
195800                                MMPD60-REC-STAT-C OF SMMPD60      00195400
195900              MOVE PROGRAM-NAME      TO                           00195500
196000                                MMPD60-LAST-UPD-C OF SMMPD60      00195600
196100              PERFORM 5300M-UPDATE-SMMPD60                        00195700
196200                 THRU 5300M-UPD-EXIT                              00195800
196300         WHEN DB2-NOT-FOUND                ALSO ANY               00195900
196400              SET END-OF-D60-CSR TO TRUE                          00196000
196500         WHEN DB2-DEADLOCK                 ALSO ANY               00196100
196600              PERFORM 6500A-DETECT-INTERNAL-RESTART               00196200
196700                                                                  00196300
196800         WHEN OTHER                                               00196400
196900              MOVE LIT-PARAGRAPH-4320M        TO HE-PARAGRAPH     00196500
197000              MOVE DB2-FETCH-CALL             TO HE-SQL-FUNCTION  00196600
197100              MOVE LIT-MMPD-TERTRY-FEATURE-N  TO HE-DB2-TABLE1    00196700
197200              MOVE PCCJ-ROW-KEY-N             TO HE-MSG1          00196800
197300              PERFORM 5999M-SETUP-DB2-ABEND                       00196900
197400     END-EVALUATE                                                 00197000
197500     .                                                            00197100
197600 4320M-EXIT.                                                      00197200
197700     EXIT.                                                        00197300
197800     EJECT                                                        00197400
197900 4330M-CLOSE-D60-CURSOR.                                          00197500
198000      EXEC SQL                                                    00197600
198100          CLOSE D60-CSR-DELCJ                                     00197700
198200      END-EXEC                                                    00197800
198300                                                                  00197900
198400      EVALUATE SQLCODE                     ALSO SQLWARN0          00198000
198500          WHEN DB2-SUCCESSFUL-RETURN       ALSO SPACES            00198100
198600               CONTINUE                                           00198200
198700                                                                  00198300
198800          WHEN DB2-DEADLOCK                ALSO ANY               00198400
198900               PERFORM 6500A-DETECT-INTERNAL-RESTART              00198500
199000         WHEN OTHER                                               00198600
199100              MOVE LIT-PARAGRAPH-4330M        TO HE-PARAGRAPH     00198700
199200              MOVE DB2-CLOSE-CURSOR-CALL      TO HE-SQL-FUNCTION  00198800
199300              MOVE LIT-MMPD-TERTRY-FEATURE-N  TO HE-DB2-TABLE1    00198900
199400              MOVE PCCJ-ROW-KEY-N             TO HE-MSG1          00199000
199500              PERFORM 5999M-SETUP-DB2-ABEND                       00199100
199600     END-EVALUATE                                                 00199200
199700                                                                  00199300
199800     .                                                            00199400
199900 4330M-EXIT.                                                      00199500
200000     EXIT.                                                        00199600
200100     EJECT                                                        00199700
200110*FIX1 STARTS
200200 4400M-PROCESS-D68CJENDT.                                         00199800
200300         SET NOT-END-OF-D60-CSR    TO TRUE                        00199900
200400         PERFORM 4410M-OPEN-D60-CURSOR                            00200000
200500            THRU 4410M-EXIT                                       00200100
200600         IF INTERNAL-RESTART                                      00200200
200700            CONTINUE                                              00200300
200800         ELSE                                                     00200400
200900            PERFORM 4420M-FETCH-D60-CURSOR                        00200500
201000              UNTIL END-OF-D60-CSR OR INTERNAL-RESTART            00200600
201100         END-IF                                                   00200700
201200                                                                  00200800
201300         IF INTERNAL-RESTART                                      00200900
201400            CONTINUE                                              00201000
201500         ELSE                                                     00201100
201600            PERFORM 4430M-CLOSE-D60-CURSOR                        00201200
201700               THRU 4430M-EXIT                                    00201300
201800         END-IF                                                   00201400
201900     .                                                            00201500
202000 4400M-EXIT.                                                      00201600
202100     EXIT.                                                        00201700
202200     EJECT                                                        00201800
202300 4410M-OPEN-D60-CURSOR.                                           00201900
202400     EXEC SQL                                                     00202000
202500         OPEN D60-CSR-CHGEND                                      00202100
202600     END-EXEC                                                     00202200
202700                                                                  00202300
202800     EVALUATE SQLCODE                      ALSO SQLWARN0          00202400
202900         WHEN DB2-SUCCESSFUL-RETURN        ALSO SPACES            00202500
203000              CONTINUE                                            00202600
203100                                                                  00202700
203200         WHEN DB2-DEADLOCK                 ALSO ANY               00202800
203300              PERFORM 6500A-DETECT-INTERNAL-RESTART               00202900
203400                                                                  00203000
203500         WHEN OTHER                                               00203100
203600              MOVE LIT-PARAGRAPH-4410M        TO HE-PARAGRAPH     00203200
203700              MOVE DB2-OPEN-CURSOR-CALL       TO HE-SQL-FUNCTION  00203300
203800              MOVE LIT-MMPD-TERTRY-FEATURE-N  TO HE-DB2-TABLE1    00203400
203900              MOVE PCCJ-ROW-KEY-N             TO HE-MSG1          00203500
204000              PERFORM 5999M-SETUP-DB2-ABEND                       00203600
204100     END-EVALUATE                                                 00203700
204200     .                                                            00203800
204300 4410M-EXIT.                                                      00203900
204400     EXIT.                                                        00204000
204500     EJECT                                                        00204100
204600 4420M-FETCH-D60-CURSOR.                                          00204200
204700     EXEC SQL                                                     00204300
204800        FETCH D60-CSR-CHGEND                                      00204400
204900         INTO :SMMPD60.VEHTYPE-CODE                               00204500
205000             ,:SMMPD60.PTEIO-ORIGIN-C                             00204600
205100             ,:SMMPD60.EVL-VEHICLE-LINE-C                         00204700
205200             ,:SMMPD60.MMPD60-TERR-C                              00204800
205300             ,:SMMPD60.MMPD60-FTR-C                               00204900
205400             ,:SMMPD60.MMPD60-PRIFTRSRC-C                         00205000
205500             ,:SMMPD60.MMPD60-FTR-VAL-C                           00205100
205600             ,:SMMPD60.MMPD60-MNRFTR-C                            00205200
205700             ,:SMMPD60.MMPD60-MNRFTRSRC-C                         00205300
205800             ,:SMMPD60.MMPD60-EFFPNTIN-Y                          00205400
205900             ,:SMMPD60.MMPD60-XCLUD-LST-F                         00205500
206000             ,:SMMPD60.MMPD60-REMARK-DS-X                         00205600
206100             ,:SMMPD60.MMPD60-EFFPNTIN-C                          00205700
206200             ,:SMMPD60.MMPD60-EFFPNTOUT-Y                         00205800
206300             ,:SMMPD60.MMPD60-EFFPNTOUT-C                         00205900
206400             ,:SMMPD60.MMPD60-REC-STAT-C                          00206000
206500     END-EXEC                                                     00206100
206600     EVALUATE SQLCODE                      ALSO SQLWARN0          00206200
206700         WHEN DB2-SUCCESSFUL-RETURN        ALSO SPACES            00206300
206800              MOVE MMPD60-REC-STAT-C OF SMMPD60                   00206400
206900                                     TO WS-TEMP-REC-STAT          00206500
207000              MOVE WS-MDLYR TO MMPD59-MDLYR-Y OF SMMPD60          00206600
207100              PERFORM 8300M-SELECT-SMMPD68
207200              IF WS-TEMP-REC-STAT = MMPD60-REC-STAT-C OF SMMPD60
207300                 CONTINUE
207400              ELSE
233200                 MOVE PROGRAM-NAME      TO                        00232800
233300                          MMPD60-LAST-UPD-C OF SMMPD60            00232900
233400                 PERFORM 5300M-UPDATE-SMMPD60                     00233000
233500                    THRU 5300M-UPD-EXIT                           00233100
233501              END-IF
233502         WHEN DB2-NOT-FOUND                ALSO ANY               00207300
233503              SET END-OF-D60-CSR TO TRUE                          00207400
233504         WHEN DB2-DEADLOCK                 ALSO ANY               00207500
233505              PERFORM 6500A-DETECT-INTERNAL-RESTART               00207600
233506                                                                  00207700
233507         WHEN OTHER                                               00207800
233508              MOVE LIT-PARAGRAPH-4420M        TO HE-PARAGRAPH     00207900
233509              MOVE DB2-FETCH-CALL             TO HE-SQL-FUNCTION  00208000
233510              MOVE LIT-MMPD-TERTRY-FEATURE-N  TO HE-DB2-TABLE1    00208100
233511              MOVE PCCJ-ROW-KEY-N             TO HE-MSG1          00208200
233512              PERFORM 5999M-SETUP-DB2-ABEND                       00208300
233513     END-EVALUATE                                                 00208400
233514     .                                                            00208500
233515 4420M-EXIT.                                                      00208600
233516     EXIT.                                                        00208700
233517     EJECT                                                        00208800
233518 4430M-CLOSE-D60-CURSOR.                                          00208900
233519      EXEC SQL                                                    00209000
233520          CLOSE D60-CSR-CHGEND                                    00209100
233521      END-EXEC                                                    00209200
233522                                                                  00209300
233523      EVALUATE SQLCODE                     ALSO SQLWARN0          00209400
233524          WHEN DB2-SUCCESSFUL-RETURN       ALSO SPACES            00209500
233525               CONTINUE                                           00209600
233526                                                                  00209700
233527          WHEN DB2-DEADLOCK                ALSO ANY               00209800
233528               PERFORM 6500A-DETECT-INTERNAL-RESTART              00209900
233529         WHEN OTHER                                               00210000
233530              MOVE LIT-PARAGRAPH-4430M        TO HE-PARAGRAPH     00210100
233531              MOVE DB2-CLOSE-CURSOR-CALL      TO HE-SQL-FUNCTION  00210200
233532              MOVE LIT-MMPD-TERTRY-FEATURE-N  TO HE-DB2-TABLE1    00210300
233533              MOVE PCCJ-ROW-KEY-N             TO HE-MSG1          00210400
233534              PERFORM 5999M-SETUP-DB2-ABEND                       00210500
233535     END-EVALUATE                                                 00210600
233536                                                                  00210700
233537     .                                                            00210800
233538 4430M-EXIT.                                                      00210900
233539     EXIT.                                                        00211000
233540     EJECT                                                        00211100
233541*4500M-PROCESS-D68CJCHG2.                                         00211200
233542*        SET NOT-END-OF-D60-CSR    TO TRUE                        00211300
233543*        PERFORM 4510M-OPEN-D60-CURSOR                            00211400
233544*           THRU 4510M-EXIT                                       00211500
233545*        IF INTERNAL-RESTART                                      00211600
233546*           CONTINUE                                              00211700
233547*        ELSE                                                     00211800
233548*           PERFORM 4520M-FETCH-D60-CURSOR                        00211900
233549*             UNTIL END-OF-D60-CSR OR INTERNAL-RESTART            00212000
233550*        END-IF                                                   00212100
233551*                                                                 00212200
233552*        IF INTERNAL-RESTART                                      00212300
233553*           CONTINUE                                              00212400
233554*        ELSE                                                     00212500
233555*           PERFORM 4530M-CLOSE-D60-CURSOR                        00212600
233556*              THRU 4530M-EXIT                                    00212700
233557*        END-IF                                                   00212800
233558*    .                                                            00212900
233559*4500M-EXIT.                                                      00213000
233560*    EXIT.                                                        00213100
233561*    EJECT                                                        00213200
233562*4510M-OPEN-D60-CURSOR.                                           00213300
233563*    EXEC SQL                                                     00213400
233564*        OPEN D60-CSR-CHGCJ2                                      00213500
233565*    END-EXEC                                                     00213600
233566*                                                                 00213700
233567*    EVALUATE SQLCODE                      ALSO SQLWARN0          00213800
233568*        WHEN DB2-SUCCESSFUL-RETURN        ALSO SPACES            00213900
233569*             CONTINUE                                            00214000
233570*                                                                 00214100
233571*        WHEN DB2-DEADLOCK                 ALSO ANY               00214200
233572*             PERFORM 6500A-DETECT-INTERNAL-RESTART               00214300
233573*                                                                 00214400
233574*        WHEN OTHER                                               00214500
233575*             MOVE LIT-PARAGRAPH-4510M        TO HE-PARAGRAPH     00214600
233576*             MOVE DB2-OPEN-CURSOR-CALL       TO HE-SQL-FUNCTION  00214700
233577*             MOVE LIT-MMPD-TERTRY-FEATURE-N  TO HE-DB2-TABLE1    00214800
233578*             MOVE PCCJ-ROW-KEY-N             TO HE-MSG1          00214900
233579*             PERFORM 5999M-SETUP-DB2-ABEND                       00215000
233580*    END-EVALUATE                                                 00215100
233581*    .                                                            00215200
233582*4510M-EXIT.                                                      00215300
233583*    EXIT.                                                        00215400
233584*    EJECT                                                        00215500
233585*4520M-FETCH-D60-CURSOR.                                          00215600
233586*    EXEC SQL                                                     00215700
233587*       FETCH D60-CSR-CHGCJ2                                      00215800
233588*        INTO :SMMPD60.VEHTYPE-CODE                               00215900
233589*            ,:SMMPD60.PTEIO-ORIGIN-C                             00216000
233590*            ,:SMMPD60.EVL-VEHICLE-LINE-C                         00216100
233591*            ,:SMMPD60.MMPD60-TERR-C                              00216200
233592*            ,:SMMPD60.MMPD60-FTR-C                               00216300
233593*            ,:SMMPD60.MMPD60-PRIFTRSRC-C                         00216400
233594*            ,:SMMPD60.MMPD60-FTR-VAL-C                           00216500
233595*            ,:SMMPD60.MMPD60-MNRFTR-C                            00216600
233596*            ,:SMMPD60.MMPD60-MNRFTRSRC-C                         00216700
233597*            ,:SMMPD60.MMPD60-EFFPNTIN-Y                          00216800
233598*            ,:SMMPD60.MMPD60-XCLUD-LST-F                         00216900
233599*            ,:SMMPD60.MMPD60-REMARK-DS-X                         00217000
233600*            ,:SMMPD60.MMPD60-EFFPNTIN-C                          00217100
233601*            ,:SMMPD60.MMPD60-EFFPNTOUT-Y                         00217200
233602*            ,:SMMPD60.MMPD60-EFFPNTOUT-C                         00217300
233603*            ,:SMMPD60.MMPD60-REC-STAT-C                          00217400
233604*    END-EXEC                                                     00217500
233605*    EVALUATE SQLCODE                      ALSO SQLWARN0          00217600
233606*        WHEN DB2-SUCCESSFUL-RETURN        ALSO SPACES            00217700
233607*             MOVE MMPD60-REC-STAT-C OF SMMPD60                   00217800
233608*                                    TO WS-TEMP-REC-STAT          00217900
233609*             MOVE WS-MDLYR          TO MMPD59-MDLYR-Y  OF SMMPD6000218000
233610*             MOVE LIT-A             TO                           00218100
233611*                               MMPD60-REC-STAT-C OF SMMPD60      00218200
233612*             MOVE PROGRAM-NAME      TO                           00218300
233613*                               MMPD60-LAST-UPD-C OF SMMPD60      00218400
233614*             SET WS-88-D59ROW-NOT-FOUND TO TRUE                  00218500
233615*             PERFORM 8500M-SEL-SMMPD59-VL                        00218600
233616*                THRU 8500M-SEL-EXIT                              00218700
233617*             IF WS-88-D59ROW-NOT-FOUND AND NOT-INTERNAL-RESTART  00218800
233618*                PERFORM 8500M-POPULATE-SMMPD59                   00218900
233619*                   THRU 8500M-EXIT                               00219000
233620*             END-IF                                              00219100
233621*             IF NOT-INTERNAL-RESTART                             00219200
233622*                PERFORM 5200M-INSERT-SMMPD60                     00219300
233623*                   THRU 5200M-INS-EXIT                           00219400
233624*             END-IF                                              00219500
233625*             IF NOT-INTERNAL-RESTART                             00219600
233626*                PERFORM 5520M-INSERT-NGTVTC                      00219700
233627*                   THRU 5520M-EXIT                               00219800
233628*             END-IF                                              00219900
233629*        WHEN DB2-NOT-FOUND                ALSO ANY               00220000
233630*             SET END-OF-D60-CSR TO TRUE                          00220100
233631*        WHEN DB2-DEADLOCK                 ALSO ANY               00220200
233632*             PERFORM 6500A-DETECT-INTERNAL-RESTART               00220300
233633*                                                                 00220400
233634*        WHEN OTHER                                               00220500
233635*             MOVE LIT-PARAGRAPH-4520M        TO HE-PARAGRAPH     00220600
233636*             MOVE DB2-FETCH-CALL             TO HE-SQL-FUNCTION  00220700
233637*             MOVE LIT-MMPD-TERTRY-FEATURE-N  TO HE-DB2-TABLE1    00220800
233638*             MOVE PCCJ-ROW-KEY-N             TO HE-MSG1          00220900
233639*             PERFORM 5999M-SETUP-DB2-ABEND                       00221000
233640*    END-EVALUATE                                                 00221100
233641*    .                                                            00221200
233642*4520M-EXIT.                                                      00221300
233643*    EXIT.                                                        00221400
233644*    EJECT                                                        00221500
233645*4530M-CLOSE-D60-CURSOR.                                          00221600
233646*     EXEC SQL                                                    00221700
233647*         CLOSE D60-CSR-CHGCJ2                                    00221800
233648*     END-EXEC                                                    00221900
233649*                                                                 00222000
233650*     EVALUATE SQLCODE                     ALSO SQLWARN0          00222100
233651*         WHEN DB2-SUCCESSFUL-RETURN       ALSO SPACES            00222200
233652*              CONTINUE                                           00222300
233653*                                                                 00222400
233654*         WHEN DB2-DEADLOCK                ALSO ANY               00222500
233655*              PERFORM 6500A-DETECT-INTERNAL-RESTART              00222600
233656*        WHEN OTHER                                               00222700
233657*             MOVE LIT-PARAGRAPH-4530M        TO HE-PARAGRAPH     00222800
233658*             MOVE DB2-CLOSE-CURSOR-CALL      TO HE-SQL-FUNCTION  00222900
233659*             MOVE LIT-MMPD-TERTRY-FEATURE-N  TO HE-DB2-TABLE1    00223000
233660*             MOVE PCCJ-ROW-KEY-N             TO HE-MSG1          00223100
233661*             PERFORM 5999M-SETUP-DB2-ABEND                       00223200
233662*    END-EVALUATE                                                 00223300
233663*                                                                 00223400
233664*    .                                                            00223500
233665*4530M-EXIT.                                                      00223600
233666*    EXIT.                                                        00223700
233667*    EJECT                                                        00223800
233668 4600M-PROCESS-D68CJSTDT.                                         00223900
233669         SET NOT-END-OF-D60-CSR    TO TRUE                        00224000
233670         PERFORM 4610M-OPEN-D60-CURSOR                            00224100
233671            THRU 4610M-EXIT                                       00224200
233672         IF INTERNAL-RESTART                                      00224300
233673            CONTINUE                                              00224400
233674         ELSE                                                     00224500
233675            PERFORM 4620M-FETCH-D60-CURSOR                        00224600
233676              UNTIL END-OF-D60-CSR OR INTERNAL-RESTART            00224700
233677         END-IF                                                   00224800
233678                                                                  00224900
233679         IF INTERNAL-RESTART                                      00225000
233680            CONTINUE                                              00225100
233681         ELSE                                                     00225200
233682            PERFORM 4630M-CLOSE-D60-CURSOR                        00225300
233683               THRU 4630M-EXIT                                    00225400
233684         END-IF                                                   00225500
233685     .                                                            00225600
233686 4600M-EXIT.                                                      00225700
233687     EXIT.                                                        00225800
233688     EJECT                                                        00225900
233689 4610M-OPEN-D60-CURSOR.                                           00226000
233690     EXEC SQL                                                     00226100
233691         OPEN D60-CSR-CHGST                                       00226200
233692     END-EXEC                                                     00226300
233693                                                                  00226400
233694     EVALUATE SQLCODE                      ALSO SQLWARN0          00226500
233695         WHEN DB2-SUCCESSFUL-RETURN        ALSO SPACES            00226600
233696              CONTINUE                                            00226700
233697                                                                  00226800
233698         WHEN DB2-DEADLOCK                 ALSO ANY               00226900
233699              PERFORM 6500A-DETECT-INTERNAL-RESTART               00227000
233700                                                                  00227100
233701         WHEN OTHER                                               00227200
233702              MOVE LIT-PARAGRAPH-4610M        TO HE-PARAGRAPH     00227300
233703              MOVE DB2-OPEN-CURSOR-CALL       TO HE-SQL-FUNCTION  00227400
233704              MOVE LIT-MMPD-TERTRY-FEATURE-N  TO HE-DB2-TABLE1    00227500
233705              MOVE PCCJ-ROW-KEY-N             TO HE-MSG1          00227600
233706              PERFORM 5999M-SETUP-DB2-ABEND                       00227700
233707     END-EVALUATE                                                 00227800
233708     .                                                            00227900
233709 4610M-EXIT.                                                      00228000
233710     EXIT.                                                        00228100
233711     EJECT                                                        00228200
233712 4620M-FETCH-D60-CURSOR.                                          00228300
233713     EXEC SQL                                                     00228400
233714        FETCH D60-CSR-CHGST                                       00228500
233715         INTO :SMMPD60.VEHTYPE-CODE                               00228600
233716             ,:SMMPD60.PTEIO-ORIGIN-C                             00228700
233717             ,:SMMPD60.EVL-VEHICLE-LINE-C                         00228800
233718             ,:SMMPD60.MMPD60-TERR-C                              00228900
233719             ,:SMMPD60.MMPD60-FTR-C                               00229000
233720             ,:SMMPD60.MMPD60-PRIFTRSRC-C                         00229100
233721             ,:SMMPD60.MMPD60-FTR-VAL-C                           00229200
233722             ,:SMMPD60.MMPD60-MNRFTR-C                            00229300
233723             ,:SMMPD60.MMPD60-MNRFTRSRC-C                         00229400
233724             ,:SMMPD60.MMPD60-EFFPNTIN-Y                          00229500
233725             ,:SMMPD60.MMPD60-XCLUD-LST-F                         00229600
233726             ,:SMMPD60.MMPD60-REMARK-DS-X                         00229700
233727             ,:SMMPD60.MMPD60-EFFPNTIN-C                          00229800
233728             ,:SMMPD60.MMPD60-EFFPNTOUT-Y                         00229900
233729             ,:SMMPD60.MMPD60-EFFPNTOUT-C                         00230000
233730             ,:SMMPD60.MMPD60-REC-STAT-C                          00230100
233731     END-EXEC                                                     00230200
233732     EVALUATE SQLCODE                      ALSO SQLWARN0          00230300
233733         WHEN DB2-SUCCESSFUL-RETURN        ALSO SPACES            00230400
233734*USAGE BY PLANT CHANGE STARTS                                     00230500
233735              MOVE MMPD60-REC-STAT-C OF SMMPD60                   00230600
233736                                     TO WS-TEMP-REC-STAT          00230700
233737              MOVE WS-MDLYR          TO MMPD59-MDLYR-Y  OF SMMPD6000230800
233738              PERFORM 8300M-SELECT-SMMPD68
233739              IF WS-TEMP-REC-STAT = MMPD60-REC-STAT-C OF SMMPD60
233740                 CONTINUE
233741              ELSE
233742                 MOVE PROGRAM-NAME      TO                        00232800
233743                          MMPD60-LAST-UPD-C OF SMMPD60            00232900
233744                 PERFORM 5300M-UPDATE-SMMPD60                     00233000
233745                    THRU 5300M-UPD-EXIT                           00233100
233746              END-IF
233747*             MOVE LIT-A             TO                           00230900
233748*                               MMPD60-REC-STAT-C OF SMMPD60      00231000
233749*             MOVE PROGRAM-NAME      TO                           00231100
233750*                               MMPD60-LAST-UPD-C OF SMMPD60      00231200
233751*             SET WS-88-D59ROW-NOT-FOUND TO TRUE                  00231300
233752*             PERFORM 8500M-SEL-SMMPD59-VL                        00231400
233753*                THRU 8500M-SEL-EXIT                              00231500
233754*             IF WS-88-D59ROW-NOT-FOUND                           00231600
233755*                PERFORM 8500M-POPULATE-SMMPD59                   00231700
233756*                   THRU 8500M-EXIT                               00231800
233757*             END-IF                                              00231900
233758*             PERFORM 5200M-INSERT-SMMPD60                        00232000
233759*                THRU 5200M-INS-EXIT                              00232100
233760*             PERFORM 5520M-INSERT-NGTVTC                         00232200
233761*                THRU 5520M-EXIT                                  00232300
233762*             MOVE MMPD60-REC-STAT-C OF SMMPD60                   00232400
233763*                                    TO WS-TEMP-REC-STAT          00232500
233764*             MOVE LIT-I             TO                           00232600
233765*                         MMPD60-REC-STAT-C OF SMMPD60            00232700
233766*             MOVE PROGRAM-NAME      TO                           00232800
233767*                         MMPD60-LAST-UPD-C OF SMMPD60            00232900
233768*             PERFORM 5200M-UPDATE-SMMPD60                        00233000
233769*                THRU 5200M-UPD-EXIT                              00233100
233770*USAGE BY PLANT CHANGE ENDS                                       00233200
233780         WHEN DB2-NOT-FOUND                ALSO ANY               00233300
233800              SET END-OF-D60-CSR TO TRUE                          00233400
233900         WHEN DB2-DEADLOCK                 ALSO ANY               00233500
234000              PERFORM 6500A-DETECT-INTERNAL-RESTART               00233600
234100                                                                  00233700
234200         WHEN OTHER                                               00233800
234300              MOVE LIT-PARAGRAPH-4620M        TO HE-PARAGRAPH     00233900
234400              MOVE DB2-FETCH-CALL             TO HE-SQL-FUNCTION  00234000
234500              MOVE LIT-MMPD-TERTRY-FEATURE-N  TO HE-DB2-TABLE1    00234100
234600              MOVE PCCJ-ROW-KEY-N             TO HE-MSG1          00234200
234700              PERFORM 5999M-SETUP-DB2-ABEND                       00234300
234800     END-EVALUATE                                                 00234400
234900     .                                                            00234500
235000 4620M-EXIT.                                                      00234600
235100     EXIT.                                                        00234700
235200     EJECT                                                        00234800
235300 4630M-CLOSE-D60-CURSOR.                                          00234900
235400      EXEC SQL                                                    00235000
235500          CLOSE D60-CSR-CHGST                                     00235100
235600      END-EXEC                                                    00235200
235700                                                                  00235300
235800      EVALUATE SQLCODE                     ALSO SQLWARN0          00235400
235900          WHEN DB2-SUCCESSFUL-RETURN       ALSO SPACES            00235500
236000               CONTINUE                                           00235600
236100                                                                  00235700
236200          WHEN DB2-DEADLOCK                ALSO ANY               00235800
236300               PERFORM 6500A-DETECT-INTERNAL-RESTART              00235900
236400         WHEN OTHER                                               00236000
236500              MOVE LIT-PARAGRAPH-4630M        TO HE-PARAGRAPH     00236100
236600              MOVE DB2-CLOSE-CURSOR-CALL      TO HE-SQL-FUNCTION  00236200
236700              MOVE LIT-MMPD-TERTRY-FEATURE-N  TO HE-DB2-TABLE1    00236300
236800              MOVE PCCJ-ROW-KEY-N             TO HE-MSG1          00236400
236900              PERFORM 5999M-SETUP-DB2-ABEND                       00236500
237000     END-EVALUATE                                                 00236600
237100                                                                  00236700
237200     .                                                            00236800
237300 4630M-EXIT.                                                      00236900
237400     EXIT.                                                        00237000
237500     EJECT                                                        00237100
237600*4700M-PROCESS-D68CJCHG4.                                         00237200
237700*        SET NOT-END-OF-D60-CSR    TO TRUE                        00237300
237800*        PERFORM 4710M-OPEN-D60-CURSOR                            00237400
237900*           THRU 4710M-EXIT                                       00237500
238000*        IF INTERNAL-RESTART                                      00237600
238100*           CONTINUE                                              00237700
238200*        ELSE                                                     00237800
238300*           PERFORM 4720M-FETCH-D60-CURSOR                        00237900
238400*             UNTIL END-OF-D60-CSR OR INTERNAL-RESTART            00238000
238500*        END-IF                                                   00238100
238600*                                                                 00238200
238700*        IF INTERNAL-RESTART                                      00238300
238800*           CONTINUE                                              00238400
238900*        ELSE                                                     00238500
239000*           PERFORM 4730M-CLOSE-D60-CURSOR                        00238600
239100*              THRU 4730M-EXIT                                    00238700
239200*        END-IF                                                   00238800
239300*    .                                                            00238900
239400*4700M-EXIT.                                                      00239000
239500*    EXIT.                                                        00239100
239600*    EJECT                                                        00239200
239700*4710M-OPEN-D60-CURSOR.                                           00239300
239800*    EXEC SQL                                                     00239400
239900*        OPEN D60-CSR-CHGCJ4                                      00239500
240000*    END-EXEC                                                     00239600
240100*                                                                 00239700
240200*    EVALUATE SQLCODE                      ALSO SQLWARN0          00239800
240300*        WHEN DB2-SUCCESSFUL-RETURN        ALSO SPACES            00239900
240400*             CONTINUE                                            00240000
240500*                                                                 00240100
240600*        WHEN DB2-DEADLOCK                 ALSO ANY               00240200
240700*             PERFORM 6500A-DETECT-INTERNAL-RESTART               00240300
240800*                                                                 00240400
240900*        WHEN OTHER                                               00240500
241000*             MOVE LIT-PARAGRAPH-4710M        TO HE-PARAGRAPH     00240600
241100*             MOVE DB2-OPEN-CURSOR-CALL       TO HE-SQL-FUNCTION  00240700
241200*             MOVE LIT-MMPD-TERTRY-FEATURE-N  TO HE-DB2-TABLE1    00240800
241300*             MOVE PCCJ-ROW-KEY-N             TO HE-MSG1          00240900
241400*             PERFORM 5999M-SETUP-DB2-ABEND                       00241000
241500*    END-EVALUATE                                                 00241100
241600*    .                                                            00241200
241700*4710M-EXIT.                                                      00241300
241800*    EXIT.                                                        00241400
241900*    EJECT                                                        00241500
242000*4720M-FETCH-D60-CURSOR.                                          00241600
242100*    EXEC SQL                                                     00241700
242200*       FETCH D60-CSR-CHGCJ4                                      00241800
242300*        INTO :SMMPD60.VEHTYPE-CODE                               00241900
242400*            ,:SMMPD60.PTEIO-ORIGIN-C                             00242000
242500*            ,:SMMPD60.EVL-VEHICLE-LINE-C                         00242100
242600*            ,:SMMPD60.MMPD60-TERR-C                              00242200
242700*            ,:SMMPD60.MMPD60-FTR-C                               00242300
242800*            ,:SMMPD60.MMPD60-PRIFTRSRC-C                         00242400
242900*            ,:SMMPD60.MMPD60-FTR-VAL-C                           00242500
243000*            ,:SMMPD60.MMPD60-MNRFTR-C                            00242600
243100*            ,:SMMPD60.MMPD60-MNRFTRSRC-C                         00242700
243200*            ,:SMMPD60.MMPD60-EFFPNTIN-Y                          00242800
243300*            ,:SMMPD60.MMPD60-XCLUD-LST-F                         00242900
243400*            ,:SMMPD60.MMPD60-REMARK-DS-X                         00243000
243500*            ,:SMMPD60.MMPD60-EFFPNTIN-C                          00243100
243600*            ,:SMMPD60.MMPD60-EFFPNTOUT-Y                         00243200
243700*            ,:SMMPD60.MMPD60-EFFPNTOUT-C                         00243300
243800*            ,:SMMPD60.MMPD60-REC-STAT-C                          00243400
243900*    END-EXEC                                                     00243500
244000*    EVALUATE SQLCODE                      ALSO SQLWARN0          00243600
244100*        WHEN DB2-SUCCESSFUL-RETURN        ALSO SPACES            00243700
244200*USAGE BY PLANT CHANGE START                                      00243800
244300*             MOVE MMPD60-REC-STAT-C OF SMMPD60                   00243900
244400*                                    TO WS-TEMP-REC-STAT          00244000
244500*             MOVE WS-MDLYR          TO MMPD59-MDLYR-Y  OF SMMPD6000244100
244600*             MOVE LIT-I             TO                           00244200
244700*                         MMPD60-REC-STAT-C OF SMMPD60            00244300
244800*             MOVE PROGRAM-NAME      TO                           00244400
244900*                         MMPD60-LAST-UPD-C OF SMMPD60            00244500
245000*             PERFORM 5300M-UPDATE-SMMPD60                        00244600
245100*                THRU 5300M-UPD-EXIT                              00244700
245200*             MOVE MMPD60-REC-STAT-C OF SMMPD60                   00244800
245300*                                    TO WS-TEMP-REC-STAT          00244900
245400*             MOVE WS-MDLYR          TO MMPD59-MDLYR-Y  OF SMMPD6000245000
245500*             MOVE LIT-A             TO                           00245100
245600*                               MMPD60-REC-STAT-C OF SMMPD60      00245200
245700*             MOVE PROGRAM-NAME      TO                           00245300
245800*                               MMPD60-LAST-UPD-C OF SMMPD60      00245400
245900*             SET WS-88-D59ROW-NOT-FOUND TO TRUE                  00245500
246000*             PERFORM 8500M-SEL-SMMPD59-VL                        00245600
246100*                THRU 8500M-SEL-EXIT                              00245700
246200*             IF WS-88-D59ROW-NOT-FOUND                           00245800
246300*                PERFORM 8500M-POPULATE-SMMPD59                   00245900
246400*                   THRU 8500M-EXIT                               00246000
246500*             END-IF                                              00246100
246600*             PERFORM 5200M-INSERT-SMMPD60                        00246200
246700*                THRU 5200M-INS-EXIT                              00246300
246800*             PERFORM 5520M-INSERT-NGTVTC                         00246400
246900*                THRU 5520M-EXIT                                  00246500
247000*USAGE BY PLANT CHANGE ENDS                                       00246600
247100*        WHEN DB2-NOT-FOUND                ALSO ANY               00246700
247200*             SET END-OF-D60-CSR TO TRUE                          00246800
247300*        WHEN DB2-DEADLOCK                 ALSO ANY               00246900
247400*             PERFORM 6500A-DETECT-INTERNAL-RESTART               00247000
247500*                                                                 00247100
247600*        WHEN OTHER                                               00247200
247700*             MOVE LIT-PARAGRAPH-4720M        TO HE-PARAGRAPH     00247300
247800*             MOVE DB2-FETCH-CALL             TO HE-SQL-FUNCTION  00247400
247900*             MOVE LIT-MMPD-TERTRY-FEATURE-N  TO HE-DB2-TABLE1    00247500
248000*             MOVE PCCJ-ROW-KEY-N             TO HE-MSG1          00247600
248100*             PERFORM 5999M-SETUP-DB2-ABEND                       00247700
248200*    END-EVALUATE                                                 00247800
248300*    .                                                            00247900
248400*4720M-EXIT.                                                      00248000
248500*    EXIT.                                                        00248100
248600*    EJECT                                                        00248200
248700*4730M-CLOSE-D60-CURSOR.                                          00248300
248800*     EXEC SQL                                                    00248400
248900*         CLOSE D60-CSR-CHGCJ4                                    00248500
249000*     END-EXEC                                                    00248600
249100*                                                                 00248700
249200*     EVALUATE SQLCODE                     ALSO SQLWARN0          00248800
249300*         WHEN DB2-SUCCESSFUL-RETURN       ALSO SPACES            00248900
249400*              CONTINUE                                           00249000
249500*                                                                 00249100
249600*         WHEN DB2-DEADLOCK                ALSO ANY               00249200
249700*              PERFORM 6500A-DETECT-INTERNAL-RESTART              00249300
249800*        WHEN OTHER                                               00249400
249900*             MOVE LIT-PARAGRAPH-4730M        TO HE-PARAGRAPH     00249500
250000*             MOVE DB2-CLOSE-CURSOR-CALL      TO HE-SQL-FUNCTION  00249600
250100*             MOVE LIT-MMPD-TERTRY-FEATURE-N  TO HE-DB2-TABLE1    00249700
250200*             MOVE PCCJ-ROW-KEY-N             TO HE-MSG1          00249800
250300*             PERFORM 5999M-SETUP-DB2-ABEND                       00249900
250400*    END-EVALUATE                                                 00250000
250500*                                                                 00250100
250600*    .                                                            00250200
250700*4730M-EXIT.                                                      00250300
250800*    EXIT.                                                        00250400
250900*    EJECT                                                        00250500
251000* CHECK MMEA DATES RUBBER BAND CONDITION TO DETERMINE THE RECORD
251100* STATUS BEFORE UPDATING THE D60 RECORD.
251200 8300M-SELECT-SMMPD68.
251300
251400     EXEC SQL
251500       SELECT " "
251600         INTO :WS-SPACES
251700         FROM SMMPD68_ENG_PT_MY
251800         WHERE VEHTYPE_CODE     = :SMMPD60.VEHTYPE-CODE
251900         AND PTEIO_ORIGIN_C     = :LIT-WERS
252000         AND EVL_VEHICLE_LINE_C = :SMMPD60.EVL-VEHICLE-LINE-C
252100         AND VAMY_PROD_STRT_Y   <= :SMMPD60.MMPD60-EFFPNTOUT-Y
252200         AND VAMY_PROD_END_Y    >= :SMMPD60.MMPD60-EFFPNTIN-Y
252300         AND REGINT_C           = :SMMPD68.REGINT-C
252400         AND VAMY_MDLYR_R       = :SMMPD60.MMPD59-MDLYR-Y
252500     END-EXEC
252600
252700     EVALUATE SQLCODE                 ALSO SQLWARN0
252800         WHEN DB2-SUCCESSFUL-RETURN   ALSO SPACES
252900              IF (WS-TEMP-REC-STAT = LIT-P OR
253000                 WS-TEMP-REC-STAT = LIT-A)
253100                CONTINUE
253200              ELSE
253300                MOVE LIT-A TO MMPD60-REC-STAT-C  OF SMMPD60
253400              END-IF
253500         WHEN DB2-NOT-FOUND       ALSO ANY
253600              IF (WS-TEMP-REC-STAT = LIT-F OR
253700                 WS-TEMP-REC-STAT = LIT-I)
253800                CONTINUE
253900              ELSE
254000                MOVE LIT-I TO MMPD60-REC-STAT-C  OF SMMPD60
254100              END-IF
254200         WHEN DB2-DEADLOCK          ALSO ANY
254300              PERFORM 6500A-DETECT-INTERNAL-RESTART
254400         WHEN OTHER
254401             SET WS-ABEND-SQL-ERROR        TO TRUE                00173100
254402             MOVE LIT-PARAGRAPH-8300M       TO HE-PARAGRAPH       00173200
254403             MOVE DB2-SELECT-CALL           TO HE-SQL-FUNCTION    00173300
254404             PERFORM 5400M-CALL-DSNTIAR                           00173400
254405             MOVE SQLERRMC                 TO HE-SQL-ERROR-MESSAGE00173500
254406             MOVE LIT-MMPD-CNTRY-XREF-TBL-N TO HE-DB2-TABLE1      00173600
254407             MOVE WS-MDLYR                  TO WS-NUM-MDLYR       00173700
254408             STRING                                               00173800
254409                 WS-D68-VEHTYPE              ","                  00173900
254410                 WS-D68-VEHICLE-LINE         ","                  00174000
254411                 WS-D68-PTEIO-ORIGIN         ","                  00174100
254412                 WS-NUM-MDLYR                ","                  00174200
254413                 WS-D68-REGINT-C                                  00174300
254414                 DELIMITED BY SIZE INTO HE-MSG1                   00174400
254415             END-STRING                                           00174500
254416             PERFORM 9990H-ABNORMAL-END-OF-JOB                    00174600
254417                                                                  00174700
254418     END-EVALUATE
254419     .
254420 8300M-EXIT.
254430     EXIT.
254440     EJECT
254441*FIX1 ENDS
254442 4800M-INSERT-SMMPD55.                                            00250600
254443******************************************************************00250700
254444* INSERT THE RECORDS INTO SMMPD55 TABLE. FOR EFFECTIVE IN DATE ..*00250800
254445* SMALLEST DATE TO BE MAINTAINED AND FOR EFFECTIVE OUT DATE      *00250900
254446* HIGHEST DATE SHOULD BE MAINTAINED.                             *00251000
254447******************************************************************00251100
254448                                                                  00251200
254449     MOVE 'MMEA_OLD_DATE'        TO VALID-FIELD-ID OF SMMPD55     00251300
254450     MOVE PROGRAM-NAME           TO P-LAST-UPDATE-C OF SMMPD55    00251400
254451                                                                  00251500
254452     MOVE VEHTYPE-CODE OF SMMPD68 TO WS-D55-PROD-TYPE             00251600
254453     MOVE EVL-VEHICLE-LINE-C OF SMMPD68                           00251700
254454                                  TO WS-D55-VEH-LINE              00251800
254455     MOVE VAMY-MDLYR-R OF SMMPD68 TO WS-D55-MODEL-YEAR            00251900
254456     MOVE REGINT-C     OF SMMPD68 TO WS-D55-REGION                00252000
254457     MOVE WS-VALID-FIELD-C        TO VALID-FIELD-C OF SMMPD55     00252100
254458                                                                  00252200
254459     MOVE PTEIO-ORIGIN-C   OF SMMPD68 TO WS-D55-ORIGIN            00252300
254460     MOVE WS-VALID-DESC-X             TO VALID-DESC-X OF SMMPD55  00252400
254461                                                                  00252500
254462     EXEC SQL                                                     00252600
254463          INSERT INTO SMMPD55_VALIDATION                          00252700
254464          (VALID_FIELD_ID                                         00252800
254465          ,VALID_FIELD_C                                          00252900
254466          ,VALID_DESC_X                                           00253000
254467          ,P_LAST_UPDATE_S                                        00253100
254468          ,P_LAST_UPDATE_C                                        00253200
254469          )                                                       00253300
254470          VALUES                                                  00253400
254471          (:SMMPD55.VALID-FIELD-ID                                00253500
254472          ,:SMMPD55.VALID-FIELD-C                                 00253600
254473          ,:SMMPD55.VALID-DESC-X                                  00253700
254474          ,CURRENT TIMESTAMP                                      00253800
254475          ,:SMMPD55.P-LAST-UPDATE-C                               00253900
254476          )                                                       00254000
254500     END-EXEC                                                     00254100
254600     EVALUATE SQLCODE               ALSO SQLWARN0                 00254200
254700     WHEN DB2-SUCCESSFUL-RETURN   ALSO SPACES                     00254300
254800          ADD 1  TO WS-SMMPD55-ISRT-CNT                           00254400
254900     WHEN DB2-DUPLICATE-ROW   ALSO ANY                            00254500
255000          PERFORM 4820M-SELECT-SMMPD55                            00254600
255100             THRU 4820M-EXIT                                      00254700
255200     WHEN DB2-DEADLOCK          ALSO ANY                          00254800
255300         PERFORM 6500A-DETECT-INTERNAL-RESTART                    00254900
255400                                                                  00255000
255500     WHEN OTHER                                                   00255100
255600         SET WS-ABEND-SQL-ERROR         TO TRUE                   00255200
255700         MOVE LIT-PARAGRAPH-4800M       TO HE-PARAGRAPH           00255300
255800         MOVE DB2-INSERT-CALL           TO HE-SQL-FUNCTION        00255400
255900         PERFORM 5400M-CALL-DSNTIAR                               00255500
256000         MOVE SQLERRMC                  TO HE-SQL-ERROR-MESSAGE   00255600
256100         MOVE LIT-MMPD-VALIDATION-TBL-N TO HE-DB2-TABLE1          00255700
256200         STRING                                                   00255800
256300             VALID-FIELD-ID OF SMMPD55   ","                      00255900
256400             VALID-FIELD-C  OF SMMPD55   ","                      00256000
256500             VALID-DESC-X   OF SMMPD55                            00256100
256600             DELIMITED BY SIZE INTO HE-MSG1                       00256200
256700         END-STRING                                               00256300
256800         PERFORM 9990H-ABNORMAL-END-OF-JOB                        00256400
256900     END-EVALUATE                                                 00256500
257000     .                                                            00256600
257100 4800M-EXIT.                                                      00256700
257200     EXIT.                                                        00256800
257300 4820M-SELECT-SMMPD55.                                            00256900
257400******************************************************************00257000
257500* THIS PARA WILL SELECT THE EXISTING RECORD FROM SMMPD55 TABLE...*00257100
257600******************************************************************00257200
257700                                                                  00257300
257800     EXEC SQL                                                     00257400
257900       SELECT  VALID_DESC_X                                       00257500
258000         INTO :SMMPD55.VALID-DESC-X                               00257600
258100         FROM  SMMPD55_VALIDATION                                 00257700
258200        WHERE  VALID_FIELD_ID        = :SMMPD55.VALID-FIELD-ID    00257800
258300          AND  VALID_FIELD_C         = :SMMPD55.VALID-FIELD-C     00257900
258400     END-EXEC.                                                    00258000
258500                                                                  00258100
258600     EVALUATE SQLCODE               ALSO SQLWARN0                 00258200
258700                                                                  00258300
258800         WHEN DB2-SUCCESSFUL-RETURN ALSO ANY                      00258400
258900             ADD +1                    TO WS-SMMPD55-SEL-CNT      00258500
259000             MOVE VALID-DESC-X OF SMMPD55                         00258600
259100                                       TO WS-VALID-DESC-X-UPD     00258700
259200             PERFORM 4840M-UPDATE-SMMPD55                         00258800
259300                THRU 4840M-EXIT                                   00258900
259400                                                                  00259000
259500         WHEN DB2-DEADLOCK          ALSO ANY                      00259100
259600             PERFORM 6500A-DETECT-INTERNAL-RESTART                00259200
259700                                                                  00259300
259800         WHEN OTHER                                               00259400
259900             SET WS-ABEND-SQL-ERROR        TO TRUE                00259500
260000             MOVE LIT-PARAGRAPH-4820M      TO HE-PARAGRAPH        00259600
260100             MOVE DB2-SELECT-CALL          TO HE-SQL-FUNCTION     00259700
260200             PERFORM 5400M-CALL-DSNTIAR                           00259800
260300             MOVE SQLERRMC                 TO HE-SQL-ERROR-MESSAGE00259900
260400             MOVE LIT-MMPD-VALIDATION-TBL-N TO HE-DB2-TABLE1      00260000
260500             STRING                                               00260100
260600                 VALID-FIELD-ID OF SMMPD55   ","                  00260200
260700                 VALID-FIELD-C  OF SMMPD55                        00260300
260800                 DELIMITED BY SIZE INTO HE-MSG1                   00260400
260900             END-STRING                                           00260500
261000             PERFORM 9990H-ABNORMAL-END-OF-JOB                    00260600
261100                                                                  00260700
261200     END-EVALUATE                                                 00260800
261300     .                                                            00260900
261400 4820M-EXIT.                                                      00261000
261500     EXIT.                                                        00261100
261600     .                                                            00261200
261700 4840M-UPDATE-SMMPD55.                                            00261300
261800******************************************************************00261400
261900* THIS PARA WILL UPDATE THE SMMPD55 TABLE AFTER MODIFYING THE  ..*00261500
262000* DATES. FOR EFFECTIVE IN DATE SMALLEST DATE WILL BE MAINTAINED  *00261600
262100* AND FOR EFFECTIVE OUT DATE HIGHEST DATE WILL BE MAINTAINED     *00261700
262200******************************************************************00261800
262300                                                                  00261900
262400     IF PCER-ATTR-N = LIT-VAMY-PROD-STRT-Y-ATTR-N                 00262000
262500         MOVE WS-D55-END-DATE-UPD   TO WS-D55-END-DATE            00262100
262600     END-IF                                                       00262200
262700     IF PCER-ATTR-N = LIT-VAMY-PROD-END-Y-ATTR-N                  00262300
262800         MOVE WS-D55-START-DATE-UPD TO WS-D55-START-DATE          00262400
262900     END-IF                                                       00262500
263000                                                                  00262600
263100     MOVE WS-VALID-DESC-X TO VALID-DESC-X OF SMMPD55              00262700
263200                                                                  00262800
263300     EXEC SQL                                                     00262900
263400          UPDATE SMMPD55_VALIDATION                               00263000
263500             SET VALID_DESC_X       = :SMMPD55.VALID-DESC-X       00263100
263600               , P_LAST_UPDATE_S    = CURRENT TIMESTAMP           00263200
263700               , P_LAST_UPDATE_C    = :SMMPD55.P-LAST-UPDATE-C    00263300
263800          WHERE  VALID_FIELD_ID     = :SMMPD55.VALID-FIELD-ID     00263400
263900            AND  VALID_FIELD_C      = :SMMPD55.VALID-FIELD-C      00263500
264000     END-EXEC                                                     00263600
264100                                                                  00263700
264200     EVALUATE SQLCODE               ALSO SQLWARN0                 00263800
264300     WHEN DB2-SUCCESSFUL-RETURN  ALSO SPACES                      00263900
264400          ADD 1  TO WS-SMMPD55-UPDT-CNT                           00264000
264500     WHEN DB2-DEADLOCK           ALSO ANY                         00264100
264600         PERFORM 6500A-DETECT-INTERNAL-RESTART                    00264200
264700     WHEN OTHER                                                   00264300
264800         SET WS-ABEND-SQL-ERROR         TO TRUE                   00264400
264900         MOVE LIT-PARAGRAPH-4840M       TO HE-PARAGRAPH           00264500
265000         MOVE DB2-UPDATE-CALL           TO HE-SQL-FUNCTION        00264600
265100         PERFORM 5400M-CALL-DSNTIAR                               00264700
265200         MOVE SQLERRMC                  TO HE-SQL-ERROR-MESSAGE   00264800
265300         MOVE LIT-MMPD-VALIDATION-TBL-N TO HE-DB2-TABLE1          00264900
265400         STRING                                                   00265000
265500             VALID-FIELD-ID OF SMMPD55   ","                      00265100
265600             VALID-FIELD-C  OF SMMPD55   ","                      00265200
265700             VALID-DESC-X   OF SMMPD55                            00265300
265800             DELIMITED BY SIZE INTO HE-MSG1                       00265400
265900         END-STRING                                               00265500
266000         PERFORM 9990H-ABNORMAL-END-OF-JOB                        00265600
266100     END-EVALUATE                                                 00265700
266200     .                                                            00265800
266300 4840M-EXIT.                                                      00265900
266400     EXIT.                                                        00266000
266500     .                                                            00266100
266600*===============================================================* 00266200
266700*                    5000A-GET-NEXT-DRIVING-RECORD              * 00266300
266800*---------------------------------------------------------------* 00266400
266900*    PERFORMED BY :  0300H-OBTAIN-REQUEST-PARMS                 * 00266500
267000*                    3500H-PROCESS                              * 00266600
267100*===============================================================* 00266700
267200 5000A-GET-NEXT-DRIVING-RECORD.                                   00266800
267300***************************************************************** 00266900
267400*                                                               * 00267000
267500*  THIS PARAGRAPH SHOULD BE USED TO OBTAIN THE NEXT RECORD TO   * 00267100
267600*  BE USED TO "DRIVE" APPLICATION LOGIC.                        * 00267200
267700*                                                               * 00267300
267800*  NOTE:  THE PROGRAMMER IS RESPONSIBLE FOR SETTING THE SWITCH  * 00267400
267900*         "DRIVING-RECORD-OBTAINED". THIS WILL INFORM THE SHELL * 00267500
268000*         TO CONTINUE PROCESSING.                               * 00267600
268100*                                                               * 00267700
268200*  PROGRAMMERS USING PRIMING READ MAY WISH TO BREAK THE INPUT   * 00267800
268300*  INTO "REQUESTS" BY SETTING REQUEST-COMPLETE TO TRUE WHEN     * 00267900
268400*  A BREAK OCCURS.  YOU CAN THEN USE PARA. 3100A FOR PRE-       * 00268000
268500*  LIMINARY PROCESSING AND PARA. 3400A FOR FINISHING UP.        * 00268100
268600*                                                               * 00268200
268700*  IF THE END OF DRIVING RECORDS SIGNIFIES THE END OF THE       * 00268300
268800*  RUN, SET NO-MORE-REQUESTS-TO-PROCESS TO TRUE WHEN IT         * 00268400
268900*  OCCURS.                                                      * 00268500
269000*                                                               * 00268600
269100***************************************************************** 00268700
269200*                                                                 00268800
269300     SET NOT-DRIVING-RECORD-OBTAINED TO TRUE                      00268900
269400                                                                  00269000
269500     PERFORM 5150M-FETCH-CHG-JRNL-CURSOR                          00269100
269600        THRU 5150M-EXIT                                           00269200
269700     .                                                            00269300
269800 5000A-EXIT.                                                      00269400
269900     EXIT.                                                        00269500
270000     EJECT                                                        00269600
270100 5100M-OPEN-CHG-JRNL-CURSOR.                                      00269700
270200                                                                  00269800
270300     EXEC SQL                                                     00269900
270400         OPEN CHG-JRNL-CSR                                        00270000
270500     END-EXEC                                                     00270100
270600                                                                  00270200
270700     EVALUATE SQLCODE               ALSO SQLWARN0                 00270300
270800                                                                  00270400
270900         WHEN DB2-SUCCESSFUL-RETURN ALSO ANY                      00270500
271000             CONTINUE                                             00270600
271100                                                                  00270700
271200         WHEN DB2-DEADLOCK          ALSO ANY                      00270800
271300             PERFORM 6500A-DETECT-INTERNAL-RESTART                00270900
271400                                                                  00271000
271500         WHEN OTHER                                               00271100
271600             SET WS-ABEND-SQL-ERROR        TO TRUE                00271200
271700             MOVE LIT-PARAGRAPH-5100M      TO HE-PARAGRAPH        00271300
271800             MOVE DB2-OPEN-CURSOR-CALL     TO HE-SQL-FUNCTION     00271400
271900             MOVE SQLCODE                  TO HE-SQL-RETURN-CODE  00271500
272000             MOVE SQLWARN0                 TO HE-SQL-WARNING      00271600
272100             PERFORM 5400M-CALL-DSNTIAR                           00271700
272200             MOVE SQLERRMC                 TO HE-SQL-ERROR-MESSAGE00271800
272300             MOVE LIT-INVALID-OPEN-CALL    TO HE-MSG1             00271900
272400             MOVE LIT-MMP-CHG-JORNAL-TBL-N TO HE-DB2-TABLE1       00272000
272500             PERFORM 9990H-ABNORMAL-END-OF-JOB                    00272100
272600                                                                  00272200
272700     END-EVALUATE                                                 00272300
272800     .                                                            00272400
272900 5100M-EXIT.                                                      00272500
273000     EXIT.                                                        00272600
273100     EJECT                                                        00272700
273200*===============================================================* 00272800
273300*                    5150M-FETCH-CHG-JRNL-CURSOR                * 00272900
273400*---------------------------------------------------------------* 00273000
273500*    PERFORMED BY :  2100A-APPL-RESTART-INIT                    * 00273100
273600*                    5000A-GET-NEXT-DRIVING-RECORD              * 00273200
273700*===============================================================* 00273300
273800 5150M-FETCH-CHG-JRNL-CURSOR.                                     00273400
273900                                                                  00273500
274000     EXEC SQL                                                     00273600
274100         FETCH  CHG-JRNL-CSR                                      00273700
274200         INTO   :SMMPE29.PCER-PGM-ID-R,                           00273800
274300                :SMMPE29.PCER-TBL-N,                              00273900
274400                :SMMPE29.PCER-ATTR-N,                             00274000
274500                :SMMPE29.PCCJ-ROW-KEY-N,                          00274100
274600                :SMMPE29.PCER-ACTN-C,                             00274200
274700                :SMMPE29.PCCJ-OLD-ATTR-D,                         00274300
274800                :SMMPE29.PCCJ-NEW-ATTR-D,                         00274400
274900                :SMMPE29.PCCJ-UPDT-S,                             00274500
275000                :SMMPE29.PCCJ-UPDT-PGM-ID-R,                      00274600
275100                :SMMPE29.P-LAST-UPDATE-S,                         00274700
275200                :SMMPE29.P-LAST-UPDATE-C                          00274800
275300     END-EXEC                                                     00274900
275400                                                                  00275000
275500     EVALUATE SQLCODE               ALSO SQLWARN0                 00275100
275600                                                                  00275200
275700         WHEN DB2-SUCCESSFUL-RETURN ALSO ANY                      00275300
275800             SET DRIVING-RECORD-OBTAINED TO TRUE                  00275400
275900             ADD +1               TO WS-SMMPE29-SEL-CNT           00275500
276000                                                                  00275600
276100         WHEN DB2-NOT-FOUND         ALSO ANY                      00275700
276200             SET NO-MORE-REQUESTS-TO-PROCESS TO TRUE              00275800
276300             PERFORM 5190M-CLOSE-CHG-JRNL-CURSOR                  00275900
276400                                                                  00276000
276500         WHEN DB2-DEADLOCK          ALSO ANY                      00276100
276600             PERFORM 6500A-DETECT-INTERNAL-RESTART                00276200
276700                                                                  00276300
276800         WHEN OTHER                                               00276400
276900             SET WS-ABEND-SQL-ERROR        TO TRUE                00276500
277000             MOVE LIT-PARAGRAPH-5150M      TO HE-PARAGRAPH        00276600
277100             MOVE DB2-FETCH-CALL           TO HE-SQL-FUNCTION     00276700
277200             MOVE SQLCODE                  TO HE-SQL-RETURN-CODE  00276800
277300             MOVE SQLWARN0                 TO HE-SQL-WARNING      00276900
277400             PERFORM 5400M-CALL-DSNTIAR                           00277000
277500             MOVE SQLERRMC                 TO HE-SQL-ERROR-MESSAGE00277100
277600             MOVE LIT-INVALID-FETCH-CALL   TO HE-MSG1             00277200
277700             MOVE LIT-MMP-CHG-JORNAL-TBL-N TO HE-DB2-TABLE1       00277300
277800             PERFORM 9990H-ABNORMAL-END-OF-JOB                    00277400
277900                                                                  00277500
278000     END-EVALUATE                                                 00277600
278100     .                                                            00277700
278200 5150M-EXIT.                                                      00277800
278300     EXIT.                                                        00277900
278400     EJECT                                                        00278000
278500*===============================================================* 00278100
278600*                    5190M-CLOSE-CHG-JRNL-CURSOR                * 00278200
278700*---------------------------------------------------------------* 00278300
278800*    PERFORMED BY :  5150M-FETCH-CHG-JRNL-CURSOR                * 00278400
278900*===============================================================* 00278500
279000 5190M-CLOSE-CHG-JRNL-CURSOR.                                     00278600
279100                                                                  00278700
279200     EXEC SQL                                                     00278800
279300         CLOSE CHG-JRNL-CSR                                       00278900
279400     END-EXEC                                                     00279000
279500                                                                  00279100
279600     EVALUATE SQLCODE               ALSO SQLWARN0                 00279200
279700                                                                  00279300
279800         WHEN DB2-SUCCESSFUL-RETURN ALSO ANY                      00279400
279900             SET END-MAIN-CURSOR         TO TRUE                  00279500
280000                                                                  00279600
280100         WHEN DB2-DEADLOCK          ALSO ANY                      00279700
280200             PERFORM 6500A-DETECT-INTERNAL-RESTART                00279800
280300                                                                  00279900
280400         WHEN OTHER                                               00280000
280500             SET WS-ABEND-SQL-ERROR        TO TRUE                00280100
280600             MOVE LIT-PARAGRAPH-5190M      TO HE-PARAGRAPH        00280200
280700             MOVE DB2-CLOSE-CURSOR-CALL    TO HE-SQL-FUNCTION     00280300
280800             MOVE SQLCODE                  TO HE-SQL-RETURN-CODE  00280400
280900             MOVE SQLWARN0                 TO HE-SQL-WARNING      00280500
281000             PERFORM 5400M-CALL-DSNTIAR                           00280600
281100             MOVE SQLERRMC                 TO HE-SQL-ERROR-MESSAGE00280700
281200             MOVE LIT-INVALID-CLOSE-CALL   TO HE-MSG1             00280800
281300             MOVE LIT-MMP-CHG-JORNAL-TBL-N TO HE-DB2-TABLE1       00280900
281400             PERFORM 9990H-ABNORMAL-END-OF-JOB                    00281000
281500                                                                  00281100
281600     END-EVALUATE                                                 00281200
281700     .                                                            00281300
281800 5190M-EXIT.                                                      00281400
281900     EXIT.                                                        00281500
282000     EJECT                                                        00281600
282100 5200M-INSERT-SMMPD60.                                            00281700
282200                                                                  00281800
282300     EXEC SQL                                                     00281900
282400          INSERT INTO SMMPD60_TERTRY_FTR                          00282000
282500               (                                                  00282100
282600                VEHTYPE_CODE                                      00282200
282700               ,PTEIO_ORIGIN_C                                    00282300
282800               ,EVL_VEHICLE_LINE_C                                00282400
282900               ,MMPD59_MDLYR_Y                                    00282500
283000               ,MMPD60_TERR_C                                     00282600
283100               ,MMPD60_FTR_C                                      00282700
283200               ,MMPD60_PRIFTRSRC_C                                00282800
283300               ,MMPD60_FTR_VAL_C                                  00282900
283400               ,MMPD60_MNRFTR_C                                   00283000
283500               ,MMPD60_MNRFTRSRC_C                                00283100
283600               ,MMPD60_EFFPNTIN_Y                                 00283200
283700               ,MMPD60_XCLUD_LST_F                                00283300
283800               ,MMPD60_REMARK_DS_X                                00283400
283900               ,MMPD60_EFFPNTIN_C                                 00283500
284000               ,MMPD60_EFFPNTOUT_Y                                00283600
284100               ,MMPD60_EFFPNTOUT_C                                00283700
284200               ,MMPD60_REC_STAT_C                                 00283800
284300               ,MMPD60_LAST_UPD_S                                 00283900
284400               ,MMPD60_LAST_UPD_C                                 00284000
284500               )                                                  00284100
284600         VALUES                                                   00284200
284700               (                                                  00284300
284800                :SMMPD60.VEHTYPE-CODE                             00284400
284900               ,:SMMPD60.PTEIO-ORIGIN-C                           00284500
285000               ,:SMMPD60.EVL-VEHICLE-LINE-C                       00284600
285100               ,:SMMPD60.MMPD59-MDLYR-Y                           00284700
285200               ,:SMMPD60.MMPD60-TERR-C                            00284800
285300               ,:SMMPD60.MMPD60-FTR-C                             00284900
285400               ,:SMMPD60.MMPD60-PRIFTRSRC-C                       00285000
285500               ,:SMMPD60.MMPD60-FTR-VAL-C                         00285100
285600               ,:SMMPD60.MMPD60-MNRFTR-C                          00285200
285700               ,:SMMPD60.MMPD60-MNRFTRSRC-C                       00285300
285800               ,:SMMPD60.MMPD60-EFFPNTIN-Y                        00285400
285900               ,:SMMPD60.MMPD60-XCLUD-LST-F                       00285500
286000               ,:SMMPD60.MMPD60-REMARK-DS-X                       00285600
286100               ,:SMMPD60.MMPD60-EFFPNTIN-C                        00285700
286200               ,:SMMPD60.MMPD60-EFFPNTOUT-Y                       00285800
286300               ,:SMMPD60.MMPD60-EFFPNTOUT-C                       00285900
286400               ,:SMMPD60.MMPD60-REC-STAT-C                        00286000
286500               ,CURRENT TIMESTAMP                                 00286100
286600               ,:SMMPD60.MMPD60-LAST-UPD-C                        00286200
286700               )                                                  00286300
286800     END-EXEC                                                     00286400
286900                                                                  00286500
287000     EVALUATE SQLCODE                 ALSO SQLWARN0               00286600
287100         WHEN DB2-SUCCESSFUL-RETURN   ALSO SPACES                 00286700
287200              ADD 1 TO WS-SMMPD60-ISRT-CNT                        00286800
287300              INITIALIZE CHG-JOURNAL-PARMS                        00286900
287400              MOVE SPACES         TO CHG-JOURNAL-ROW-KEY          00287000
287500              MOVE VEHTYPE-CODE       OF SMMPD60                  00287100
287600                                      TO WS-VHTY-CODE             00287200
287700              MOVE PTEIO-ORIGIN-C     OF SMMPD60                  00287300
287800                                      TO WS-IO-ORIGIN-C           00287400
287900              MOVE EVL-VEHICLE-LINE-C OF SMMPD60                  00287500
288000                                      TO WS-VL-CODE               00287600
288100              MOVE MMPD59-MDLYR-Y     OF SMMPD60                  00287700
288200                                      TO WS-MDLYR                 00287800
288300              MOVE MMPD60-TERR-C      OF SMMPD60                  00287900
288400                                      TO WS-TERR-C                00288000
288500              MOVE MMPD60-FTR-C       OF SMMPD60                  00288100
288600                                      TO WS-FTR-C                 00288200
288700              MOVE MMPD60-PRIFTRSRC-C OF SMMPD60                  00288300
288800                                      TO WS-PRIFTRSRC-C           00288400
288900              MOVE MMPD60-FTR-VAL-C   OF SMMPD60                  00288500
289000                                      TO WS-FTR-VAL-C             00288600
289100              MOVE MMPD60-MNRFTR-C    OF SMMPD60                  00288700
289200                                      TO WS-MNRFTR-C              00288800
289300              MOVE MMPD60-MNRFTRSRC-C OF SMMPD60                  00288900
289400                                      TO WS-MNRFTRSRC-C           00289000
289500** START R1282190
289600*             MOVE MMPD60-EFFPNTIN-Y  OF SMMPD60                  00289100
289700*                                     TO WS-EFFPNTIN-Y            00289200
289800              MOVE MMPD60-EFFPNTIN-C  OF SMMPD60                  00289100
289900                                      TO WS-EFFPNTIN-C            00289200
290000** END   R1282190
290100              MOVE WS-D60-INDEX       TO CHG-JOURNAL-ROW-KEY      00289300
290200              MOVE LIT-A              TO CHG-JOURNAL-ACTION-CODE  00289400
290300              MOVE LIT-MMPD-TERTRY-FEATURE-N                      00289500
290400                                      TO CHG-JOURNAL-TABLE-NAME   00289600
290500              PERFORM 5210M-CHG-JOURNAL-INSERT                    00289700
290600                 THRU 5210M-CJ-EXIT                               00289800
290700         WHEN DB2-DUPLICATE-ROW   ALSO ANY                        00289900
290800              PERFORM 5300M-UPDATE-SMMPD60                        00290000
290900                 THRU 5300M-UPD-EXIT                              00290100
291000         WHEN OTHER                                               00290200
291100              SET WS-88-ERROR          TO TRUE                    00290300
291200              MOVE SQLCODE             TO HE-SQL-RETURN-CODE      00290400
291300              MOVE DB2-UPDATE-CALL     TO HE-SQL-FUNCTION         00290500
291400              MOVE LIT-PARAGRAPH-5200M TO HE-PARAGRAPH            00290600
291500              STRING VEHTYPE-CODE  OF SMMPD60 DELIMITED BY SIZE   00290700
291600                     "," DELIMITED BY SIZE                        00290800
291700               PTEIO-ORIGIN-C OF SMMPD60 DELIMITED BY SIZE        00290900
291800                     "," DELIMITED BY SIZE                        00291000
291900               EVL-VEHICLE-LINE-C OF SMMPD60 DELIMITED BY SIZE    00291100
292000                     "," DELIMITED BY SIZE                        00291200
292100               MMPD60-TERR-C  OF SMMPD60 DELIMITED BY SIZE        00291300
292200                     "," DELIMITED BY SIZE                        00291400
292300               MMPD60-FTR-C  OF SMMPD60 DELIMITED BY SIZE         00291500
292400                     "," DELIMITED BY SIZE                        00291600
292500               MMPD60-PRIFTRSRC-C  OF SMMPD60 DELIMITED BY SIZE   00291700
292600                     "," DELIMITED BY SIZE                        00291800
292700               MMPD60-FTR-VAL-C OF SMMPD60 DELIMITED BY SIZE      00291900
292800                     "," DELIMITED BY SIZE                        00292000
292900               MMPD60-MNRFTR-C OF SMMPD60 DELIMITED BY SIZE       00292100
293000               INTO               HE-MSG1                         00292200
293100              END-STRING                                          00292300
293200              PERFORM 5999M-SETUP-DB2-ABEND                       00292400
293300     END-EVALUATE                                                 00292500
293400     .                                                            00292600
293500                                                                  00292700
293600 5200M-INS-EXIT.                                                  00292800
293700     EXIT                                                         00292900
293800     .                                                            00293000
293900 5300M-UPDATE-SMMPD60.                                            00293100
294000                                                                  00293200
294100     EXEC SQL                                                     00293300
294200          UPDATE SMMPD60_TERTRY_FTR                               00293400
294300             SET MMPD60_REC_STAT_C  =:SMMPD60.MMPD60-REC-STAT-C   00293500
294400                ,MMPD60_LAST_UPD_S  = CURRENT TIMESTAMP           00293600
294500                ,MMPD60_LAST_UPD_C  =:SMMPD60.MMPD60-LAST-UPD-C   00293700
294600          WHERE VEHTYPE_CODE        =:SMMPD60.VEHTYPE-CODE        00293800
294700            AND PTEIO_ORIGIN_C      =:SMMPD60.PTEIO-ORIGIN-C      00293900
294800            AND EVL_VEHICLE_LINE_C  =:SMMPD60.EVL-VEHICLE-LINE-C  00294000
294900            AND MMPD59_MDLYR_Y      =:SMMPD60.MMPD59-MDLYR-Y      00294100
295000            AND MMPD60_TERR_C       =:SMMPD60.MMPD60-TERR-C       00294200
295100            AND MMPD60_FTR_C        =:SMMPD60.MMPD60-FTR-C        00294300
295200            AND MMPD60_PRIFTRSRC_C  =:SMMPD60.MMPD60-PRIFTRSRC-C  00294400
295300            AND MMPD60_FTR_VAL_C    =:SMMPD60.MMPD60-FTR-VAL-C    00294500
295400            AND MMPD60_MNRFTR_C     =:SMMPD60.MMPD60-MNRFTR-C     00294600
295500            AND MMPD60_MNRFTRSRC_C  =:SMMPD60.MMPD60-MNRFTRSRC-C  00294700
295600            AND MMPD60_EFFPNTIN_Y   =:SMMPD60.MMPD60-EFFPNTIN-Y   00294800
295700     END-EXEC                                                     00294900
295800                                                                  00295000
295900     EVALUATE SQLCODE                 ALSO SQLWARN0               00295100
296000         WHEN DB2-SUCCESSFUL-RETURN   ALSO SPACES                 00295200
296100              ADD +1 TO WS-SMMPD60-UPDT-CNT                       00295300
296200* USAGE BY PLANT PROJECT CHANGE STARTS                            00295400
296300           IF WS-TEMP-REC-STAT = MMPD60-REC-STAT-C  OF SMMPD60    00295500
296400              CONTINUE                                            00295600
296500           ELSE                                                   00295700
296600              INITIALIZE CHG-JOURNAL-PARMS                        00295800
296700              MOVE SPACES         TO CHG-JOURNAL-ROW-KEY          00295900
296800              MOVE VEHTYPE-CODE       OF SMMPD60                  00296000
296900                                      TO WS-VHTY-CODE             00296100
297000              MOVE PTEIO-ORIGIN-C     OF SMMPD60                  00296200
297100                                      TO WS-IO-ORIGIN-C           00296300
297200              MOVE EVL-VEHICLE-LINE-C OF SMMPD60                  00296400
297300                                      TO WS-VL-CODE               00296500
297400              MOVE MMPD59-MDLYR-Y     OF SMMPD60                  00296600
297500                                      TO WS-MDLYR                 00296700
297600              MOVE MMPD60-TERR-C      OF SMMPD60                  00296800
297700                                      TO WS-TERR-C                00296900
297800              MOVE MMPD60-FTR-C       OF SMMPD60                  00297000
297900                                      TO WS-FTR-C                 00297100
298000              MOVE MMPD60-PRIFTRSRC-C OF SMMPD60                  00297200
298100                                      TO WS-PRIFTRSRC-C           00297300
298200              MOVE MMPD60-FTR-VAL-C   OF SMMPD60                  00297400
298300                                      TO WS-FTR-VAL-C             00297500
298400              MOVE MMPD60-MNRFTR-C    OF SMMPD60                  00297600
298500                                      TO WS-MNRFTR-C              00297700
298600              MOVE MMPD60-MNRFTRSRC-C OF SMMPD60                  00297800
298700                                      TO WS-MNRFTRSRC-C           00297900
298800** START R1282190
298900*             MOVE MMPD60-EFFPNTIN-Y  OF SMMPD60                  00298000
299000*                                     TO WS-EFFPNTIN-Y            00298100
299100              MOVE MMPD60-EFFPNTIN-C  OF SMMPD60                  00298000
299200                                      TO WS-EFFPNTIN-C            00298100
299300** END   R1282190
299400              MOVE WS-D60-INDEX       TO CHG-JOURNAL-ROW-KEY      00298200
299500              MOVE LIT-C              TO CHG-JOURNAL-ACTION-CODE  00298300
299600              MOVE WS-TEMP-REC-STAT   TO CHG-JOURNAL-OLD-DATA-CHAR00298400
299700              MOVE MMPD60-REC-STAT-C  OF SMMPD60                  00298500
299800                                      TO CHG-JOURNAL-NEW-DATA-CHAR00298600
299900              MOVE LIT-MMPD60-REC-STAT-C-ATTR-N                   00298700
300000                                     TO CHG-JOURNAL-ATTRIBUTE-NAME00298800
300100              MOVE LIT-MMPD-TERTRY-FEATURE-N                      00298900
300200                                     TO CHG-JOURNAL-TABLE-NAME    00299000
300300              PERFORM 5210M-CHG-JOURNAL-INSERT                    00299100
300400                 THRU 5210M-CJ-EXIT                               00299200
300500           END-IF                                                 00299300
300600* USAGE BY PLANT PROJECT CHANGE ENDS                              00299400
300700         WHEN DB2-NOT-FOUND ALSO ANY                              00299500
300800              CONTINUE                                            00299600
300900         WHEN OTHER                                               00299700
301000              SET WS-88-ERROR          TO TRUE                    00299800
301100              MOVE LIT-PARAGRAPH-5300M TO HE-PARAGRAPH            00299900
301200              MOVE DB2-UPDATE-CALL     TO HE-SQL-FUNCTION         00300000
301300              STRING VEHTYPE-CODE  OF SMMPD60 DELIMITED BY SIZE   00300100
301400                     "," DELIMITED BY SIZE                        00300200
301500               PTEIO-ORIGIN-C OF SMMPD60 DELIMITED BY SIZE        00300300
301600                     "," DELIMITED BY SIZE                        00300400
301700               EVL-VEHICLE-LINE-C OF SMMPD60 DELIMITED BY SIZE    00300500
301800                     "," DELIMITED BY SIZE                        00300600
301900               MMPD60-TERR-C  OF SMMPD60 DELIMITED BY SIZE        00300700
302000                     "," DELIMITED BY SIZE                        00300800
302100               MMPD60-FTR-C  OF SMMPD60 DELIMITED BY SIZE         00300900
302200                     "," DELIMITED BY SIZE                        00301000
302300               MMPD60-PRIFTRSRC-C  OF SMMPD60 DELIMITED BY SIZE   00301100
302400                     "," DELIMITED BY SIZE                        00301200
302500               MMPD60-FTR-VAL-C OF SMMPD60 DELIMITED BY SIZE      00301300
302600                     "," DELIMITED BY SIZE                        00301400
302700               MMPD60-MNRFTR-C OF SMMPD60 DELIMITED BY SIZE       00301500
302800               INTO               HE-MSG1                         00301600
302900              END-STRING                                          00301700
303000              PERFORM 5999M-SETUP-DB2-ABEND                       00301800
303100     END-EVALUATE                                                 00301900
303200     .                                                            00302000
303300                                                                  00302100
303400 5300M-UPD-EXIT.                                                  00302200
303500     EXIT                                                         00302300
303600     .                                                            00302400
303700 5210M-CHG-JOURNAL-INSERT.                                        00302500
303800                                                                  00302600
303900     MOVE WS-ISO-DATE-TIME-STAMP TO CHG-JOURNAL-UPDATE-TIMESTAMP  00302700
304000     MOVE PROGRAM-NAME           TO CHG-JOURNAL-UPDATE-PROGRAM-ID 00302800
304100                                                                  00302900
304200     CALL "PA0046JC" USING WS-SQLCA                               00303000
304300                           LINKAGE-PARAMETERS                     00303100
304400                           CHG-JOURNAL-PARMS                      00303200
304500                           ALT3-PCB                               00303300
304600                                                                  00303400
304700     IF  NORMAL-COMPLETION                                        00303500
304800         CONTINUE                                                 00303600
304900     ELSE                                                         00303700
305000         IF  WS-SQLCODE = DB2-DEADLOCK                            00303800
305100             MOVE WS-SQLCA   TO SQLCA                             00303900
305200             PERFORM 6500A-DETECT-INTERNAL-RESTART                00304000
305300         ELSE                                                     00304100
305400             MOVE WS-SQLCA             TO SQLCA                   00304200
305500             MOVE LIT-PARAGRAPH-5210M  TO HE-PARAGRAPH            00304300
305600             MOVE LS-COMMENT-TEXT-2    TO HE-MSG1                 00304400
305700             MOVE LS-ERR-TABLE-NAME    TO HE-DB2-TABLE1           00304500
305800             MOVE LS-ERR-CURSOR-NAME   TO HE-HOST-VAR1            00304600
305900             STRING                                               00304700
306000                  LS-PROGRAM-NAME      ","                        00304800
306100                  LS-PARAGRAPH-NUMBER  ","                        00304900
306200                  LS-COMMENT-TEXT      ","                        00305000
306300                  DELIMITED BY SIZE INTO  HE-MSG2                 00305100
306400             END-STRING                                           00305200
306500             PERFORM 5999M-SETUP-DB2-ABEND                        00305300
306600         END-IF                                                   00305400
306700     END-IF                                                       00305500
306800     .                                                            00305600
306900 5210M-CJ-EXIT.                                                   00305700
307000     EXIT                                                         00305800
307100     .                                                            00305900
307200*===============================================================* 00306000
307300*                    5310M-OPEN-GSAM-AUDIT-FILE                 * 00306100
307400*---------------------------------------------------------------* 00306200
307500*    PERFORMED BY :  1200A-APPL-SPECIFIC-INIT                   * 00306300
307600*===============================================================* 00306400
307700 5310M-OPEN-GSAM-AUDIT-FILE.                                      00306500
307800                                                                  00306600
307900     CALL "CBLTDLI"  USING GSAM-OPEN,                             00306700
308000                           GS-OUT-PCB1                            00306800
308100                                                                  00306900
308200     IF  GS-OUT-PCB1-STATUS = BB                                  00307000
308300         CONTINUE                                                 00307100
308400     ELSE                                                         00307200
308500         SET WS-ABEND-IMS-ERROR        TO TRUE                    00307300
308600         MOVE LIT-PARAGRAPH-5310M      TO HE-PARAGRAPH            00307400
308700         MOVE GSAM-OPEN                TO HE-CALL                 00307500
308800         MOVE GS-OUT-PCB1-STATUS       TO HE-STATUS               00307600
308900         MOVE GS-OUT-PCB1-KEY-FB       TO HE-FEEDBACK             00307700
309000         MOVE LIT-INVALID-OPEN-CALL    TO HE-MSG1                 00307800
309100         PERFORM 9990H-ABNORMAL-END-OF-JOB                        00307900
309200     END-IF                                                       00308000
309300     .                                                            00308100
309400 5310M-EXIT.                                                      00308200
309500     EXIT.                                                        00308300
309600     EJECT                                                        00308400
309700 5320M-OPEN-GSAM-D81BKUP-FILE.                                    00308500
309800                                                                  00308600
309900     CALL "CBLTDLI"  USING GSAM-OPEN,                             00308700
310000                           GS-OUT-PCB2                            00308800
310100                                                                  00308900
310200     IF  GS-OUT-PCB1-STATUS = BB                                  00309000
310300         CONTINUE                                                 00309100
310400     ELSE                                                         00309200
310500         SET WS-ABEND-IMS-ERROR        TO TRUE                    00309300
310600         MOVE LIT-PARAGRAPH-5320M      TO HE-PARAGRAPH            00309400
310700         MOVE GSAM-OPEN                TO HE-CALL                 00309500
310800         MOVE GS-OUT-PCB2-STATUS       TO HE-STATUS               00309600
310900         MOVE GS-OUT-PCB2-KEY-FB       TO HE-FEEDBACK             00309700
311000         MOVE LIT-INVALID-OPEN-CALL    TO HE-MSG1                 00309800
311100         PERFORM 9990H-ABNORMAL-END-OF-JOB                        00309900
311200     END-IF                                                       00310000
311300     .                                                            00310100
311400 5320M-EXIT.                                                      00310200
311500     EXIT.                                                        00310300
311600*===============================================================* 00310400
311700*                    5340M-INSERT-AUDIT-TOTALS                  * 00310500
311800*---------------------------------------------------------------* 00310600
311900*    PERFORMED BY :  3400A-END-PROCESS                          * 00310700
312000*===============================================================* 00310800
312100 5340M-INSERT-AUDIT-TOTALS.                                       00310900
312200                                                                  00311000
312300     CALL "CBLTDLI"  USING ISRT,                                  00311100
312400                           GS-OUT-PCB1,                           00311200
312500                           WS-AUDIT-RECORD-TOTAL                  00311300
312600                                                                  00311400
312700     IF  GS-OUT-PCB1-STATUS = BB                                  00311500
312800         INITIALIZE WS-AUDIT-RECORD-TOTAL                         00311600
312900     ELSE                                                         00311700
313000         SET WS-ABEND-IMS-ERROR        TO TRUE                    00311800
313100         MOVE LIT-PARAGRAPH-5340M      TO HE-PARAGRAPH            00311900
313200         MOVE ISRT                     TO HE-CALL                 00312000
313300         MOVE GS-OUT-PCB1-STATUS       TO HE-STATUS               00312100
313400         MOVE GS-OUT-PCB1-KEY-FB       TO HE-FEEDBACK             00312200
313500         MOVE LIT-BAD-ISRT-STATUS      TO HE-MSG1                 00312300
313600         PERFORM 9990H-ABNORMAL-END-OF-JOB                        00312400
313700     END-IF                                                       00312500
313800     .                                                            00312600
313900 5340M-EXIT.                                                      00312700
314000     EXIT.                                                        00312800
314100     EJECT                                                        00312900
314200 5350M-INSERT-D81BKUP-TOTALS.                                     00313000
314300                                                                  00313100
314400     CALL "CBLTDLI"  USING ISRT,                                  00313200
314500                           GS-OUT-PCB2,                           00313300
314600                           SMMPD81                                00313400
314700                                                                  00313500
314800     IF  GS-OUT-PCB1-STATUS = BB                                  00313600
314900         INITIALIZE SMMPD81                                       00313700
315000     ELSE                                                         00313800
315100         SET WS-ABEND-IMS-ERROR        TO TRUE                    00313900
315200         MOVE LIT-PARAGRAPH-5350M      TO HE-PARAGRAPH            00314000
315300         MOVE ISRT                     TO HE-CALL                 00314100
315400         MOVE GS-OUT-PCB2-STATUS       TO HE-STATUS               00314200
315500         MOVE GS-OUT-PCB2-KEY-FB       TO HE-FEEDBACK             00314300
315600         MOVE LIT-BAD-ISRT-STATUS      TO HE-MSG1                 00314400
315700         PERFORM 9990H-ABNORMAL-END-OF-JOB                        00314500
315800     END-IF                                                       00314600
315900     .                                                            00314700
316000 5350M-EXIT.                                                      00314800
316100     EXIT.                                                        00314900
316200     EJECT                                                        00315000
316300*===============================================================* 00315100
316400*                    5380M-CLOSE-GSAM-AUDIT-FILE                * 00315200
316500*---------------------------------------------------------------* 00315300
316600*    PERFORMED BY :  3800A-APPL-END-OF-JOB                      * 00315400
316700*===============================================================* 00315500
316800 5380M-CLOSE-GSAM-AUDIT-FILE.                                     00315600
316900                                                                  00315700
317000     CALL "CBLTDLI"  USING GSAM-CLSE,                             00315800
317100                           GS-OUT-PCB1                            00315900
317200                                                                  00316000
317300     IF  GS-OUT-PCB1-STATUS = BB                                  00316100
317400         CONTINUE                                                 00316200
317500     ELSE                                                         00316300
317600         SET WS-ABEND-IMS-ERROR        TO TRUE                    00316400
317700         MOVE LIT-PARAGRAPH-5380M      TO HE-PARAGRAPH            00316500
317800         MOVE GSAM-CLSE                TO HE-CALL                 00316600
317900         MOVE GS-OUT-PCB1-STATUS       TO HE-STATUS               00316700
318000         MOVE GS-OUT-PCB1-KEY-FB       TO HE-FEEDBACK             00316800
318100         MOVE LIT-INVALID-CLOSE-CALL   TO HE-MSG1                 00316900
318200         PERFORM 9990H-ABNORMAL-END-OF-JOB                        00317000
318300     END-IF                                                       00317100
318400     .                                                            00317200
318500 5380M-EXIT.                                                      00317300
318600     EXIT.                                                        00317400
318700     EJECT                                                        00317500
318800 5390M-CLOSE-GSAM-D81BKUP-FILE.                                   00317600
318900                                                                  00317700
319000     CALL "CBLTDLI"  USING GSAM-CLSE,                             00317800
319100                           GS-OUT-PCB2                            00317900
319200                                                                  00318000
319300     IF  GS-OUT-PCB2-STATUS = BB                                  00318100
319400         CONTINUE                                                 00318200
319500     ELSE                                                         00318300
319600         SET WS-ABEND-IMS-ERROR        TO TRUE                    00318400
319700         MOVE LIT-PARAGRAPH-5390M      TO HE-PARAGRAPH            00318500
319800         MOVE GSAM-CLSE                TO HE-CALL                 00318600
319900         MOVE GS-OUT-PCB2-STATUS       TO HE-STATUS               00318700
320000         MOVE GS-OUT-PCB2-KEY-FB       TO HE-FEEDBACK             00318800
320100         MOVE LIT-INVALID-CLOSE-CALL   TO HE-MSG1                 00318900
320200         PERFORM 9990H-ABNORMAL-END-OF-JOB                        00319000
320300     END-IF                                                       00319100
320400     .                                                            00319200
320500 5390M-EXIT.                                                      00319300
320600     EXIT.                                                        00319400
320700     EJECT                                                        00319500
320800*===============================================================* 00319600
320900*                    5400M-CALL-DSNTIAR                         * 00319700
321000*---------------------------------------------------------------* 00319800
321100*    PERFORMED BY :  3900M-  4000M-  5050M-  5070M-  5090M-     * 00319900
321200*===============================================================* 00320000
321300 5400M-CALL-DSNTIAR.                                              00320100
321400                                                                  00320200
321500     CALL "DSNTIAR" USING    SQLCA                                00320300
321600                             SQLERR-MESSAGE-AREA                  00320400
321700                             SQLERR-TEXT-LENGTH                   00320500
321800                                                                  00320600
321900     MOVE SQLERR-LINE-1      TO HE-SQL-MSG1                       00320700
322000     MOVE SQLERR-LINE-2      TO HE-SQL-MSG2                       00320800
322100     MOVE SQLERR-LINE-3      TO HE-SQL-MSG3                       00320900
322200     MOVE SQLERR-LINE-4      TO HE-SQL-MSG4                       00321000
322300     .                                                            00321100
322400 5400M-EXIT.                                                      00321200
322500     EXIT.                                                        00321300
322600 EJECT                                                            00321400
322700*5520M-INSERT-NGTVTC.                                             00321500
322800*      MOVE 'X'                         TO WS-NGTV-TRTRY(1:1)     00321600
322900*      MOVE MMPD60-TERR-C(2:4)          TO WS-NGTV-TRTRY(2:4)     00321700
323000*      MOVE PROGRAM-NAME    TO MMPD60-LAST-UPD-C                  00321800
323100*                              OF SMMPD60                         00321900
323200*                                                                 00322000
323300*    EXEC SQL                                                     00322100
323400*         INSERT INTO SMMPD60_TERTRY_FTR                          00322200
323500*              (                                                  00322300
323600*               VEHTYPE_CODE                                      00322400
323700*              ,PTEIO_ORIGIN_C                                    00322500
323800*              ,EVL_VEHICLE_LINE_C                                00322600
323900*              ,MMPD59_MDLYR_Y                                    00322700
324000*              ,MMPD60_TERR_C                                     00322800
324100*              ,MMPD60_FTR_C                                      00322900
324200*              ,MMPD60_PRIFTRSRC_C                                00323000
324300*              ,MMPD60_FTR_VAL_C                                  00323100
324400*              ,MMPD60_MNRFTR_C                                   00323200
324500*              ,MMPD60_MNRFTRSRC_C                                00323300
324600*              ,MMPD60_EFFPNTIN_Y                                 00323400
324700*              ,MMPD60_XCLUD_LST_F                                00323500
324800*              ,MMPD60_REMARK_DS_X                                00323600
324900*              ,MMPD60_EFFPNTIN_C                                 00323700
325000*              ,MMPD60_EFFPNTOUT_Y                                00323800
325100*              ,MMPD60_EFFPNTOUT_C                                00323900
325200*              ,MMPD60_REC_STAT_C                                 00324000
325300*              ,MMPD60_LAST_UPD_S                                 00324100
325400*              ,MMPD60_LAST_UPD_C                                 00324200
325500*              )                                                  00324300
325600*        VALUES                                                   00324400
325700*              (                                                  00324500
325800*               :SMMPD60.VEHTYPE-CODE                             00324600
325900*              ,:SMMPD60.PTEIO-ORIGIN-C                           00324700
326000*              ,:SMMPD60.EVL-VEHICLE-LINE-C                       00324800
326100*              ,:SMMPD60.MMPD59-MDLYR-Y                           00324900
326200*              ,:SMMPD60.MMPD60-TERR-C                            00325000
326300*              ,:WS-PRM-FEATR-CD                                  00325100
326400*              ,:WS-PRM-SRC-CD                                    00325200
326500*              ,:WS-PRM-VAL-CD                                    00325300
326600*              ,:WS-NGTV-TRTRY                                    00325400
326700*              ,:WS-MNR-SRC-CD                                    00325500
326800*              ,CURRENT DATE                                      00325600
326900*              ,:LIT-Y                                            00325700
327000*              ,:SMMPD60.MMPD60-REMARK-DS-X                       00325800
327100*              ,:WS-EFF-C                                         00325900
327200*              ,:LIT-HIGHDATE                                     00326000
327300*              ,:WS-EFF-C                                         00326100
327400*              ,:LIT-A                                            00326200
327500*              ,CURRENT TIMESTAMP                                 00326300
327600*              ,:SMMPD60.MMPD60-LAST-UPD-C                        00326400
327700*              )                                                  00326500
327800*    END-EXEC                                                     00326600
327900*                                                                 00326700
328000*    EVALUATE SQLCODE                 ALSO SQLWARN0               00326800
328100*        WHEN DB2-SUCCESSFUL-RETURN   ALSO SPACES                 00326900
328200*             ADD 1 TO WS-SMMPD60-ISRT-CNT                        00327000
328300*             INITIALIZE CHG-JOURNAL-PARMS                        00327100
328400*             MOVE SPACES         TO CHG-JOURNAL-ROW-KEY          00327200
328500*             MOVE VEHTYPE-CODE       OF SMMPD60                  00327300
328600*                                     TO WS-VHTY-CODE             00327400
328700*             MOVE PTEIO-ORIGIN-C     OF SMMPD60                  00327500
328800*                                     TO WS-IO-ORIGIN-C           00327600
328900*             MOVE EVL-VEHICLE-LINE-C OF SMMPD60                  00327700
329000*                                     TO WS-VL-CODE               00327800
329100*             MOVE MMPD59-MDLYR-Y     OF SMMPD60                  00327900
329200*                                     TO WS-MDLYR                 00328000
329300*             MOVE MMPD60-TERR-C      OF SMMPD60                  00328100
329400*                                     TO WS-TERR-C                00328200
329500*             MOVE MMPD60-FTR-C       OF SMMPD60                  00328300
329600*                                     TO WS-FTR-C                 00328400
329700*             MOVE MMPD60-PRIFTRSRC-C OF SMMPD60                  00328500
329800*                                     TO WS-PRIFTRSRC-C           00328600
329900*             MOVE MMPD60-FTR-VAL-C   OF SMMPD60                  00328700
330000*                                     TO WS-FTR-VAL-C             00328800
330100*             MOVE MMPD60-MNRFTR-C    OF SMMPD60                  00328900
330200*                                     TO WS-MNRFTR-C              00329000
330300*             MOVE MMPD60-MNRFTRSRC-C OF SMMPD60                  00329100
330400*                                     TO WS-MNRFTRSRC-C           00329200
330500*             MOVE MMPD60-EFFPNTIN-Y  OF SMMPD60                  00329300
330600*                                     TO WS-EFFPNTIN-Y            00329400
330700*             MOVE WS-D60-INDEX       TO CHG-JOURNAL-ROW-KEY      00329500
330800*             MOVE LIT-A              TO CHG-JOURNAL-ACTION-CODE  00329600
330900*             MOVE LIT-MMPD-TERTRY-FEATURE-N                      00329700
331000*                                     TO CHG-JOURNAL-TABLE-NAME   00329800
331100*             PERFORM 5210M-CHG-JOURNAL-INSERT                    00329900
331200*                THRU 5210M-CJ-EXIT                               00330000
331300*        WHEN DB2-DUPLICATE-ROW   ALSO ANY                        00330100
331400*             CONTINUE                                            00330200
331500*        WHEN DB2-FOREIGN-KEY-VIOLATE ALSO ANY                    00330300
331600*             CONTINUE                                            00330400
331700*        WHEN OTHER                                               00330500
331800*             SET WS-88-ERROR         TO TRUE                     00330600
331900*             MOVE SQLCODE            TO HE-SQL-RETURN-CODE       00330700
332000*             MOVE DB2-UPDATE-CALL     TO HE-SQL-FUNCTION         00330800
332100*             MOVE LIT-PARAGRAPH-5520M TO HE-PARAGRAPH            00330900
332200*             STRING VEHTYPE-CODE  OF SMMPD60 DELIMITED BY SIZE   00331000
332300*                    "," DELIMITED BY SIZE                        00331100
332400*              PTEIO-ORIGIN-C OF SMMPD60 DELIMITED BY SIZE        00331200
332500*                    "," DELIMITED BY SIZE                        00331300
332600*              EVL-VEHICLE-LINE-C OF SMMPD60 DELIMITED BY SIZE    00331400
332700*                    "," DELIMITED BY SIZE                        00331500
332800*              MMPD60-TERR-C  OF SMMPD60 DELIMITED BY SIZE        00331600
332900*                    "," DELIMITED BY SIZE                        00331700
333000*              MMPD60-FTR-C  OF SMMPD60 DELIMITED BY SIZE         00331800
333100*                    "," DELIMITED BY SIZE                        00331900
333200*              MMPD60-PRIFTRSRC-C  OF SMMPD60 DELIMITED BY SIZE   00332000
333300*                    "," DELIMITED BY SIZE                        00332100
333400*              MMPD60-FTR-VAL-C OF SMMPD60 DELIMITED BY SIZE      00332200
333500*                    "," DELIMITED BY SIZE                        00332300
333600*              MMPD60-MNRFTR-C OF SMMPD60 DELIMITED BY SIZE       00332400
333700*              INTO               HE-MSG1                         00332500
333800*             END-STRING                                          00332600
333900*             PERFORM 5999M-SETUP-DB2-ABEND                       00332700
334000*    END-EVALUATE                                                 00332800
334100*    .                                                            00332900
334200*                                                                 00333000
334300*5520M-EXIT.                                                      00333100
334400*    EXIT                                                         00333200
334500*    .                                                            00333300
334600*5600M-DEL-D81.                                                   00333400
334700*         SET NOT-END-OF-D81-CSR    TO TRUE                       00333500
334800*         PERFORM 5610M-OPEN-D81-CURSOR                           00333600
334900*            THRU 5610M-EXIT                                      00333700
335000*         IF INTERNAL-RESTART                                     00333800
335100*            CONTINUE                                             00333900
335200*         ELSE                                                    00334000
335300*            PERFORM 5620M-FETCH-D81-CURSOR                       00334100
335400*              UNTIL END-OF-D81-CSR OR INTERNAL-RESTART           00334200
335500*         END-IF                                                  00334300
335600*                                                                 00334400
335700*         IF INTERNAL-RESTART                                     00334500
335800*            CONTINUE                                             00334600
335900*         ELSE                                                    00334700
336000*            PERFORM 5640M-CLOSE-D81-CURSOR                       00334800
336100*               THRU 5640M-EXIT                                   00334900
336200*         END-IF                                                  00335000
336300*    .                                                            00335100
336400*                                                                 00335200
336500*5600M-EXIT.                                                      00335300
336600*    EXIT                                                         00335400
336700*    .                                                            00335500
336800*5610M-OPEN-D81-CURSOR.                                           00335600
336900*    EXEC SQL                                                     00335700
337000*        OPEN D81-DEL-CSR                                         00335800
337100*    END-EXEC                                                     00335900
337200*                                                                 00336000
337300*    EVALUATE SQLCODE                      ALSO SQLWARN0          00336100
337400*        WHEN DB2-SUCCESSFUL-RETURN        ALSO SPACES            00336200
337500*             CONTINUE                                            00336300
337600*                                                                 00336400
337700*        WHEN DB2-DEADLOCK                 ALSO ANY               00336500
337800*             PERFORM 6500A-DETECT-INTERNAL-RESTART               00336600
337900*                                                                 00336700
338000*        WHEN OTHER                                               00336800
338100*             MOVE LIT-PARAGRAPH-5610M        TO HE-PARAGRAPH     00336900
338200*             MOVE DB2-OPEN-CURSOR-CALL       TO HE-SQL-FUNCTION  00337000
338300*             MOVE LIT-MMPD-MKT-INTNT-TBL-N   TO HE-DB2-TABLE1    00337100
338400*             MOVE WS-MDLYR                   TO WS-NUM-MDLYR     00337200
338500*             STRING                                              00337300
338600*                 WS-D68-VEHTYPE              ","                 00337400
338700*                 WS-D68-VEHICLE-LINE         ","                 00337500
338800*                 WS-D68-PTEIO-ORIGIN         ","                 00337600
338900*                 WS-NUM-MDLYR                ","                 00337700
339000*                 WS-D68-REGINT-C                                 00337800
339100*                 DELIMITED BY SIZE INTO HE-MSG1                  00337900
339200*             END-STRING                                          00338000
339300*             PERFORM 5999M-SETUP-DB2-ABEND                       00338100
339400*    END-EVALUATE                                                 00338200
339500*    .                                                            00338300
339600*                                                                 00338400
339700*5610M-EXIT.                                                      00338500
339800*    EXIT                                                         00338600
339900*    .                                                            00338700
340000*5620M-FETCH-D81-CURSOR.                                          00338800
340100*    EXEC SQL                                                     00338900
340200*        FETCH  D81-DEL-CSR                                       00339000
340300*        INTO   :SMMPD81.ENGP-ENGNRG-PART-R                       00339100
340400*              ,:SMMPD81.EIO-ORIGIN-C                             00339200
340500*              ,:SMMPD81.ENGP-SEQ-R                               00339300
340600*              ,:SMMPD81.MKINT-CNTRY-FTR-C                        00339400
340700*              ,:SMMPD81.VEHTYPE-CODE                             00339500
340800*              ,:SMMPD81.PTEIO-ORIGIN-C                           00339600
340900*              ,:SMMPD81.EVL-VEHICLE-LINE-C                       00339700
341000*              ,:SMMPD81.MKINT-MD-SE-FTR-C                        00339800
341100*              ,:SMMPD81.VAMY-MDLYR-R                             00339900
341200*              ,:SMMPD81.P-LAST-UPDATE-S                          00340000
341300*              ,:SMMPD81.P-LAST-UPDATE-C                          00340100
341400*    END-EXEC                                                     00340200
341500*                                                                 00340300
341600*    EVALUATE SQLCODE               ALSO SQLWARN0                 00340400
341700*                                                                 00340500
341800*        WHEN DB2-SUCCESSFUL-RETURN ALSO ANY                      00340600
341900*            ADD +1               TO WS-SMMPD81-SEL-CNT           00340700
342000*                                                                 00340800
342100*            INITIALIZE CHG-JOURNAL-PARMS                         00340900
342200*            MOVE SPACES        TO CHG-JOURNAL-ROW-KEY            00341000
342300*            MOVE ENGP-ENGNRG-PART-R OF SMMPD81                   00341100
342400*                               TO CHG-JOURNAL-ROW-KEY   (1:30)   00341200
342500*            MOVE EIO-ORIGIN-C       OF SMMPD81                   00341300
342600*                               TO CHG-JOURNAL-ROW-KEY   (31:4)   00341400
342700*            MOVE ENGP-SEQ-R         OF SMMPD81                   00341500
342800*                               TO CHG-JOURNAL-ROW-KEY   (35:2)   00341600
342900*            MOVE MKINT-CNTRY-FTR-C  OF SMMPD81                   00341700
343000*                               TO CHG-JOURNAL-ROW-KEY   (37:5)   00341800
343100*                                                                 00341900
343200*            PERFORM 5630M-DELETE-D81REC                          00342000
343300*               THRU 5630M-EXIT                                   00342100
343400*                                                                 00342200
343500*            PERFORM 5350M-INSERT-D81BKUP-TOTALS                  00342300
343600*               THRU 5350M-EXIT                                   00342400
343700*                                                                 00342500
343800*            MOVE LIT-D         TO CHG-JOURNAL-ACTION-CODE        00342600
343900*            MOVE LIT-MMPD-MKT-INTNT-TBL-N                        00342700
344000*                                TO CHG-JOURNAL-TABLE-NAME        00342800
344100*            PERFORM 5210M-CHG-JOURNAL-INSERT                     00342900
344200*               THRU 5210M-CJ-EXIT                                00343000
344300*        WHEN DB2-NOT-FOUND         ALSO ANY                      00343100
344400*            SET END-OF-D81-CSR   TO TRUE                         00343200
344500*                                                                 00343300
344600*        WHEN DB2-DEADLOCK          ALSO ANY                      00343400
344700*            PERFORM 6500A-DETECT-INTERNAL-RESTART                00343500
344800*                                                                 00343600
344900*        WHEN OTHER                                               00343700
345000*            SET WS-ABEND-SQL-ERROR        TO TRUE                00343800
345100*            MOVE LIT-PARAGRAPH-5620M      TO HE-PARAGRAPH        00343900
345200*            MOVE DB2-FETCH-CALL           TO HE-SQL-FUNCTION     00344000
345300*            MOVE SQLCODE                  TO HE-SQL-RETURN-CODE  00344100
345400*            MOVE SQLWARN0                 TO HE-SQL-WARNING      00344200
345500*            PERFORM 5400M-CALL-DSNTIAR                           00344300
345600*            MOVE SQLERRMC                 TO HE-SQL-ERROR-MESSAGE00344400
345700*            MOVE LIT-INVALID-FETCH-CALL   TO HE-MSG1             00344500
345800*            MOVE LIT-MMPD-MKT-INTNT-TBL-N TO HE-DB2-TABLE1       00344600
345900*            MOVE WS-MDLYR                 TO WS-NUM-MDLYR        00344700
346000*            STRING                                               00344800
346100*                WS-D68-VEHTYPE              ","                  00344900
346200*                WS-D68-VEHICLE-LINE         ","                  00345000
346300*                WS-D68-PTEIO-ORIGIN         ","                  00345100
346400*                WS-NUM-MDLYR                ","                  00345200
346500*                WS-D68-REGINT-C                                  00345300
346600*                DELIMITED BY SIZE INTO HE-MSG1                   00345400
346700*            END-STRING                                           00345500
346800*            PERFORM 9990H-ABNORMAL-END-OF-JOB                    00345600
346900*                                                                 00345700
347000*    END-EVALUATE                                                 00345800
347100*    .                                                            00345900
347200*                                                                 00346000
347300*5620M-EXIT.                                                      00346100
347400*    EXIT                                                         00346200
347500*    .                                                            00346300
347600*5630M-DELETE-D81REC.                                             00346400
347700*                                                                 00346500
347800*    EXEC SQL                                                     00346600
347900*         DELETE                                                  00346700
348000*         FROM  SMMPD81_MKT_INTNT                                 00346800
348100*         WHERE  ENGP_ENGNRG_PART_R  = :SMMPD81.ENGP-ENGNRG-PART-R00346900
348200*           AND  EIO_ORIGIN_C        = :SMMPD81.EIO-ORIGIN-C      00347000
348300*           AND  ENGP_SEQ_R          = :SMMPD81.ENGP-SEQ-R        00347100
348400*           AND  MKINT_CNTRY_FTR_C   = :SMMPD81.MKINT-CNTRY-FTR-C 00347200
348500*           AND  VEHTYPE_CODE        = :SMMPD81.VEHTYPE-CODE      00347300
348600*           AND  PTEIO_ORIGIN_C      = :SMMPD81.PTEIO-ORIGIN-C    00347400
348700*           AND  EVL_VEHICLE_LINE_C  = :SMMPD81.EVL-VEHICLE-LINE-C00347500
348800*           AND  MKINT_MD_SE_FTR_C   = :SMMPD81.MKINT-MD-SE-FTR-C 00347600
348900*           AND  VAMY_MDLYR_R        = :SMMPD81.VAMY-MDLYR-R      00347700
349000*    END-EXEC                                                     00347800
349100*                                                                 00347900
349200*    EVALUATE SQLCODE                  ALSO SQLWARN0              00348000
349300*                                                                 00348100
349400*        WHEN DB2-SUCCESSFUL-RETURN    ALSO ANY                   00348200
349500*            ADD SQLERRD (3)        TO WS-SMMPD81-DEL-CNT         00348300
349600*                                                                 00348400
349700*        WHEN DB2-NOT-FOUND            ALSO ANY                   00348500
349800*             CONTINUE                                            00348600
349900*                                                                 00348700
350000*        WHEN DB2-DEADLOCK             ALSO ANY                   00348800
350100*            PERFORM 6500A-DETECT-INTERNAL-RESTART                00348900
350200*                                                                 00349000
350300*        WHEN OTHER                                               00349100
350400*            SET WS-ABEND-SQL-ERROR        TO TRUE                00349200
350500*            MOVE LIT-PARAGRAPH-5630M      TO HE-PARAGRAPH        00349300
350600*            MOVE DB2-DELETE-CALL          TO HE-SQL-FUNCTION     00349400
350700*            MOVE SQLCODE                  TO HE-SQL-RETURN-CODE  00349500
350800*            MOVE SQLWARN0                 TO HE-SQL-WARNING      00349600
350900*            PERFORM 5400M-CALL-DSNTIAR                           00349700
351000*            MOVE SQLERRMC                 TO HE-SQL-ERROR-MESSAGE00349800
351100*            STRING                                               00349900
351200*                ENGP-ENGNRG-PART-R OF SMMPD81    ","             00350000
351300*                EIO-ORIGIN-C       OF SMMPD81    ","             00350100
351400*                MKINT-CNTRY-FTR-C  OF SMMPD81                    00350200
351500*                DELIMITED BY SIZE       INTO HE-MSG1             00350300
351600*            END-STRING                                           00350400
351700*            MOVE LIT-MMPD-MKT-INTNT-TBL-N TO HE-DB2-TABLE1       00350500
351800*            PERFORM 9990H-ABNORMAL-END-OF-JOB                    00350600
351900*                                                                 00350700
352000*    END-EVALUATE                                                 00350800
352100*    .                                                            00350900
352200*5630M-EXIT.                                                      00351000
352300*    EXIT                                                         00351100
352400*    .                                                            00351200
352500*5640M-CLOSE-D81-CURSOR.                                          00351300
352600*     EXEC SQL                                                    00351400
352700*         CLOSE D81-DEL-CSR                                       00351500
352800*     END-EXEC                                                    00351600
352900*                                                                 00351700
353000*     EVALUATE SQLCODE                     ALSO SQLWARN0          00351800
353100*         WHEN DB2-SUCCESSFUL-RETURN       ALSO SPACES            00351900
353200*              CONTINUE                                           00352000
353300*                                                                 00352100
353400*         WHEN DB2-DEADLOCK                ALSO ANY               00352200
353500*              PERFORM 6500A-DETECT-INTERNAL-RESTART              00352300
353600*        WHEN OTHER                                               00352400
353700*             MOVE LIT-PARAGRAPH-5640M        TO HE-PARAGRAPH     00352500
353800*             MOVE DB2-CLOSE-CURSOR-CALL      TO HE-SQL-FUNCTION  00352600
353900*             MOVE LIT-MMPD-MKT-INTNT-TBL-N   TO HE-DB2-TABLE1    00352700
354000*             MOVE WS-MDLYR                 TO WS-NUM-MDLYR       00352800
354100*             STRING                                              00352900
354200*                 WS-D68-VEHTYPE              ","                 00353000
354300*                 WS-D68-VEHICLE-LINE         ","                 00353100
354400*                 WS-D68-PTEIO-ORIGIN         ","                 00353200
354500*                 WS-NUM-MDLYR                ","                 00353300
354600*                 WS-D68-REGINT-C                                 00353400
354700*                 DELIMITED BY SIZE INTO HE-MSG1                  00353500
354800*             END-STRING                                          00353600
354900*             PERFORM 5999M-SETUP-DB2-ABEND                       00353700
355000*    END-EVALUATE                                                 00353800
355100*                                                                 00353900
355200*    .                                                            00354000
355300*5640M-EXIT.                                                      00354100
355400*    EXIT                                                         00354200
355500*    .                                                            00354300
355600                                                                  00354400
355700 5999M-SETUP-DB2-ABEND.                                           00354500
355800                                                                  00354600
355900     SET WS-ABEND-SQL-ERROR  TO TRUE                              00354700
356000     MOVE SQLCODE            TO HE-SQL-RETURN-CODE                00354800
356100     MOVE SQLWARN0           TO HE-SQL-WARNING                    00354900
356200     MOVE SQLERRMC           TO HE-SQL-ERROR-MESSAGE              00355000
356300                                                                  00355100
356400     CALL "DSNTIAR" USING    SQLCA                                00355200
356500                             SQLERR-MESSAGE-AREA                  00355300
356600                             SQLERR-TEXT-LENGTH                   00355400
356700                                                                  00355500
356800     MOVE SQLERR-LINE-1      TO HE-SQL-MSG1                       00355600
356900     MOVE SQLERR-LINE-2      TO HE-SQL-MSG2                       00355700
357000     MOVE SQLERR-LINE-3      TO HE-SQL-MSG3                       00355800
357100     MOVE SQLERR-LINE-4      TO HE-SQL-MSG4                       00355900
357200                                                                  00356000
357300     PERFORM 9990H-ABNORMAL-END-OF-JOB                            00356100
357400                                                                  00356200
357500     .                                                            00356300
357600 6000A-CLOSE-CURSORS.                                             00356400
357700***************************************************************** 00356500
357800*                                                               * 00356600
357900* THIS PARAGRAPH SHOULD BE USED AS PART OF NORMAL CHECKPOINT    * 00356700
358000* PROCESSING. ALL DB2 CURSORS MUST BE CLOSED PRIOR TO ISSUING   * 00356800
358100* THE CHECKPOINT.                                               * 00356900
358200*                                                               * 00357000
358300***************************************************************** 00357100
358400*                                                                 00357200
358500     CONTINUE                                                     00357300
358600     .                                                            00357400
358700                                                                  00357500
358800 6000A-EXIT.                                                      00357600
358900     EXIT.                                                        00357700
359000                                                                  00357800
359100     EJECT                                                        00357900
359200     COPY  HBP6100I.                                              00358000
359300                                                                  00358100
359400     EJECT                                                        00358200
359500 6110A-SAVE-APPL-SPECIFIC-DATA.                                   00358300
359600***************************************************************** 00358400
359700*                                                               * 00358500
359800* THIS PARAGRAPH IS USED TO SAVE ANY DATA WHICH THE APPLICATION * 00358600
359900* WOULD LIKE TO HAVE AVAILABLE ON PROGRAM RESTART.              * 00358700
360000* "WS-APPL-SPECIFIC-XRST-AREA" IS PART OF WS-XRST-AREA, AND IS  * 00358800
360100* SAVED WITH THE CODE PROVIDED.  MAKE COPIES OF OTHER DATA YOU  * 00358900
360200* WISH TO SAVE AND ADD THEIR NAMES TO THE CHKP CALL IN PARA     * 00359000
360300* 6120A AND TO THE XRST CALL IN PARA 1010A.  THESE MOVES MAY    * 00359100
360400* BE DELETED IF YOU DON'T USE BR&T.                             * 00359200
360500*                                                               * 00359300
360600***************************************************************** 00359400
360700*                                                                 00359500
360800     MOVE WS-APPL-SAVE-AREA           TO WS-XRST-SAVE-AREA        00359600
360900                                                                  00359700
361000     IF SECOND-CHKP-TAKEN OR WS-CHKP-ID(5:4) > "0000"             00359800
361100         ADD +1                       TO WS-XRST-CHKP-CNT         00359900
361200     ELSE                                                         00360000
361300         MOVE ZEROES                  TO WS-XRST-CHKP-CNT         00360100
361400     END-IF                                                       00360200
361500                                                                  00360300
361600     MOVE WS-XRST-CHKP-CNT         TO  WS-CHKP-ID-CTR             00360400
361700     MOVE WS-PGM-CHKP              TO  WS-CHKP-ID                 00360500
361800     .                                                            00360600
361900 6110A-EXIT.                                                      00360700
362000     EXIT.                                                        00360800
362100     EJECT                                                        00360900
362200 6120A-CHKP-CALL.                                                 00361000
362300     COPY HBP6120I.                                               00361100
362400                                                                  00361200
362500***************************************************************** 00361300
362600*    THE IMS CHECKPOINT CALL BEGINS IN THE COPYBOOK ABOVE.      * 00361400
362700*    ADD HERE ANY AREAS YOU WANT RESTORED WITH THE XRST IN      * 00361500
362800*    PARAGRAPH 1010A.  DELETE THE REFERENCES TO AREAS YOU       * 00361600
362900*    DON'T NEED TO SAVE.                                        * 00361700
363000***************************************************************** 00361800
363100                                                                  00361900
363200*                            WS-RQST-RECORD-TABLE-LENGTH          00362000
363300*                            WS-RQST-RECORD-TABLE                 00362100
363400*                            WS-COMPLETED-RQST-LENGTH             00362200
363500*                            WS-COMPLETED-RQST-TABLE              00362300
363600******                                                            00362400
363700******                       ADD YOUR CHKP SAVE AREA(S) HERE.     00362500
363800******                       YOU MAY DELETE ANY OF THE LENGTH/    00362600
363900******                       AREA PAIRS ABOVE THAT YOU DO NOT     00362700
364000******                       NEED, AND THERE MAY BE AS MANY       00362800
364100******                       AS SEVEN PAIRS IN ALL.               00362900
364200******                       (COPYBOOK HBP6120I USES ONE.)        00363000
364300******                                                            00363100
364400******    THE FOLLOWING LINE CONTAINS THE REQUIRED PERIOD         00363200
364500                             .                                    00363300
364600 6120A-EXIT.                                                      00363400
364700     EXIT.                                                        00363500
364800                                                                  00363600
364900     EJECT                                                        00363700
365000 6200A-POST-CHKP-PROCESS.                                         00363800
365100***************************************************************** 00363900
365200*                                                               * 00364000
365300* THIS PARAGRAPH IS PERFORMED AFTER TAKING A CHECKPOINT.        * 00364100
365400*                                                               * 00364200
365500***************************************************************** 00364300
365600*                                                                 00364400
365700*** ANY IMS/VS NON-GSAM DATABASES IN USE AT THE TIME OF           00364500
365800*** THE CHECKPOINT HAVE LOST THEIR POSITION. IF THE APPL-         00364600
365900*** ICATION MUST CONTINUE PROCESSING ONE OF THESE DATA            00364700
366000*** BASES AT POINT WHERE IT LEFT OFF, THE DATA BASES MUST         00364800
366100*** BE RE-POSITIONED.                                             00364900
366200***                                                               00365000
366300*** ANY DB2 CURSORS IN USE AT THE TIME OF THE CHECKPOINT          00365100
366400*** HAVE BEEN CLOSED. IF IT IS NECESSARY TO CONTINUE              00365200
366500*** PROCESSING THE DRIVING CURSOR AT THE POINT WHERE IT           00365300
366600*** LEFT OFF, THE APPLICATION MUST POSITION AND RE-OPEN           00365400
366700*** THE DRIVING CURSOR HERE.                                      00365500
366800***                                                               00365600
366900     CONTINUE                                                     00365700
367000     .                                                            00365800
367100 6200A-EXIT.                                                      00365900
367200     EXIT.                                                        00366000
367300     EJECT                                                        00366100
367400                                                                  00366200
367500 6500A-DETECT-INTERNAL-RESTART.                                   00366300
367600***************************************************************** 00366400
367700*                                                               * 00366500
367800*  THIS PARAGRAPH CHECKS THE "SQLCODE" RETURNED FROM A DB2      * 00366600
367900*  CALL. IF THE CODE INDICATES THAT THE PROGRAM HAS BEEN RE-    * 00366700
368000*  STARTED AFTER A DEADLOCK SITUATION ("DEADLY EMBRACE"), THEN  * 00366800
368100*  THIS PARAGRAPH SETS THE APPROPRIATE SWITCH. THE PROGRAM      * 00366900
368200*  THEN ATTEMPTS TO CONTINUE PROCESSING. SHOULD THIS SITUATION  * 00367000
368300*  OCCUR AGAIN, THIS PARAGRAPH COUNTS THE NUMBER OF TIMES IT    * 00367100
368400*  HAS BEEN INVOKED ("WS-INTERNAL-RESTART-COUNTER").  IF IT BE  * 00367200
368500*  INVOKED TOO MANY TIMES (PERS2PS INDICATING A RECURRENT LOOP) * 00367300
368600*  IT SETS "SW-INTERNAL-RESTART-LIMIT-REACHED".  THE PROGRAM    * 00367400
368700*  WILL THEN ABNORMALLY TERMINATE.                              * 00367500
368800*                                                               * 00367600
368900*  IF THIS PARAGRAPH IS BEING PERFORMED AS INDICATED IN PARA    * 00367700
369000*  3600A-PROCESS-BATCH-UOW, UNCOMMENT THE FOLLOWING CODE.       * 00367800
369100*                                                               * 00367900
369200***************************************************************** 00368000
369300                                                                  00368100
369400     IF  SQLCODE  EQUAL  WS-SQLCODE-DEADLOCK                      00368200
369500         SET INTERNAL-RESTART TO TRUE                             00368300
369600         ADD +1  TO  WS-INTERNAL-RESTART-COUNTER                  00368400
369700         IF  WS-INTERNAL-RESTART-COUNTER  GREATER THAN            00368500
369800                     WS-INTERNAL-RESTART-MAX                      00368600
369900             SET INTERNAL-RESTART-LIMIT-REACHED TO TRUE.          00368700
370000                                                                  00368800
370100 6500A-EXIT.                                                      00368900
370200     EXIT.                                                        00369000
370300     EJECT                                                        00369100
370400     COPY  HBP7000I.                                              00369200
370500                                                                  00369300
370600     EJECT                                                        00369400
370700     COPY  HBP7010I.                                              00369500
370800                                                                  00369600
370900     EJECT                                                        00369700
371000 7100A-PREPARE-FOR-BATCH.                                         00369800
371100***                                                               00369900
371200***  PARAGRAPH 7100A IS PERFORMED AFTER EACH BATCH OF REQUESTS    00370000
371300***  IS OBTAINED.  HERE THE PROGRAMMER MAY PREPARE TO PROCESS     00370100
371400***  THE BATCH; E.G., SET A SUBSCRIPT TO POINT TO THE FIRST       00370200
371500***  REQUEST.                                                     00370300
371600***                                                               00370400
371700     CONTINUE                                                     00370500
371800     .                                                            00370600
371900                                                                  00370700
372000 7100A-EXIT.                                                      00370800
372100     EXIT.                                                        00370900
372200     EJECT                                                        00371000
372300 7300A-APPL-OBTAIN-REQUESTS.                                      00371100
372400***************************************************************** 00371200
372500*                                                               * 00371300
372600*  THIS PARAGRAPH SHOULD BE USED TO OBTAIN REQUEST FOR THE      * 00371400
372700*  PROGRAM TO PROCESS WHEN THE BATCH REQUEST TABLE IS NOT       * 00371500
372800*  USED.                                                        * 00371600
372900*                                                               * 00371700
373000*  NOTE:  THE PROGRAMMER IS RESPONSIBLE FOR SETTING THE SWITCH  * 00371800
373100*         "VALID-PARAMETER".  THIS WILL INFORM THE SHELL TO     * 00371900
373200*         CONTINUE PROCESSING.                                  * 00372000
373300*                                                               * 00372100
373400*  PLEASE NOTE THAT WHEN THIS PARAGRAPH DETECTS THE INPUT HAS   * 00372200
373500*  BEEN EXHAUSTED, IS IN ERROR, OR DEADLOCK OCCURS, THE         * 00372300
373600*  FOLLOWING SWITCH MUST BE SET:                                * 00372400
373700*                                                               * 00372500
373800*  "SET NO-MORE-REQUESTS-TO-PROCESS TO TRUE".                   * 00372600
373900*                                                               * 00372700
374000*  WHEN THE INPUT HAS BEEN EXHAUSTED SET THE FOLLOWING SWITCH   * 00372800
374100*                                                               * 00372900
374200*  "SET END-BATCH-CNTL TO TRUE".                                * 00373000
374300*                                                               * 00373100
374400*   THE APPLICATION PROGRAM IS RESPONSIBLE FOR OBTAINING        * 00373200
374500*   REQUEST INFORMATION, AND STORING IT IN A SUITABLE PLACE.    * 00373300
374600*                                                               * 00373400
374700*?  IF THE PROGRAM PROCESSES BOTH BR&T AND BATCH CONTROL        * 00373500
374800*?  PARAMETERS, WHEN A NEW PLANT IS OBTAINED THE PROGRAMMER     * 00373600
374900*?  MUST SET WS-RQST-PROCESSED-SW (1) TO 'F'.  THIS WILL ALLOW  * 00373700
375000*?  THE BR&T PROCESSING TO LOOK FOR THE NEW BR&T REQUEST ID.    * 00373800
375100*?  PLEASE SEE TO DOCUMENTATION FOR FURTHER EXPLAINATION OF     * 00373900
375200*?  THIS PROCESSING.                                            * 00374000
375300*?                                                              * 00374100
375400*?  WE HAVE ALLOWED FOR THE PROCESSING OF THE 'IN-RALPH-ED'     * 00374200
375500*?  FLAG.  WHEN YOU VALIDATE THE NEW BATCH CONTROL PLANT OR     * 00374300
375600*?  WHEREVER YOU OBTAIN YOUR PLANT PROCESSING INFORMATION FROM, * 00374400
375700*?  IF THE FLAG IS ON, YOU CAN SET 'IN-RALPH-ED-FLAG' TO TRUE.  * 00374500
375800*?  THE SHELL WILL RESET THE SWITCH PRIOR TO PERFORMING THIS    * 00374600
375900*?  PARAGRAPH.  PLEASE SEE THE DOCUMENTATION FOR FURTHER        * 00374700
376000*?  INFORMATION ON THIS SUBJECT.  IF YOU ARE NOT CONCERNED WITH * 00374800
376100*?  THIS PROCESSING, NO ACTION IS REQUIRED.  THE SHELL WILL NOT * 00374900
376200*?  DEMAND THAT YOU ALTER THE SWITCH AT ALL.                    * 00375000
376300*                                                               * 00375100
376400***************************************************************** 00375200
376500*                                                                 00375300
376600*                                                                 00375400
376700     SET VALID-PARAMETER                  TO TRUE.                00375500
376800                                                                  00375600
376900     IF  REQUEST-COMPLETE                                         00375700
377000         SET NO-MORE-REQUESTS-TO-PROCESS  TO TRUE                 00375800
377100         SET END-BATCH-CNTL               TO TRUE                 00375900
377200     END-IF.                                                      00376000
377300                                                                  00376100
377400 7300A-EXIT.                                                      00376200
377500     EXIT.                                                        00376300
377600     EJECT                                                        00376400
377700     COPY  HBP7700I.                                              00376500
377800                                                                  00376600
377900      EJECT                                                       00376700
378000 7720A-APPL-HANDLE-HBRT-ERROR.                                    00376800
378100***************************************************************** 00376900
378200*                                                               * 00377000
378300*  THIS PARAGRAPH SHOULD BE USED TO HANDLE ANY INVALID STATUS   * 00377100
378400*  CODE RETURNED FROM "HBRTINIT".  THE FOLLOWING IS AN EXAMPLE  * 00377200
378500*  OF ERROR PROCESSING WITH FATAL ERROR SETUP                   * 00377300
378600***************************************************************** 00377400
378700***                                                               00377500
378800***  IF REQUEST-NOT-FOUND                                         00377600
378900***      SETUP ERROR PROCESSING                                   00377700
379000***  ELSE                                                         00377800
379100***      SET WS-ABEND-IMS-ERROR TO TRUE                           00377900
379200***      MOVE LIT-PARA-7720A TO HE-PARAGRAPH                      00378000
379300***      MOVE PCB-BRT-STATUS-CODE TO HE-STATUS                    00378100
379400***      MOVE PCB-BRT-SEG-LEVEL TO HE-LEVEL                       00378200
379500***      MOVE SPACES TO HE-SSA1 HE-SSA2 HE-SSA3                   00378300
379600***                     HE-SSA4 HE-SSA5                           00378400
379700***      MOVE LIT-HS2PBRTI TO WS-SUB-NAME                         00378500
379800***      MOVE WS-SUBROUTINE-ABEND TO HE-MSG1                      00378600
379900***      STRING "RETURN CODE= ", HBRTINIT-RETURN-CODE             00378700
380000***             DELIMITED BY SIZE INTO HE-MSG2                    00378800
380100***      PERFORM 9990H-ABNORMAL-END-OF-JOB THRU                   00378900
380200***              9990H-EXIT.                                      00379000
380300     CONTINUE                                                     00379100
380400     .                                                            00379200
380500                                                                  00379300
380600 7720A-EXIT.                                                      00379400
380700      EXIT.                                                       00379500
380800      EJECT                                                       00379600
380900 7800A-OBTAIN-RUN-TIME-PARMS.                                     00379700
381000***************************************************************** 00379800
381100*                                                               * 00379900
381200*  THIS PARAGRAPH OBTAINS VARIOUS FIELDS WHICH THE PROGRAM      * 00380000
381300*  REQUIRES.                                                    * 00380100
381400*                                                               * 00380200
381500*  NOTE:  STANDARD CHECKPOINT FREQUENCY FILE PROCESSING IS      * 00380300
381600*         NOW DONE IN PARAGRAPH 1000H.                          * 00380400
381700*                                                               * 00380500
381800***************************************************************** 00380600
381900     CONTINUE                                                     00380700
382000     .                                                            00380800
382100 7800A-EXIT.                                                      00380900
382200     EXIT.                                                        00381000
382300     EJECT                                                        00381100
382400     COPY  HBP8000I.                                              00381200
382500     EJECT                                                        00381300
382600     COPY  HBP8020I.                                              00381400
382700     EJECT                                                        00381500
382800     COPY  HBP8030I.                                              00381600
382900                                                                  00381700
383000     EJECT                                                        00381800
383100 8040A-APPL-HANDLE-HBRT-ERROR.                                    00381900
383200***************************************************************** 00382000
383300*                                                               * 00382100
383400* THIS PARAGRAPH SHOULD BE USED TO HANDLE ANY ERROR STATUS CODES* 00382200
383500* PASSED BACK FROM CALLS TO "HBRTINIT".  THE FOLLOWING IS AN    * 00382300
383600* EXAMPLE FOR FATAL ERROR SETUP.                                * 00382400
383700***************************************************************** 00382500
383800***                                                               00382600
383900***  SET WS-ABEND-IMS-ERROR TO TRUE                               00382700
384000***  MOVE LIT-PARA-8040A TO HE-PARAGRAPH.                         00382800
384100***  MOVE PCB-BRT-STATUS-CODE TO HE-STATUS.                       00382900
384200***  MOVE PCB-BRT-SEG-LEVEL TO HE-LEVEL.                          00383000
384300***  MOVE SPACES TO HE-SSA1 HE-SSA2 HE-SSA3                       00383100
384400***                 HE-SSA4 HE-SSA5.                              00383200
384500***  MOVE LIT-HS2PBRTI TO WS-SUB-NAME                             00383300
384600***  MOVE WS-SUBROUTINE-ABEND TO HE-MSG1.                         00383400
384700***  STRING "RETURN CODE= ", HBRTINIT-RETURN-CODE                 00383500
384800***         DELIMITED BY SIZE INTO HE-MSG2.                       00383600
384900***  PERFORM 9990H-ABNORMAL-END-OF-JOB THRU                       00383700
385000***          9990H-EXIT.                                          00383800
385100*                                                                 00383900
385200     CONTINUE                                                     00384000
385300     .                                                            00384100
385400 8040A-EXIT.                                                      00384200
385500     EXIT.                                                        00384300
385600     EJECT                                                        00384400
385700     COPY  HBP8060I.                                              00384500
385800                                                                  00384600
385900     EJECT                                                        00384700
386000***************************************************************** 00384800
386100*                                                               * 00384900
386200* THIS PARAGRAPH ACCESES THE MAILBOX SUBSYSTEM.   IF YOU DO     * 00385000
386300* NOT USE MAILBOX, YOU MAY REMOVE IT AND COPYBOOKS MAILISRT     * 00385100
386400* AND HBP8110I, AND PARAGRAPH 8120A.                            * 00385200
386500*                                                               * 00385300
386600* TO USE THIS ROUTINE, YOU MUST:                                * 00385400
386700*  1) SET FIELDS IN "WS-MB-MESSAGE-ID-AREA" TO THE REGION,      * 00385500
386800*     DEPT, AND USER-ID OF THE MESSAGE DESTINATION.             * 00385600
386900*  2) SET "WS-MB-MESSAGE-TYPE" TO A VALID MESSAGE TYPE.         * 00385700
387000*  3) SET "WS-MB-SCREEN-MESSAGE" TO THE REQUIRED MESSAGE.       * 00385800
387100*  4) SET "WS-MB-PFKEY-" DATA TO THE APPROPRIATE START-UP PFKEY * 00385900
387200*     DATA.                                                     * 00386000
387300*  5) SET "WS-MB-PFKEY-SEG-COUNT" TO THE NUMBER OF POSSIBLE     * 00386100
387400*     PFKEY SEGMENTS IN THE WS- AREA.                           * 00386200
387500*  6) SET ANY OPTIONAL PARAMETERS (IF NECESSARY -- THEY WILL    * 00386300
387600*     BE BLANK OTHERWISE) IN "WS-MB-OPTIONAL-MESSAGE-AREA".     * 00386400
387700*                                                               * 00386500
387800***************************************************************** 00386600
387900*                                                                 00386700
388000     COPY  HBP8100I.                                              00386800
388100                                                                  00386900
388200     EJECT                                                        00387000
388300     COPY  HBP8110I.                                              00387100
388400                                                                  00387200
388500     EJECT                                                        00387300
388600 8120A-APPL-MAILBOX-RETURN.                                       00387400
388700***************************************************************** 00387500
388800*                                                               * 00387600
388900*  THIS PARAGRAPH SHOULD BE USED BY THE APPLICATION WHEN USING  * 00387700
389000*  THE "MAILBOX" FUNCTION TO CHECK RETURN CODES FROM "HS2PMAII".* 00387800
389100*                                                               * 00387900
389200***************************************************************** 00388000
389300*                                                                 00388100
389400     CONTINUE                                                     00388200
389500     .                                                            00388300
389600 8120A-EXIT.                                                      00388400
389700     EXIT.                                                        00388500
389800                                                                  00388600
389900     EJECT                                                        00388700
390000                                                                  00388800
390100 8500M-SEL-SMMPD59-VL.                                            00388900
390200     EXEC SQL                                                     00389000
390300          SELECT "Y"                                              00389100
390400                INTO :WS-EXISTS                                   00389200
390500          FROM SMMPD59_PTVL_INFO                                  00389300
390600          WHERE VEHTYPE_CODE        = :SMMPD60.VEHTYPE-CODE       00389400
390700          AND   PTEIO_ORIGIN_C      = :SMMPD60.PTEIO-ORIGIN-C     00389500
390800          AND   EVL_VEHICLE_LINE_C  = :SMMPD60.EVL-VEHICLE-LINE-C 00389600
390900          AND   MMPD59_MDLYR_Y      = :SMMPD60.MMPD59-MDLYR-Y     00389700
391000     END-EXEC                                                     00389800
391100                                                                  00389900
391200     EVALUATE SQLCODE                 ALSO SQLWARN0               00390000
391300         WHEN DB2-SUCCESSFUL-RETURN   ALSO SPACES                 00390100
391400         WHEN DB2-MORE-THAN-ONE-ROW   ALSO ANY                    00390200
391500              SET WS-88-D59ROW-FOUND TO TRUE                      00390300
391600         WHEN DB2-NOT-FOUND           ALSO ANY                    00390400
391700              SET WS-88-D59ROW-NOT-FOUND TO TRUE                  00390500
391800         WHEN OTHER                                               00390600
391900              MOVE LIT-PARAGRAPH-8500M       TO HE-PARAGRAPH      00390700
392000              MOVE DB2-SELECT-CALL           TO HE-SQL-FUNCTION   00390800
392100              MOVE MMPD59-MDLYR-Y OF SMMPD60 TO WS-NUM-MDLYR      00390900
392200              STRING                                              00391000
392300                 VEHTYPE-CODE    OF SMMPD60 DELIMITED BY SIZE     00391100
392400                   ","                  DELIMITED BY SIZE         00391200
392500                 EVL-VEHICLE-LINE-C OF SMMPD60 DELIMITED BY SIZE  00391300
392600                   ","                  DELIMITED BY SIZE         00391400
392700                 PTEIO-ORIGIN-C     OF SMMPD60 DELIMITED BY SIZE  00391500
392800                   ","                  DELIMITED BY SIZE         00391600
392900                 WS-NUM-MDLYR           DELIMITED BY SIZE         00391700
393000                   INTO               HE-MSG1                     00391800
393100              END-STRING                                          00391900
393200              MOVE 'SELECT D59 8500M PARA ' TO HE-MSG2            00392000
393300              PERFORM 5999M-SETUP-DB2-ABEND                       00392100
393400     END-EVALUATE                                                 00392200
393500     .                                                            00392300
393600 8500M-SEL-EXIT.                                                  00392400
393700     EXIT                                                         00392500
393800     .                                                            00392600
393900 8500M-POPULATE-SMMPD59.                                          00392700
394000     MOVE WS-D68-VEHTYPE         TO VEHTYPE-CODE        OF SMMPD5900392800
394100     MOVE LIT-WERS               TO PTEIO-ORIGIN-C      OF SMMPD5900392900
394200     MOVE WS-D68-VEHICLE-LINE    TO EVL-VEHICLE-LINE-C  OF SMMPD5900393000
394300     MOVE WS-MDLYR               TO MMPD59-MDLYR-Y      OF SMMPD5900393100
394400     MOVE WS-ISO-DATE-TIME-STAMP TO MMPD59-LAST-UPD-S   OF SMMPD5900393200
394500     MOVE PROGRAM-NAME           TO MMPD59-LAST-UPD-C   OF SMMPD5900393300
394600     PERFORM 8510M-SEL-SMMPD50-VL                                 00393400
394700        THRU 8510M-EXIT                                           00393500
394800     PERFORM 8520M-LOAD-SMMPD59                                   00393600
394900        THRU 8520M-EXIT                                           00393700
395000     .                                                            00393800
395100                                                                  00393900
395200 8500M-EXIT.                                                      00394000
395300     EXIT                                                         00394100
395400     .                                                            00394200
395500 8510M-SEL-SMMPD50-VL.                                            00394300
395600     EXEC SQL                                                     00394400
395700          SELECT PRTPEIO_DESC_X                                   00394500
395800                INTO :SMMPD59.MMPD59-VEH-LINE-N                   00394600
395900          FROM SMMPD50_PRDTP_VHLN                                 00394700
396000          WHERE VEHTYPE_CODE        = :SMMPD59.VEHTYPE-CODE       00394800
396100          AND   PTEIO_ORIGIN_C      = :SMMPD59.PTEIO-ORIGIN-C     00394900
396200          AND   EVL_VEHICLE_LINE_C  = :SMMPD59.EVL-VEHICLE-LINE-C 00395000
396300          FETCH FIRST ROW ONLY                                    00395100
396400     END-EXEC                                                     00395200
396500     EVALUATE SQLCODE                 ALSO SQLWARN0               00395300
396600         WHEN DB2-SUCCESSFUL-RETURN   ALSO SPACES                 00395400
396700              CONTINUE                                            00395500
396800         WHEN DB2-NOT-FOUND           ALSO ANY                    00395600
396900              CONTINUE                                            00395700
397000         WHEN OTHER                                               00395800
397100              MOVE LIT-PARAGRAPH-8510M     TO HE-PARAGRAPH        00395900
397200              MOVE DB2-SELECT-CALL         TO HE-SQL-FUNCTION     00396000
397300              STRING                                              00396100
397400                 VEHTYPE-CODE       OF SMMPD59 DELIMITED BY SIZE  00396200
397500                   ","                  DELIMITED BY SIZE         00396300
397600                 PTEIO-ORIGIN-C     OF SMMPD59 DELIMITED BY SIZE  00396400
397700                   ","                  DELIMITED BY SIZE         00396500
397800                 EVL-VEHICLE-LINE-C OF SMMPD59 DELIMITED BY SIZE  00396600
397900                   INTO               HE-MSG1                     00396700
398000              END-STRING                                          00396800
398100              PERFORM 5999M-SETUP-DB2-ABEND                       00396900
398200     END-EVALUATE                                                 00397000
398300     .                                                            00397100
398400                                                                  00397200
398500 8510M-EXIT.                                                      00397300
398600     EXIT                                                         00397400
398700     .                                                            00397500
398800 8520M-LOAD-SMMPD59.                                              00397600
398900     EXEC SQL                                                     00397700
399000          INSERT INTO SMMPD59_PTVL_INFO                           00397800
399100          (VEHTYPE_CODE                                           00397900
399200          ,PTEIO_ORIGIN_C                                         00398000
399300          ,EVL_VEHICLE_LINE_C                                     00398100
399400          ,MMPD59_MDLYR_Y                                         00398200
399500          ,MMPD59_VEH_LINE_N                                      00398300
399600          ,MMPD59_LAST_UPD_S                                      00398400
399700          ,MMPD59_LAST_UPD_C                                      00398500
399800          )                                                       00398600
399900          VALUES                                                  00398700
400000          (:SMMPD59.VEHTYPE-CODE                                  00398800
400100          ,:SMMPD59.PTEIO-ORIGIN-C                                00398900
400200          ,:SMMPD59.EVL-VEHICLE-LINE-C                            00399000
400300          ,:SMMPD59.MMPD59-MDLYR-Y                                00399100
400400          ,:SMMPD59.MMPD59-VEH-LINE-N                             00399200
400500          ,:SMMPD59.MMPD59-LAST-UPD-S                             00399300
400600          ,:SMMPD59.MMPD59-LAST-UPD-C                             00399400
400700          )                                                       00399500
400800     END-EXEC                                                     00399600
400900     EVALUATE SQLCODE               ALSO SQLWARN0                 00399700
401000     WHEN DB2-SUCCESSFUL-RETURN ALSO SPACES                       00399800
401100          ADD +1 TO WS-SMMPD59-ISRT-CNT                           00399900
401200     WHEN DB2-DUPLICATE-ROW     ALSO ANY                          00400000
401300          CONTINUE                                                00400100
401400     WHEN OTHER                                                   00400200
401500          MOVE LIT-PARAGRAPH-8520M        TO HE-PARAGRAPH         00400300
401600          MOVE DB2-INSERT-CALL            TO HE-SQL-FUNCTION      00400400
401700          MOVE LIT-MMPD-WERS-PTVL-INFO-N                          00400500
401800                                          TO HE-DB2-TABLE1        00400600
401900          STRING                                                  00400700
402000               VEHTYPE-CODE       OF SMMPD60 ","                  00400800
402100               EVL-VEHICLE-LINE-C OF SMMPD60 ","                  00400900
402200               DELIMITED BY SIZE          INTO HE-MSG2            00401000
402300          END-STRING                                              00401100
402400          PERFORM 5999M-SETUP-DB2-ABEND                           00401200
402500     END-EVALUATE                                                 00401300
402600     .                                                            00401400
402700                                                                  00401500
402800 8520M-EXIT.                                                      00401600
402900     EXIT                                                         00401700
403000     .                                                            00401800
403100                                                                  00401900
403200 8300A-CALL-CHECK-DATA.                                           00402000
403300***************************************************************** 00402100
403400*                                                               * 00402200
403500* THIS PARAGRAPH CONTAINS SAMPLE CODE WHICH MAY BE USED TO CALL * 00402300
403600* THE "HS2PCHKD" ROUTINE.  YOU MAY REMOVE IT, AND COPYBOOK      * 00402400
403700* CHKDATA, IF YOU ARE NOT USING "HCHKDATA."                     * 00402500
403800*                                                               * 00402600
403900*  PLEASE BE ADVISED 'HS2PCHKD' PASSES BACK A RETURN CODE       * 00402700
404000*  TO INDICATE A DEADLOCK CONDITION.  THE APPLICATION MUST      * 00402800
404100*  PROVIDE FOR THIS RETURN CODE FOLLOWING THE CALL BELOW.       * 00402900
404200*  AN '88' LEVEL 'CHKDATA-DEADLOCK-OCCURRED' HAS BEEN PROVIDED  * 00403000
404300*  IN COPYBOOK CHKDATA FOR THIS RETURN CODE.                    * 00403100
404400***************************************************************** 00403200
404500*                                                                 00403300
404600     MOVE SPACES TO CHECK-DATA-PARM.                              00403400
404700***                                                               00403500
404800***  SET THE FOLLOWING FIELDS:                                    00403600
404900***                                                               00403700
405000***     REGION    --  SET TO THE REGION OF THE REQUESTING USER    00403800
405100***     DEPT-ID   --  SET TO THE DEPARTMENT ID OF THE REQUESTING  00403900
405200***                       USER                                    00404000
405300***     USER-ID   --  SET TO THE USER ID OF THE REQUESTING USER   00404100
405400***     CHKDATA-ELEMENT-ID -- ELEMENT ID TO BE CHECKED (NUMBER)   00404200
405500***     CHKDATA-ELEMENT-VALUE -- ELEMENT VALUE TO BE CHECKED      00404300
405600***     CHKDATA-ELEMENT-ACCESS -- 'I' FOR INQUIRY OR              00404400
405700***                               'U' FOR UPDATE                  00404500
405800***                                                               00404600
405900     CALL "HS2PCHKD"  USING  CHECK-DATA-PARM                      00404700
406000                             PCB-HSECURITY.                       00404800
406100                                                                  00404900
406200     IF CHKDATA-USER-AUTHORIZED                                   00405000
406300         NEXT SENTENCE                                            00405100
406400     ELSE                                                         00405200
406500***  IF CHKDATA-USER-NOT-AUTHORIZED                               00405300
406600***      SETUP ERROR PROCESSING                                   00405400
406700***  ELSE                                                         00405500
406800         MOVE LIT-PARA-8300A TO HE-PARAGRAPH                      00405600
406900         SET WS-ABEND-IMS-ERROR TO TRUE                           00405700
407000         MOVE PCB-HSECUR-STATUS-CODE TO HE-STATUS                 00405800
407100         MOVE PCB-HSECUR-SEG-LEVEL TO HE-LEVEL                    00405900
407200         MOVE SPACES TO HE-SSA1 HE-SSA2 HE-SSA3                   00406000
407300                        HE-SSA4 HE-SSA5                           00406100
407400         MOVE LIT-HS2PCHKD TO WS-SUB-NAME                         00406200
407500         MOVE WS-SUBROUTINE-ABEND TO HE-MSG1.                     00406300
407600         STRING "RETURN CODE= ", CHKDATA-RETURN-SWITCH            00406400
407700                DELIMITED BY SIZE INTO HE-MSG2                    00406500
407800         PERFORM 9990H-ABNORMAL-END-OF-JOB THRU                   00406600
407900                 9990H-EXIT.                                      00406700
408000                                                                  00406800
408100 8300A-EXIT.                                                      00406900
408200     EXIT.                                                        00407000
408300     EJECT                                                        00407100
408400     COPY  ABENDBAT.                                              00407200
408500                                                                  00407300
408600     EJECT                                                        00407400
408700 9995A-APPL-ABORT-PROCESS.                                        00407500
408800***                                                               00407600
408900***  ON ENTRY TO THIS PARAGRAPH, THE ABORT MESSAGE HAS BEEN       00407700
409000***  FORMATTED IN HARDCOPY-ERROR.  THE SHELL HAS TRIED TO GET     00407800
409100***  THE WS-PROD-SUPP-LTERM AND WS-SEC-COORD-LTERM FROM THE       00407900
409200***  TABLES DATA BASE IF THE FIELDS WERE BLANK.                   00408000
409300***                                                               00408100
409400***  IN THIS PARAGRAPH, YOU MAY SEND THE ABORT MESSAGE VIA        00408200
409500***  THE MAIL SUBSYSTEM INSTEAD OF THROUGH IMS.  YOU MAY          00408300
409600***  ALSO SEND THE MESSAGE ANY WAY YOU LIKE TO DESTINATIONS       00408400
409700***  IN ADDITION TO THE SUPPORT AGENCY OR SECTION COORDINATOR.    00408500
409800***                                                               00408600
409900***  BEFORE LEAVING, MOVE SPACES TO WS-PROD-SUPP-LTERM AND/OR     00408700
410000***  WS-SEC-COORD-LTERM TO SUPPRESS THEIR USE TO RECEIVE THE      00408800
410100***  HARDCOPY MESSAGE, OR REPLACE THEM WITH NON-BLANK VALUES      00408900
410200***  TO ESTABLISH DIFFERENT LTERMS.                               00409000
410300***                                                               00409100
410400***  FOR TESTING PURPOSES, SPACES ARE MOVED TO "WS-SEC-COORD-     00409200
410500***  LTERM" TO SUPPRESS PRINTING OF ABEND MESSAGES TO FORD'S      00409300
410600***  ABEND PRINTER.  AS LONG AS DBUG IS ON THE ABORT MESSAGE      00409400
410700***  WILL NOT PRINT AT FORD.                                      00409500
410800***                                                               00409600
410900*    MOVE SPACES  TO  WS-SEC-COORD-LTERM.                         00409700
411000*    MOVE LIT-YES TO  SW-FATAL-ERROR-PRT.                         00409800
411100***                                                               00409900
411200     CONTINUE                                                     00410000
411300     .                                                            00410100
411400 9995A-EXIT.                                                      00410200
411500     EXIT.                                                        00410300
411600*                                                                 00410400
411700*                                                                 00410500
411800********************                                              00410600
411900** END OF PROGRAM **                                              00410700
412000********************                                              00410800
